<template>
  <v-container fluid id="content">
    <div class="mb-4 pa-4" id="class2-desc">
      <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
    </div>

    <p>プログラミングで「伝える」コースへようこそ。<br /></p>

    <p>
      このコースでは、Web制作、Webデザインなどを通じて、<br />
      それを見た人に効果的に意図や情報を伝えることを学習します。<br />
      特にUXやUIといった、直接、ユーザーや他者との接点となるものが「創る価値」となる点において、<br />
      全てのコースの基礎になるといっても過言ではありません。
    </p>

    <p>
      このコースではHTML、CSS、JavaScriptや付随するフレームワーク、ライブラリなどを用いて、<br />
      独創的かつ科学的、そしてユーザー視点でのWebデザインができるようになり、<br />
      それをプロダクトに落とし込むことで価値を生み出すことを目標とします。
    </p>

    <ul class="agenda">
      <li>0-0　Class2</li>
      <li>1-0　調べ学習のすゝめ</li>
      <li>1-1　調べる力</li>
      <li>1-2　検索の仕方</li>
      <li>1-3　質問の仕方</li>
      <li>1-4　学びを言語化しよう</li>
      <li>1-5　パブリックポスティングの重要性</li>
      <li>2-0　Web制作</li>
      <li>2-1　Webサイトとは</li>
      <li>2-2　Webサイトの仕組み</li>
      <li>2-3　Webページ表示の仕組み</li>
      <li>2-4　Webアプリとの違い</li>
      <li>2-5　Web制作のすゝめ</li>
    </ul>

    <p>※β版ではJavaScriptを軸に学習していくロードのみ解放しております。</p>

    <v-container fluid class="mb-12" id="search-rec">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3">調べ学習のすゝめ</span>
      </h2>

      <p>早速Web制作、Webデザインについて学習していきましょう。</p>

      <p>
        まずは時間をとって全体像を把握し、用語や学習していくものについて調べ学習をしていきましょう。<br />
        実はこの「調べる力」はプログラミング学習において最も重要なものと言えます。<br />
        自力でなんとか情報を集め、自分で答えを出していく力が求められます。
      </p>

      <p>CLOTOの用意している記事を参考に、どんどん調べ学習をしていきましょう。</p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="search">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3">調べる</span>
      </h2>

      <p>Class2では、Web制作のために必要な前提知識を集めるために「調べ学習」をしています。</p>

      <p>
        この「調べる」という行為は実はプログラミング学習をするにおいて一番重要な作業であり、<br />

        数えきれない情報が氾濫した社会において一番重要な能力です。<br />
        誰でも世界中の情報にアクセスできるようになった現代だからこそ、<br />
        「どれだけ正確で、どれだけ手にしたいものに近い情報を、いかに早く手に入れることができるか否か」<br />
        が、学習の成長の差に直結します。<br />
        他にもいい買い物や契約ができるか否かや、ビジネスチャンスを掴むことができるか。<br />
        自己実現できるか。などといったこれから生きていく上での損得にリアルに結びついてきます。
      </p>

      <p>この「調べる」ことは以下の二つの方法で実行することができます。</p>

      <ul>
        <li>Webブラウザなどで検索する。</li>
        <li>誰かに質問する。</li>
      </ul>

      <p>
        活字で見ると当たり前のことですが、これを問題が解決するまで続けなくてはなりません。<br />
        効率と、忍耐強さが求められるもので、調べる力の不足で困難が解決できず、<br />
        学習から離脱してしまう人が多いようです。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="search-how">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3">検索の仕方</span>
      </h2>

      <p>
        検索はWebブラウザを通して、<br />
        自分の欲しがっている情報にアクセスすることです。
      </p>
      <p>
        これがプログラミング学習者が一番最初に取り組むべきことであり、<br />
        なおかつ長い長いプログラミング独学で一番重要なことです。
      </p>
      <p>
        プログラミング独学を続けていると、ほぼ毎日問題に直面します。<br />
        「エラーが出る」「正しくできているはずなのに何故か動かない」「環境構築ができない」などです。<br />
        プログラミング独学はこれらとの戦いの日々です。<br />
        少しでも早く問題解決をしてモチベーションを維持するためにも「調べる力」は非常に重要です。<br />
      </p>

      <p>Webブラウザで検索する時には以下のことに気をつけましょう。</p>

      <ul>
        <li>何が起こっているのか現状を把握する。</li>
        <li>明確にした問題を検索に引っかかりやすくなるように状況の詳細を言語化する。</li>
      </ul>

      <p>
        検索するときには、まず自分が何がわからないのか明確にすることが重要です。<br />
        自分の分からないことが分かっていないのに、検索できるはずがありませんよね。<br />
        まずはわからない部分を以下のポイントを抑えて洗い出しましょう。
      </p>

      <ul>
        <li>何をしたいのか</li>
        <li>問題は何か</li>
        <li>何をしている時に問題が起きたのか</li>
        <li>どのような環境で問題起きたのか</li>
      </ul>

      <p>
        知りたい情報に辿り着くことは、実は容易ではありません。<br />
        おそらくプログラミング学習の初期段階では、<br />
        これまでの日常生活でWebブラウジングをしていて、<br />
        何不自由なく求めている情報にたどり着けていた方でも、<br />
        かなり苦労すると思います。
      </p>

      <p>
        プログラミング学習の過程で生じるさまざまな問題は、<br />
        人によって解決方法が違ったり、同じように見える問題も全く別の理由で起こっていたり、<br />
        完全に一致する事例が他になかったり、前提知識の解説が一切なく、<br />
        素人には到底対応できなかったりすることがあります。
      </p>

      <p>
        例えば一番簡単な例では、MacOSを使っている人と、WindowsOSを使っている人とでは、<br />
        情報量が違いますし、問題への解決策も異なります。
      </p>

      <p>
        このように、プログラミング学習過程で起きる問題は、本当にケースバイケースで、<br />
        経験に基づいたある程度の勘が必要になります。
      </p>

      <p>
        そのためには、毎回調べて、複数の解決策を試してみるような地道な作業が必要になります。<br />
        従って、自分が現在どのような状況にあるのかを客観的に明確に把握する必要があります。<br />
        最初はなかなか難しいかもしれませんが、何事も「継続は力なり」です。頑張っていきましょう！
      </p>

      <p>
        自分の状況が把握できたら、次はWebブラウザで検索しやすい状態に問題の詳細を言語化しましょう。<br />
        闇雲に検索してもなかなか情報にたどり着けないのが辛いところです。
      </p>

      <p>
        例えばPHPで掲示板サイトを作っている際にエラーが起きた時、<br />
        「PHP 掲示板」などのキーワードで検索すると、<br />
        おそらくハンズオンの記事がヒットするでしょう。<br />
        運よくその記事が自分の思った通りの記事であればいいですが、<br />
        現実には、そのようなことは少ないです。<br />
        また、そのハンズオンどおりにやっても動かないこともあります。
      </p>

      <p>
        では、その場合に「PHP 掲示板 動かない」などのキーワードで検索して、<br />
        欲しい情報が得られるでしょうか？
      </p>

      <p>
        おそらくこれでも欲しい情報にはたどり着けないでしょう。<br />
        先ほど説明したように「動かなくなる原因」は人によって異なります。<br />
        より細かい情報で検索していくことが重要になります。
      </p>

      <p>
        今回の場合オススメなのはエラー文のコピーアンドペーストです。<br />
        もっと上達してきたら，コードをピンポイントで検索するとより良いです。<br />
        例えば「PHP insert できない」など。
      </p>

      <p>
        このように、より細かい情報で検索することで、<br />
        その問題に対する解決策がヒットしやすくなります。<br />
        徹底した「原因の明確化」を意識しましょう。
      </p>

      <p>
        プログラミングで「伝える」コース]を進める過程で、<br />
        Webブラウザの検索エンジンの仕組みなども調べてみると、<br />
        よりヒットしやすい言葉を選ぶことができるようになるかもしれませんよ。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="question-how">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3">質問の仕方</span>
      </h2>

      <p>
        続いて、検索してもどうしてもヒットしなかったものや、学習法や進路、教材の良し悪しなど、<br />
        なかなか検索だけでは解決しない問題もあるかと思います。<br />
        そんな時は他の学習者や先人に力を借りましょう。
      </p>

      <p>
        質問でも同様に、まずは状況を把握することが重要です。<br />
        なにがわからないのか明確にする必要があります。
      </p>

      <p>
        検索と一番違うところは、質問する場合は相手は機械ではなく人間であるということです。<br />
        相手の時間をいただくということは理解しておかなければなりません。<br />
        調べればわかるようなことを質問することはマナー違反ですよね。
      </p>

      <p>
        「何をしたいのか（目的）」<br />
        「何が問題，わからないのか（原因）」<br />
        「どのように調べたのか（行動）」<br />
        「その結果得られた情報からどのように改善しようとしたのか（考察）」<br />
        を伝えること、テキストであれば明記することが大事です。
      </p>

      <p>
        ただ「これが動きません」と言われても、質問された側は、<br />
        答えてあげたくても答えることができません。
      </p>

      <p>
        プログラミングは前後関係が重要です。言語ですから，自然言語と同じく文脈理解が大切です。<br />
        「何がしたくて、どこで詰まった。これが原因だと考え、<br />
        このように調べた結果このような情報が得られた。<br />
        そこでこのように改善しようとしたがうまくいかない、どこが間違っているのか教えてもらえませんか？」<br />
        というふうにしっかりと自分のアクションを明記しましょう。
      </p>

      <p>
        何も調べない。試さない人間には誰も教えてくれません。<br />
        しかし、しっかりと悩んだ上で詰まっている"苦労人"は誰かがきっと助けてくれます。
      </p>

      <p>
        何はともあれ、プログラミング学習者の先輩は皆さん基本的に親切です。<br />
        しっかりと誠意を持って質問すれば、親身になって対応してもらえるでしょう。<br />
        最初は断られたり、何かと注意されてしまうことも多いかもしれませんが、<br />
        必ず自分の力になるのでこちらも継続して頑張ってみましょう。
      </p>

      <p>
        CLOTOでは他の学習者がどのコースのどのクラスの人かがわかるようになっています。<br />
        コミュニティやタイムラインで、自分に近い人を見つけたら積極的に質問や交流をしてみてください！
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="en-lang">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3">学びを言語化しよう</span>
      </h2>

      <p>
        その日に学んだことは忘れてしまう前に簡単にまとめて言語化することでアプトプットしましょう。
      </p>

      <p class="font-weight-bolder">
        この際にはカルテを積極的に利用していきましょう。<br />
        今この瞬間にも、すでにプログラミング学習は始まっています。
      </p>

      <p>
        また言語化したものをカルテに投稿し、公開することで、<br />
        仮に誤ったインプットがあった際に他の学習者から指摘してもらえたり、<br />
        わからない箇所を疑問形にして投稿することで、アドバイスがもらえるかもしれません。
        積極的に活用していきましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="pubhos">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> パブリックポスティングの重要性 </span>
      </h2>

      <p>
        疑問の解決や直接的な交流といった効果以外にも、カルテの公開には重要な意義があります。<br />
        それは「パブリックポスティング」によって得ることのできる、モチベーションの持続効果です。
      </p>

      <p>
        「パブリックポスティング」とは、その名の通り、公開することです。<br />
        日々の学習記録を公開することで、「誰かが見ているかもしれない」という、<br />
        無意識の自覚が生まれます。<br />
        そうすると、日々の学習を中断してしまうことに対するある種のハードルが生まれます。<br />
        これを意図的に活用していくのです。
      </p>

      <p>
        「今日はサボりたいなぁ」そんな日を1日作ってしまうと、<br />
        次の日もサボるハードルがぐっと下がってしまいます。<br />
        こんな日が二日も続けば、<br />
        再開のためのハードルが上がってしまいます。
      </p>

      <p class="font-weight-bolder">何事も継続が一番です。学習したら記録をつけて公開する。</p>

      <p>この一連の流れを、欠かさずに行いましょう。</p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="seisaku">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> Web制作 </span>
      </h2>

      <p>
        [プログラミングで「伝える」コース]では、HTMLやCSS。JavaScriptやRubyなどのフロント系言語、<br />
        それぞれのフレームワークなどを用いて、Web制作を行っていきます。
      </p>

      <p>まずはこれから取り組んでいくことについて調べ学習をしていきます。</p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="about-web">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> Webとは </span>
      </h2>

      <p>
        「Webサイト」や「Webアプリ」。「Webデザイン」に「Web制作」、「web開発」。<br />
        いろいろな場面でこの「Web」という言葉に出逢います。
      </p>

      <p class="font-weight-bolder">そもそも「Web」とは一体何なのでしょうか。</p>

      <p>
        Webは正式には「World Wide Web (WWW)」といい、<br />
        インターネット上で提供されているハイパーテキストシステムです。<br />
        一般に「Web」と呼ばれています。
      </p>

      <p>
        より簡単に言えば、世界中のインターネット上の情報を閲覧するための仕組みです。<br />
        1990年代以降、爆発的に世界中に普及し、現在も全世界的に利用されている仕組みです。
      </p>

      <p>
        私たちは、このWebという仕組みを使って、インターネット上にある世界中の情報にアクセスしたり、<br />
        逆に世界中に情報を発信することができるようになったのです。
      </p>

      <p>
        インターネット上に情報を上げるためには、まずサーバーと呼ばれるコンピュータを用意し、<br />
        それに情報を保存します。一般にWebサーバーなどといいます。<br />
        この情報には、インターネット上の所在を示すURLが付与されます。<br />
        私たちは自分の端末(クライアント)から、このサーバーにある情報にインターネットを介して接触し、<br />
        Webブラウザと呼ばれるソフトウェアで閲覧することで情報を得ることができます。
      </p>

      <p>これら一連の仕組みをWebというのです。</p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="page-site">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> Webページ・Webサイト </span>
      </h2>

      <p>
        サーバーというコンピュータとクライアントというコンピュータがあることを述べました。<br />
        これらはどちらも、インターネットに接続できるようになっています。<br />
        インターネットを介して情報のやり取りができるということです。
      </p>

      <p>
        これらの情報のやり取りのために、ハイパーテキストシステムを利用するのです。<br />
        ハイパーテキストシステムとは、ハイパーリンクというもので複数の文書を相互に関連づける仕組みです。<br />
        ハイパーテキストシステムで使われる文章のことをハイパーテキスト、<br />
        ハイパーリンクによって関連づけられた一連のハイパーテキストの集合をハイパーメディア、
        などとも呼びます。
      </p>

      <p>
        このハイパーテキストを記述するためにマークアップ言語を用います。<br />
        最も有名なものとしてはHTMLというものがあります。<br />
        この正式名称は、「HyperText Markup Language」。<br />そのままですね。<br />
        ハイパーテキストはマークアップ言語とその体裁を整えるCSSのようなスタイルシート。<br />
        そしてより機能性を持たせるための各種プログラミング言語を用いて作られます。
      </p>

      <p>
        このような特徴を持つページ単位の文書のことをWebページと言います。<br />
        ややこしいですが、Webページとハイパーテキストは、<br />
        「Webページにはハイパーテキストであるという特徴がある。」という関係性です。
      </p>

      <p>
        サーバーにハイパーテキスト形式で記述されたWebページを保存します。<br />
        サーバーは、先述の通り、特定の事由が無い限りインターネットに接続されています。<br />
        そのために記述し、保存されているのですから当然です。<br />
        クライアントもインターネットに接続されているため、サーバーとやりとりをすることで、<br />
        このWebページを見ることができるということです。
      </p>

      <p>
        では、具体的にどのようにクライアントとサーバーがやりとりをしているのか、見ていきましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="system">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> Webページの構成と表示の仕組み </span>
      </h2>
      <p>
        先ほども触れた通り、WebページはHTMLなどのハイパーテキスト形式で書かれた記事です。<br />
        Webページ制作者はHTMLやCSS、JavaScriptなどを用いてWebページを制作し、<br />
        そのファイルをサーバーへアップします。<br />
        近年では、比較的安価で手軽に契約できるレンタルサーバーも増えており、<br />
        必ずしも自身でサーバー構築をする必要はなくなりました。
      </p>

      <p>
        このサーバはインターネットに接続されています。<br />
        1990年代以降、インターネットの普及に伴って、<br />
        同じような記事が世界中に無数に生まれています。
      </p>

      <p>
        それでは記事を見つけ出すことが難しいので、<br />
        サーバーへアップロードするごとに、<br />
        URLと呼ばれるインターネット上の住所のようなものが発行されます。
      </p>

      <p>
        この記事を見るためのコンピュータであるクライアント側では、<br />
        一般にWebブラウザという、Webページを表示するソフトウェアを用いて、<br />
        世界中のWebページにアクセスすることができます。<br />
        クライアントは、インターネットを介して、URLにアクセスし、<br />
        サーバーに対し、「リクエスト」を送信します。<br />
        サーバーはこれに対し、「レスポンス」を返します。<br />
        これにより、クライアント側のWebブラウザ上にWebページを表示することができます。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="difference">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> WebサイトとWebアプリの違い </span>
      </h2>

      <p>
        Webアプリケーション(Webアプリ)は簡単にいってしまうと、<br />
        高度な機能を持ったWebサイトです。<br />
        みなさんが今利用されているCLOTOももちろんWebアプリです。<br />
        それ以外のWebアプリの具体的な例は、<br />
        YouTubeやTwitter、Amazon、Facebook、Google Meetなどです。<br />
        Webアプリをつくることを一般に「Web開発」と言います。
      </p>

      <p>
        WebサイトはWebページの集合であり、必ずしも高機能であったり、動的な挙動をしません。<br />
        企業や製品、ブログなどの情報を表示するためのページや、<br />
        或いはネイティブアプリやスマホアプリと呼ばれる、<br />
        アプリ売り場で購入できるようなものへと遷移させるためのランディングページなどがこれに当たります。<br />
        Webサイトをつくることを一般に「Web制作」と言います。
      </p>

      <p>
        明確な線引きはありませんが、WebサイトとWebアプリにはこのような違いがあると言えます。<br />
        今回このコースでみなさんが目標にするのは、Web制作ができるようになること、<br />
        そしてWebサイトを用いて、情報を適切に伝えることです。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <v-container fluid class="mb-12" id="web-rec">
      <h2 class="text-h4 font-weight-bold mb-10">
        <span class="pl-3 grey lighten-3"> Web制作のすゝめ </span>
      </h2>

      <p>
        [プログラミングで「伝える」コース]　ではWeb制作ができるようになること、<br />
        そしてWebページを用いて、それを見た人に効果的に意図や情報を伝えることを学習します。
      </p>

      <p>
        Web制作は「情報を伝える」という目的のための一つの具体的手段である、<br />
        ということを強く意識しましょう。
      </p>
      <p>
        つまり、ページの閲覧者に伝えたい情報が伝わらないWebページは作ることができても無意味なもの、<br />
        あるいは十分な価値を発揮できていない状態であるという認識が重要です。
      </p>

      <p>
        例えば、適切なフォントを選んでいるか。配色はイメージ通りで秩序があるか。<br />
        ページのレイアウトや挿入する画像が適切か。知りたい情報への道筋が複雑化していないかなど、<br />
        検討する項目は多いです。<br />
        HTMLとCSS、スクリプト言語の知識、スキルがあれば目標達成できるというコースではありません。<br />
        しっかりと伝えたい情報がどのようなもので、どう伝えるのかを考えてWeb制作に取り組むことで、<br />
        初めて価値あるものを創り出すことができるのです。
      </p>

      <p>さて、[プログラミングで「伝える」コース]の学習フェーズを確認しましょう。</p>

      <ol>
        <li>プログラミング独学のマインドセット。(Class0で完了。)</li>
        <li>志を立て目標を定める。(Class1で完了。現時点で変更があれば修正しましょう）</li>
        <li>Web制作について知る。(Class2で完了。)</li>
        <li>
          HTML、CSSとCGIで必要なスクリプト言語ひとつをチュートリアル教材を用いて学習する。チュートリアル学習に取り組んだのち「ロード」を決める。(Class3で取り組む)
        </li>
        <li>
          スクリプト言語毎に「ロード」を進める。一つ教材を定め、一通りの基本的学習を行う。(Class4で取り組む)
        </li>
        <li>実際に動いているWebサイトの模写学習を行う。(Class5で取り組む)</li>
        <li>
          ロード毎に設定されたお題「自己紹介Webページ創り」に取り組む。ライブラリやフレームワークの使い方を学習する。（[JavaScriptを軸に学ぶロード]ではGitHub
          Pagesの使い方を学習する。）(Class6で取り組む)
        </li>
        <li>
          自作Webサイトの設計、制作計画、製品デザインを行う。GitHubの使い方を学習する。(Class7で取り組む)
        </li>
        <li>実際にWeb制作を行う。(Class8で取り組む)</li>
        <li>デプロイを行う。(Class9で取り組む)</li>
        <li>
          CLOTO内で公開し、所定の数のフィードバックを受け、ブラッシュアップする。(Class10で取り組む)
        </li>
        <li>イベントで制作発表し「玄人」認定を受ける。(Class11で取り組む)</li>
      </ol>

      <p>
        [ プログラミングで「伝える」コース]では、<br />
        Class4以降HTMLとCSS以外に利用するスクリプト言語毎に「ロード」を用意しています。<br />
        β版では[JavaScriptを軸に学ぶロード]のみを提供しております。
      </p>

      <p>
        先は長いように感じますが、取り組み始めると一瞬です。<br />
        どんどん手を動かして進めていきましょう。
      </p>

      <p>
        CLOTOにはバーチャル自習室があります。<br />
        プログラミング学習に取り組む時は自習室に着席し、区切り毎にカルテをつけましょう。<br />
        また、タイムラインもあります。<br />
        同じコースに取り組む学習仲間の成果を見ながら、<br />
        時に競い合い、時に励まし合うことができます。
      </p>

      <p>
        自分よりClassが進んでいる学習者には積極的に質問をしましょう。<br />
        質問する人は、他の学習者の時間を頂いているということを意識し、<br />
        「質問の仕方」を思い出しながら丁寧に質問しましょう。<br />
        自分よりClassが進んでない学習者に質問を受けたら、<br />
        自身のアウトプットにもなる絶好の成長機会ですので丁寧に教えてあげましょう。
      </p>

      <p class="font-weight-bolder">
        CLOTO内で学習者同士が助け合いながら、<br />
        「プログラミング独学」を進めていけることを願ってやみません。<br />
        みなさんで最高の環境を「創って」いきましょう！
      </p>
    </v-container>

    <v-row justify="center" class="mb-4">
      <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: ' Class 2', // コンテンツタイトル
      contents: [
        { id: '#class2-desc', title: '0-0. Class2', activeStart: 0, activeEnd: 596 },
        { id: '#search-rec', title: '1-0. 調べ学習のすゝめ', activeStart: 0, activeEnd: 596 },
        { id: '#search', title: '1-1. 調べる', activeStart: 0, activeEnd: 596 },
        { id: '#search-how', title: '1-2. 検索の仕方', activeStart: 0, activeEnd: 596 },
        { id: '#question-how', title: '1-3. 質問の仕方', activeStart: 0, activeEnd: 596 },
        { id: '#en-lang', title: '1-4. 学びを言語化しよう', activeStart: 0, activeEnd: 596 },
        {
          id: '#pubhos',
          title: '1-5. パブリックホスティングの重要性',
          activeStart: 0,
          activeEnd: 596,
        },
        { id: '#seisaku', title: '2-0. Web制作', activeStart: 0, activeEnd: 596 },
        { id: '#about-web', title: '2-1. Webとは', activeStart: 0, activeEnd: 596 },
        { id: '#page-site', title: '2-2. Webページ・Webサイト', activeStart: 0, activeEnd: 596 },
        {
          id: '#system',
          title: '2-3. Webページの構成と表示の仕組み',
          activeStart: 0,
          activeEnd: 596,
        },
        {
          id: '#difference',
          title: '2-4. WebサイトとWebアプリの違い',
          activeStart: 0,
          activeEnd: 596,
        },
        { id: '#web-rec', title: '2-5. Web制作のすゝめ', activeStart: 0, activeEnd: 596 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
