<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        [プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード] 4-0-0　Class4
        Class4からは「苦労人前期」に入ります。いよいよここからがプログラミング独学の始まりです。インプットとアウトプットを繰り返して頑張っていきましょう！
        Class4では媒体を問わず、専門的な「教材」を用いて本格的な学習を開始していきます。チュートリアル学習からさらに踏み込んで、具体的な文法や、組み合わせなどを学習していきます。この基本パターンをたくさん知っていることで、自分で創る際の発想の源になります。全てを理解することを目標にする必要はありませんが、できるだけ丁寧に学習していきましょう！
        4-0-0　Class4 4-1-0　参考書学習のすゝめ 4-1-1　HTMLの学習 4-1-2　CSSの学習
        4-1-3　Bootstrapの学習 4-1-4　JavaScriptの学習 4-1-5　jQueryの学習 4-2-0　環境を作ろう
        4-2-1　Web制作の開発環境 4-2-2　調べるべきこと 4-3-0　おすすめ教材 4-3-1　参考書
        4-3-2　公式ドキュメント 4-3-3　ドットインストール 4-1-0　参考書学習のすゝめ
        参考書学習の目標は一つの言語に対して、チュートリアル学習から、さらに踏み込んで細かい学習を進めていくことにあります。多くの参考書では、基礎的な具体的な数値などを用いて、基本文法を学習したり、開発の一部
        を疑似体験するように作られています。
        こちらも、一つの言語あたり１〜２つほど学習するのが良いでしょう。こちらもあまり時間をかけずに、短期間で取り組んでしまうことが重要です。学習間隔を開けてしまうと、その度に前回学んだ内容を忘れてしまったり、毎度の学習開始にかけるエネルギーが多く必要になってしまったりします。あまり学習効率が良くないので、短期間に集中して取り組んでしまいましょう。
        ここでは、HTML&CSS、そしてJavaScriptを用いて、Web制作を学んでいくこのロードでは、特にJavaScriptを用いた、Web制作の教材が最適でしょう。
        4-1-1　HTMLの学習 HTMLの正式名はHyperText Markup
        Language。ハイパーテキストを記述するためのマークアップ言語です。Webページの骨格を作るために利用します。現在のバージョンはHTML5です。拡張子は[.html]
        。全世界的にかなり主流の企画なので、マークアップ言語はHTMLが扱えれば問題ないでしょう。
        見出し、段落、表、リストなど文書内の各部分を「要素」と呼びます。この要素を記述して構造をコンピュータに伝えるのがマークアップ言語の役割です。その要素を記述するための目印を「タグ」と言います。
        HTMLではこの「要素」と「タグ」が理解できればあとは簡単です。具体的な記述方法を学びながら表現の幅を広げていきましょう。
        4-1-2　CSSの学習 CSSの正式名はCascading Style
        Sheets。HTMLの要素をどのように表示、修飾するかを指示するスタイルシートという仕様の一つです。現在のバージョンはCSS
        Level3。拡張子は[.css] 。
        HTML要素にスタイルを加えていくような記述方法特徴。スタイルとは、文字サイズ、色、フォント、背景色、具体的な要素の配置位置、余白などです。
        CSSでは「セレクタ」「宣言ブロック」「プロパティ」「値」などの言葉が重要になります。教材ではこの仕組みに着目しながら進めていきましょう。
        4-1-3　Bootstrapの学習
        BootstrapとはWebサイトやWebアプリケーションを作成する、Webアプリケーションフレームワークです。
        Class0でも簡単に触れましたが、「フレームワーク」とは、ソフトウェアフレームワークのことで、アプリケーションなどの実装に必要となる一般的な機能や定型コードを、ライブラリとしてあらかじめ用意したものです。「ライブラリ」とは、汎用性の高い複数のプログラムを再利用可能な形でひとまとまりにしたものです。ライブラリと呼ぶときには、それ単体ではプログラミングとして動作させることができない、実行ファイルでない場合があります。ライブラリは他のプログラムになんらかの影響を与えるコードの集まりです。一方でフレームワークとライブラリとの明確な区別はありません。一般に、フレームワークは、ライブラリを複数集めたものや、より体系立って整理されたものというような認識です。フレームワークはシステム構築に必須な標準的であまり高くないレベルの設計に際して、設計者やプログラマーの検討に要する時間を削減する働きがあります。出来合いのおかずで夜ご飯を簡単に済ませてしまうような発想です。非常に便利ですのでClass4では難しいことは考えずに、とりあえずフレームワークの利用方法を学習するといいでしょう。
        しかし一方では、比較的高度な開発や、より独自性を出す際には、やはりフレームワークではなく自身での設計が必要になりますし、あるいは、フレームワークの学習自体に時間がかかってしまったり、必ずしも全ての開発に最適なわけでもないので全体的にコードを肥大化させ、挙動が重くなるなどの批判もあるので、将来的にはその特徴をしっかりと理解した上で使うことが重要といえます。
        BootstrapはHTML、CSSベースのデザインテンプレートです。タイポグラフィや各種フォーム、ボタン、カード、ナビゲーション、ジャバスクリプト用の拡張などが用意されています。種類も多く、世界的に使われているものです。
        BootstrapのWebページには、多くのテンプレートが掲載されており、それを記述するためのソースコードが添付されています。あらかじめ、Bootstrapを利用できるように、HTMLの&gt;head&lt;部分に所定の記述をしておくことで、コピーアンドペーストすることで、テンプレートを利用できるようになるという優れものです。数値や色を変えてアレンジすることで、応用的な活用もできます。
        Webページの表現の幅が広がるので、ぜひ積極的に利用してみてください。 ま
        4-1-4　JavaScriptの学習
        JavaScriptはプログラミング言語です。分類的には一般にオブジェクト指向スクリプト言語と言われます。よく似た名前の言語として「Java」がありますが、JavaScript誕生の経緯から見てもこれとは全く別物の言語と考えて良いでしょう。拡張子は[.js]
        。
        JavaScriptの最大の特徴に「ブラウザ上で動作するプログラミング言語である」ということがあります。これはどういうことかというと、「ユーザーがブラウザで行う操作をきっかけに、さまざまな処理を発動することができる」ということです。
        マウスの移動や、クリック、ダブルクリック、ホバー時にそれぞれ処理を変えたり、Webページのページ遷移時に処理を行なったり、といった、ユーザーの実際のWebページ上の操作に対してアクションをつけることができるのが最大の特徴です。
        この特徴により、Web制作の場面でJavaScripthは、HTML、CSSで作られたページにアニメーションやそのほか様々な動きをつけることを可能にし、重宝されるのです。
        また、「非同期通信」が可能という特徴もあります。これはサイトを更新、つまりリロードすることなく表示内容を変更できるというものです。普段当たり前に行えていることなので、いまいちピンとこないかも知れませんが、HTML、CSSだけでは、ページに変更を加える際、都度更新しなくては表示内容が変更されません。JavaScriptで「非同期通信」を行えばすぐに変更結果が表示されるため、チャットやページ遷移をよりスムーズに行うことができるようになるのです。
        JavaScriptはその特徴から、主にクライアントサイドで使われるプログラミング言語ですが、近年ではNode.jsといった、サーバサイドでのジャバスクリプト実行環境も生まれたことにより、その活躍の幅をサーバサイドまで広げています。
        また、それだけにとどまらず、PCのネイティブアプリケーションやスマホアプリケーションの開発もできるようになっています。Android
        OSにもiOSの両方での開発が可能です。
        このように非常に汎用性が高く、全世界的に利用される主流な言語になっているため、学習に必要な情報も豊富で一番最初に学習するにはもってこいのプログラミング言語と言えるでしょう。
        JavaScriptでは、「関数」「引数」「変数」「クラス」といった言葉が非常に重要になってきます。これらに着目しながら学習をしましょう。
        4-1-5　jQueryの学習
        jQueryはWebブラウザ用のJavaScriptコードの記述をより簡易化するために設計されたJavaScriptライブラリ。分類としてはWebアプリケーションフレームワークともいいます。
        jQueryは、JavaScriptのフレームワークです。jQueryはそのコンセプトにもなっているように「より少ない記述で、より多くのことをする」ことを目的に開発されました。JavaScriptでの表現の幅を広げてくれる武器になります。
        jQueryはHTMLを操作するための「DOM操作」、その名の通りの「CSS操作」、「アニメーションとエフェクト」の追加。外部ファイルの読み込みを可能にする「Ajax」などの機能、特徴を持っています。いずれも当然JavaScriptを元に、作られているものです。ブラウザごとの対応をしなくていいのも特徴です。また、プラグインが多いことも特徴であり、非常に便利ですのでぜひJavaScriptとセットで学習しましょう。
        4-2-0　開発環境を作ろう
        すでにClass3で選んだチュートリアル教材によってはすでに教材に従って、開発環境が整っている方もいるかと思います。
        一方でチュートリアル学習の段階で、開発環境の用意が必要なかった方（Progateなどで学習された方）は、ぜひこの場で、Web制作に必要な開発環境を作っていきましょう。
        Web制作、特にHTML、CSS、JavaScript、jQueryの開発環境の構築は比較的難易度も低いのであまり難しく考えず取り組んでみましょう。ほとんどの教材で最初の開発環境の準備について記述されているので、その通りやってみましょう。ここでは簡単に概要だけ記載しておきますが、ここも「調べる力」が重要です。基本の「型」を元に、さらに調べてより便利にカスタマイズしたり、自分より早く学習に取り組んでいる人に質問してみることが重要です。プログラミング学習の方法は常に複数個答えがあるものなので、自分のパターン、自分の最適解を見つけていく姿勢が重要です。
        4-2-1　Web制作の開発環境
        Class2でも触れたWeb制作の仕組みを理解できていれば、決して難しいものでもありません。
        Web制作で必要な環境は以下です。 PC インターネット環境 Webブラウザ
        ファイル・フォルダ作成・管理ツール（一般にはOSに標準搭載されているので考慮しなくていい）
        テキストエディタ（一般にはOSに標準搭載されているので考慮しなくていい）
        さらにあったほうがいいものとして
        ソースコードエディタ（プログラミングのソースコード編集用に最適化されたソフトウェア）
        デザインツール（画像素材や動画素材を作成・編集するためのもの） などがあります。
        PCの選び方は、最初は好きなもの、手持ちのもので構いません。もし気合を入れて学習を始めたいようでしたら、タイムラインやコミュニティなどで、他の学習者の方にアドバイスを求めるといいでしょう。PC選びも奥が深く、人によってPCに求める価値が異なるので、さまざまな方のご意見やYouTuberさんなどのレビューを参考にするといいでしょう。
        インターネット環境は通信速度が早ければ早いほど良いです。予算との兼ね合いで見極めましょう。
        Webブラウザは近年の情勢や汎用性の高さからも、Google
        Chromeを推奨しています。Apple社のSafariや、Mozilla社のFirefox、Yahoo!JAPANなどでももちろん可能です。
        ファイル・フォルダ作成・管理ツールはご利用のPCのOSに基本的には標準搭載されているので心配ないと思います。
        テキストエディタもPCのOSに基本的には標準搭載されています。本来的にはこのテキストエディタでプログラミングをすることは可能ですが、一方でソースコードエディタというソフトウェアの方が実際の開発シーンに最適化して開発されているのでこちらを利用すれば構わないと思います。
        ソースコードエディタはプログラミングソースコードを編集するのに最適化されたテキストエディタソフトウェアです。最初はなるべくメジャーなものを利用されることを推奨します。マイクロソフト社の
        Visual Studio Code
        などは最も有名なソースコードエディタソフトと言えます。とりあえずという方はこちらをインストールすることをお勧めします。
        これはソースコードエディタに限ったことではありませんが、あるツールがメジャーであることには、何か利便性が高いなどの理由があることが多いです。また、インターネット上にある情報量も多く、何か困った時に、検索しやすく、また質問もしやすいです。
        何事も最初は標準の「型」を学習することが良いと思います。 4-2-2　調べるべきこと
        Class4では、教材に乗っ取ってとりあえず開発してみることがいいと思います。あまり拘ってやらずに、プログラミング、HTML、CSS、JavaScriptの「型」を一通り学習しましょう。
        Class4で特に調べるべきことは、 Webの仕組み（Class2で復習） Web制作をする上でのファイル構造
        ソースコードエディタの使い方 Webブラウザの開発者ツール、デバッグツールの使い方
        命名規則などのルール、慣習 です。
        チュートリアル教材で、説明を受けるものの実際に触るとよくわからないものの一つにファイル構造があります。HTMLの.htmlファイルやCSSの.cssファイル、JavaScriptの.jsファイルがそれぞれどのように関係し合っているのか。あるいはどのようにファイルが作用してWebブラウザに影響を与えているかなどです。ここがわからないと全体像をなかなかイメージできないと思います。チュートリアル教材を読み直す、あるいはClass4で学習しようと思う教材で手を動かしながら確認しましょう。それでもわからないことがあると思います。そんな時は迷わずすぐに検索しましょう！
        ソースコードエディタは非常に多くの機能を持っています。カスタマイズ方法も豊富です。また、日本語のデータをインストールする必要がある場合もあります。学習を進める過程でご自身に最適なテキストエディタに仕上げてください。
        Webブラウザも奥が深いです。開発者ツール、デバッグツールと呼ばれるものがあって、表示されているWebページの要素、HTMLやCSS、そのほかのファイルのソースコードを見ることができたり、その場限りではありますが、実際にそのソースコードを書き換えて一時的にWebページに変更点を反映させることができます。非常に便利ですのでぜひ調べてみてください。
        命名規則とは、例えばJavaScriptでclass名を決めるときのルールです。実はあれ、ルールがあるんです。
        プログラミング言語は機械に命令を与えるための言語であると同時に、自分以外の開発者にもその内容を伝えるための言語であるとも言えます。[プログラミングで「伝える」コース]では、基本的に個人でのWeb制作を通じた価値の創造を主眼にコースが作成されています。一方で実際にエンジニアとして就職したり、フリーランスのエンジニアとしてプロジェクトを抱えたりする場合には、ほとんどの場合で複数人での開発が必要になります。この際に重要になるのが、命名規則に代表される、言語ごとのルールです。言語ですから当然ルールがあります。
        実際には、これを破っても記述、実行できることがありますが、複数人での開発ではかなり忌避されます。同時に、あまりに我流の記述は、他者は読みにくです。また、都度コメントアウトでメモを残さないと、見直した時に何がなんのプログラムかわからなくなってしまうなど。個人の開発でも当然質問してもレビューしにくかったりという弊害もあります。
        かなり現実的に困ることもありますので、もし余裕があれば、日頃から気に留めて、誰もが読みやすくルールに則ったコードを書けるように練習をしていきましょう！
        このような話に興味のある方は、命名規則などのルールに関しては、「言語ごとの公式ドキュメント」を、読みやすいコードに関しては「リーダブルコード」や「コード
        綺麗に書く」などのワードで検索すると関連項目が出てくるかと思いますの調べてみることをお勧めします。何か学びがあったら、惜しみなく他の学習者にも共有していきましょう！
        4-3-0　おすすめ教材
        Class4の目的をおさらいすると「各言語に対して、基本文法や記述の仕方、特徴を学ぶ」ことにあります。従って、チュートリアル学習に比べて、ある程度の専門的な教材に取り組んでいくことになります。
        CLOTOでは言語ごとにコミュニティを用意しています。ここに各言語のおすすめ教材やサイトを共有できる掲示板、資料棚のような機能を用意する予定です。また、タイムラインや、プロフィールでも情報共有ができるように随時アップデートして参りますので楽しみにしていてください。
        4-3-1　参考書
        参考書学習では、書籍やPDFといった印刷物で学習していく方法です。特にHTML&CSSや、Webデザイン、ホームページ制作といった教材はかなり充実しており、もはや選ぶのに困るくらいかも知れません。どれも素晴らしいものですので、実際に書店へいき、自分にとって見やすく、楽しんで取り組めるものを購入しましょう。そしてここでも、日にちを空けることなく、なるべく早く、一気にやり切ってしまいましょう。
        あえていうのであれば、具体的な書籍名は控えますが、Class4の目的も鑑みると、英語学習で言うところの、「文法演習」「語彙力を増やす」といったような学習をしなくてはならないので、「辞書のように使えるもの」をお勧めします。「逆引きできる」ようなものもいいですね。網羅的に多くのサンプルコードと利用局面が書いてあるようなものも良いかも知れません。
        文法や場面ごとに一つづつコードサンプルが載っていて一個ずつ練習ができるようなものがいいかも知れません。ボキャブラリーを増やすことが重要です。「HTMLであんなことできたな。」「ここでJavaScript使ってあのアニメーションをつけよう」などと思うことができればしめたものです。
        この辞書のような使い方ができるというのは参考書学習の利点かも知れません。
        参考書学習で気をつけなくてはならないのは、「いつ書かれたものか。」「どのバージョンについて書いたものか。」を誤らないことです。例えば2021年5月現在、HTMLはHTML5ですし、CSSはCSS3というバージョンが最新版で主流です。古いものを買ってしまうと無駄になてしまいますので気をつけましょう。
        4-3-2　公式ドキュメント
        公式ドキュメントとは言語の開発者、団体などがまとめているドキュメントのことで、実はチュートリアルから、各要素、文法、構文などが事細かに記述されています。命名規則などのルールも載っていることが多いです。
        開発者や団体などが提供していない場合、第三者が作成した要素リファレンス集などもあります。
        なかなか公式ドキュメンをしっかり読んで学習する人は少ないですが、現役エンジニアの多くが「困ったら公式ドキュメント」と言われます。要は、原点に帰れということです。学習者にとってもこの原点を知っているかいないかの差は大きいのでないでしょうか。ぜひ学習に役立ててみてください。
        一方で、公式ドキュメントは英語で記述されていることが多いです。専門的な用語も多いのでなかなか翻訳しながら読み進めていくとなると、ハードルも上がるかと思います。ので、無理して一周目の教材学習で用いる必要はないのかなと思います。しかし、「こういうものがある」ということは絶対に知っておくべきでしょう。
        ちなみにプログラミングを学習する方は余力があったら英語も学習したほうが絶対にいいです。クラス名や関数名などの理解が早まったり、公式ドキュメントなどを正確に理解することができます。
        4-3-3　ドットインストール
        Class3でも紹介したこの「ドットインストール」ですが、こちらの教材は言語ごとにチュートリアルレベルから、Class4レベルの学習ができるので、ここで再度紹介します。言語で言えば「HTML」「CSS」「JavaScript」「jQuery」。そのほかでいえば「Webサイト制作」などのレッスンに取り組むことをお勧めします。

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center" class="mb-4">
          <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ4', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
