<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        [プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード] 5-0-0　Class5
        Class5ではClass4で学んだ言語ごとの基礎的な文法や仕組みを、実際のWebページを利用して体感していきましょう。
        特にClass5では「模写学習」をしていきます。実際に動いているWebページを構成しているソースコードを模写しながら、役割や関連性を丁寧に理解していきましょう。
        Class5の模写学習で理解を深めて、次のClass6ではいよいよ簡単なWeb制作をします。このClass5で構造や仕組み、基本的な文法で理解できていない箇所はなるべく克服していきましょう。これまでに比べて比較的丁寧で突き詰めた学習を心がけましょう。
        積極的に調べ学習、質問をしながら、どんどん手を動かしていきましょう。 5-0-0　Class5
        5-1-0　模写学習のすゝめ 5-1-1　模写学習のルールを決める 5-1-2　効果的な模写学習の方法
        5-2-0　Webブラウザの活用 5-2-1　開発者ツール 5-2-2　ファイル構造の理解・確認
        5-3-0　おすすめの模写学習教材 5-3-1　Codestep 5-3-2　YouTube 5-3-3　その他
        5-1-0　模写学習のすゝめ
        Class4の教材学習で言語ごと基礎的な学習が済んだら、実際に動いているプログラムのソースコードを模写してみましょう。模写学習では参考書学習で学んだ内容が本番環境でどう活きているのかを実際に確認しながら学ぶことができます。
        模写学習ではヘッダーフッターの作りや、レイアウト。興味のある部分の挙動の箇所など、目的を持って的を絞って模写することが望ましいです。
        教材は、実際に動いているWebサービスや、模写コーディング用の練習サイトなどを模写するのがいいでしょう。最近ではYouTubeなどでも良質なWebサイトの見本がたくさんあるので、利用してみるのも良いでしょう。
        5-1-1　模写学習のルールを決める
        模写学習からは様々なことを学習することができます。フォントや文字サイズ、色、デザイン、レイアウト、レスポンシブ、背景画像の配置や見せ方、paddingやmargin、アニメーションの付け方、そしてファイル構造など、数えきれません。
        そんな中で全てを忠実に再現することは、「模写学習」において重要なことではありません。「模写学習」の目標はClass3やClass4で学んできた中でいまいち理解できていない箇所や、実際に体感することができなかったWebページとしての全体的な構成や、逆に細やかな表現方法を学ぶために行います。
        模写するために選んだ教材から何をどの程度学ぶかを決めることが重要です。
        「ヘッダー、フッターの作りを学習する」や「気に入った画像の表示方法を再現してみる」と言ったように目的を明らかにして、さらにその中にも深追いや非効率的な学習にならないように、ルールを設けることが必要です。「多少の違いは気にしない」や「トータルのレイアウトは崩れても構わないので、個々の要素ごとに学びたい箇所だけ正確に模写する」や、「テキストのフォントや色、素材は気にせず、レイアウトは完璧に再現する」などです。
        あるいは、「完全に再現する」というのもまた難しいものなので、取り組んでみる価値があるでしょう。
        そういう意味からも教材とするWebページは、いくつかあるといいでしょう。
        5-1-2　効果的な模写学習の方法
        模写学習は丁寧に取り組むことが肝心です。まず手本とするWebページのHTMLのソースコードを読み解く必要があります。次にCSSを見て、さらにファイルの構造を確認し、JavaScriptがどのように機能しているか確認してから写し始めましょう。
        その際に、ただただ写して動作することを確認するだけではあまり意味がりません。手本通りに写した後、少し値を変えてみて、どこがどう変化するかを確認してみましょう。この一行にどんな意味があるのか。コメントアウトして隠してみたり、表示したりしてじっくり確認してみましょう。
        5-2-0　Webブラウザの活用
        Webサイトの模写教材、お手本としては、必ずしもあまり高度で複雑なものを選ぶ必要はありません。シンプルなページからしっかりと学び取るほうがいいでしょう。
        WebサイトはWebブラウザに表示されるわけですが、このWebブラウザにはWebページを表示する以外にも多くの機能があります。実際にコーディングしている際にもHTMLファイルをWebブラウザで開くことでブラウザ上で、現在開発できている箇所までをそのまま表示することができます。
        次に紹介する「開発者ツール」などもその代表的なものの一つでClass5以降では必須のツールになります。
        Webブラウザを使いこなすことで、Web制作に必要な多くのことを学ぶことができます。
        5-2-1　開発者ツール
        先ほど紹介したWebブラウザの機能の一つとして「開発者ツール」と呼ばれるものがあります。ブラウザごとに、表示方法は多少異なりますが、基本的には表示することが可能です。開発者ツールとは何かというと、表示されているWebページのソースコードを閲覧、一時的に編集できるツールです。開発者ツールを開いたまま、各要素に触れていくと、Webページ上の対応する箇所が反応し、「このコードがここを表現している」というのが一目でわかるものになっています。また、そのコードを一時的に書き換えて変更を反映させることもできます。
        開発者ツールで与えた変更は、実際にページに反映されることはないので、安心してどんどん触ってみましょう。Webブラウザも奥が深いですよ。
        5-2-2　ファイル構造の理解・確認
        開発者ツールを開くとソースコードが見れることに加え、それらが記述されたファイルが、どのように関連しているのか。どのような構造で組み立てられているのかを見ることができます。チュートリアル学習などでは意識することがなかった箇所かと思います。非常に勉強になるので模写学習のついでにぜひ確認してみてください。
        5-3-0　おすすめの模写学習教材
        模写学習で使うべき教材は、あまり高度で複雑なものではなく、シンプルなものがいいです。あるいは真似したい、理解したい機能やレイアウトが含まれているものがいいです。「模写学習」を調べれば、模写に最適な教材等が紹介されていますが、ここでは特におすすめの模写学習教材について記述します。
        5-3-1　Codestep
        CodestepはWebサイト制作の実践力をつけるたものコーディング学習サイトです。難易度や学習内容ごとに用意されたデモサイト、そのレイアウトの解説、ソースコードの添付の3セットで模写学習を通じてWebサイト制作について学ぶ、無料のデジタル教材です。
        非常にわかりやすく、模写学習で学ぶべきことがしっかりまとまっている教材ですのでお勧めしております。
        Codestep : https://code-step.com 5-3-2　YouTube
        YouTubeでWebサイトを作るような動画では、ほとんどの場合、投稿者がテキストエディタを画面収録しながら、Web制作を進めていくものが多く、模写学習に近い体験を得ることができます。投稿者ごとによって教材・解説の質がバラバラですので見極める必要はあります。また、投稿者自身がうっかり間違えていて、動画の概要欄で訂正していたり、解説が正確でない場合がよくありますので、最初は高評価やコメント欄を見て取り組んでみましょう。
        また、YouTubeでは少しでもわかりやすいように投稿者が工夫して、素材をあらかじめ用意したり、細かく解説をしてくれるので、わかった気分になってしまうことが多いです。
        流れに沿って一周するだけでなく、再現できるか、本当に理解しているか、ソースコードを一つ一つ復習することで、さらにもう１段階成長できますので、じっくりと丁寧に取り組みましょう。
        5-3-3　その他
        もちろん一般に自分で見つけたWebサイトを模写しても結構です。専用の解説がなく一から読解していく必要があるので、非常に勉強になります。
        ここでは、Webデザインのサンプルサイトをいくつか紹介します。気に入ったものや、真似してみたいものを選んで、模写していきましょう。Class6以降学習を進めて、実務に至り、Webサイトを自作していく過程で、一つでも多くのデザインパターンを知っていることは武器になります。多くのWebサイトを見て、気になったものは模写してみましょう。
        I/O 3000
        国内外を問わず、Web制作の参考となるサイトをセレクトしてるWebデザインギャラリーサイトです。カテゴリやタグ、色などで絞り込みができます。また作成年度ごとに絞り込みができる点が非常に興味深いです。10年前のWebデザインはトップページに文字が多く、カラム割りが多いように見えたりと、時代の変遷によるWebサイトの流行りを学ぶこともできます。https://io3000.com
        bookma!
        Webデザインに特化したブックマークサイトです。主に日本のWebサイトがブックマークされています。色、フォント、雰囲気、さまざまなジャンルのWebサイトが表示されており、アイデアの幅を広げるにはもってこいのサイトです。https://bookma.torch.blue
        81-web.com
        日本の優れたWebデザインを集めたギャラリーとリンク集です。PC用とスマホ用の二つのデザインに対応しています。トップページがたくさん表示されており、Web制作においてトップページの第一印象、素材の重要性がよくわかります。https://81-web.com
        Responsive Web Design JP
        日本国内の秀逸なレスポンシブWebデザインのサイトを集めたリンク集です。端末やWebブラウザのウィンドウサイズごとに表示を変える「レスポンシブデザイン」で秀逸なものが集められています。モバイル端末が普及し、「Webブラウジングはスマホで」という人も増えている現在において、レスポンシブデザインはWeb制作の工程の中でも重要度を増しています。https://responsive-jp.com
        awwwards.
        英語ベースのWebデザイン集です。日本語のものとかなりイメージが変わるので、注意が必要ですが、エキセントリックなデザインも多く構成を学ぶ上では刺激的で面白いかもしれません。各国のデザインなーが評価軸ごとに採点しているのも面白いポイントです。高評価されているサイトから学ぶことは多いと思うので是非見てみてください。https://www.awwwards.com

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center" class="mb-4">
          <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ5', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
