<template>
  <v-container fluid id="content">
    <div class="mb-12 pa-4" id="classdesc">
      <h1 class="text-h3 text-center">{{ title }}</h1>
    </div>

    <p>
      Class8では実際のコーディングをしていきます。いよいよWebサイトとして形にしていきます。<br />
      すでに素材と設計図は整いました。早速始めていきましょう！
    </p>

    <ul class="agenda">
      <li>0-0　Class8</li>
      <li>1-0　コーディングの準備</li>
      <li>1-1　Git</li>
      <li>1-2　GitHub</li>
      <li>1-3　GitHub Desktop</li>
      <li>1-4　GitHub Pages</li>
      <li>2-0　コーディングのすゝめ</li>
      <li>2-1　ワイヤフレーム通りに仕上げていく</li>
      <li>2-2　フレームワークを積極的に利用しよう</li>
      <li>2-3　コメントアウトの重要性</li>
      <li>3-0　困った時のすゝめ</li>
      <li>3-1　検索</li>
      <li>3-2　CLOTO</li>
      <li>3-3　Qiita</li>
      <li>3-4　teratail</li>
      <li>3-5　SAMURAI ENGINIER</li>
      <li>3-6　TechAcademy</li>
      <li>3-7　質問</li>
      <li>3-8　本当に困ったら公式ドキュメント</li>
      <li>4-0　気を付けること</li>
      <li>4-1　閲覧者に配慮したWeb制作を</li>
      <li>4-2　悪意なく侵害しがちな権利を知っておこう</li>
    </ul>

    <h2 class="text-h4 font-weight-bold">
      <span> コーディングの準備 </span>
    </h2>
    <v-container fluid>
      <p>
        [プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]では個人でのWeb制作を想定していますが、<br />
        ここでGitと一連の関連サービスを紹介します。<br />
        これからプログラマー・エンジニアとして活躍する中で、必ず出会うサービスですし、<br />
        個人での開発にも活用できるので、ぜひ知っておきましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> Git </span>
    </h2>
    <v-container fluid>
      <p>
        Gitは、プログラムのソースコードなどの変更履歴を記録・追跡するための分散型バージョン管理システムです。<br />
        分散型ソースコード管理システムであるGitでは、<br />
        リモートサーバなどにある中心リポジトリの完全なコピーを手元のローカル環境に作成して、<br />
        そのリポジトリを使って作業を行うことができます。<br />
        このおかげでネットワークにアクセスできないなどの理由で中心リポジトリにアクセスできない環境でも、履歴の調査や変更の記録といたほとんどの作業を行うことができます。
      </p>

      <p>
        プログラミングを行う過程では、何かソースコードを書いたら終わりということはまずなく、<br />
        バグの修正や改善が必ずといっていいほど必要になります。<br />
        ソースコードを修正して、アップデートしバージョン更新を行う際、「何をなぜ、どのように修正したか」を明確に残していく必要があります。<br />
        これがないと、変更を加えるたびに、どんどん過去の変更点がわからなくなってしまいます。ましてそれが複数人での開発であれば、もうカオスです。
      </p>

      <p>
        Gitでは、コード、ファイルに「追加」「編集」「削除」などの変更をすることと、行った変更を記録することの主に二つの目的で利用されます。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> GitHub </span>
    </h2>
    <v-container fluid>
      <p>
        GitHubはソフトウェア開発のプラットフォームです。コードのバージョン管理システムにはGitを使用しています。<br />
        GitHubではソースコードをホスティングすることで複数人のソフトウェア開発者と協働してコードをレビューしたり、<br />
        プロジェクトを管理しつつ開発を行うことができます。
      </p>

      <p>
        GitHubは直接コミットが禁止されており、ブランチが保護されています。GitHubで一つのプロジェクトを行う際、<br />
        複数人の開発者で分担して開発を進めるために、以下の仕組みを利用しています。
      </p>

      <p>
        まず、本流のソースコードがあります。こちらが本番環境とも言えるものです。ここ(Master
        Branch)に複数人が同時にアクセスして変更を加える(push)と、<br />
        意図せずプログラムが壊れてしまうことがあります。 これを防ぐために、開発者ごとにMaster
        Branchの複製とも言えるブランチ(Remote Branch)を割り当てます。<br />
        まず各々の開発者は自身に割り当てられたブランチごとにローカルリポジトリに開発、変更を加えていきます(コミット)。<br />
        開発を終えると、プロジェクトマネージャーに変更を加えたブランチをホストに組み込む要請(PullRequest:プルリク)をします。<br />
        マネージャーがこれを見て、問題がなく採用となれば、ブランチ内の変更点を含む部分をホストと置き換え統合していきます(Marge)。<br />
        これにより、各々の開発者による直接のコミットによるホストの崩壊を防ぎつつ、効率の良い開発を行うことが可能になります。
      </p>

      <p>
        これが複数人での開発を行う上でのGitHubの使い方の概要です。<br />
        GitHubにはこのほかにも、プロジェクトを細かく切って(issue)、担当者を割り当てる機能や、ログ記録機能などもあります。<br />
        また、GitHubはWeb上に公開されるので、自身の開発記録を公開することも可能です。<br />
        現代の開発者、デザイナーになくてはならないツールです。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> GitHub Desktop </span>
    </h2>
    <v-container fluid>
      <p>
        GitHub DesktopはGitHubを簡単に使うことができるネイティブアプリケーションソフトです。<br />
        基本的にはWebサービスであるGitHubと使い方は同じです。<br />
        一方でコマンドを打つ作業が必要ないため、<br />
        デザイナーなど、コマンドを打てない人や、面倒な人が簡単にGitHubを利用することを可能にしています。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> GitHub Pages </span>
    </h2>
    <v-container fluid>
      <p>
        Class6でも簡単に紹介しました。GitHub
        PagesはGitHubが提供している静的WebページのためのWebホスティングサービス、<br />
        いわゆるレンタルサーバのようなものです。<br />
        ユーザーのブログやドキュメント、静的なWebページを公開することができます。
      </p>
      <p>
        重要なのは静的というところで、すべてのユーザーに対してすべてのコンテキストで同じ情報を表示するものに限るということです。<br />
        ユーザーの操作ごとに用事結果を変更するような動的なWebアプリなどの公開はできません。<br />
        JavaScriptは動的Webページでも利用されますが、静的Webページの制作でも利用できます。<br />
        従って、PythonやPHPなどの言語に対応していないGitHub
        PagesでもJavaScriptは利用可能ですので、<br />
        このコースに取り組んでいる人は安心してご利用ください。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> コーディングのすゝめ </span>
    </h2>
    <v-container fluid>
      <p>
        実際にソースコードエディタを用意してコーディングしていきましょう。<br />
        Class7で丁寧に下準備を重ねてきました。安直に変更を加えていくことはできるだけ、避けましょう。<br />
        一方で、特に初めてのワイヤーフレーム作成の場合よく起こりがちですが、複雑に仕上げてしまい、<br />
        自分で1からコーディングすると工数が増えたり、思い通りに作れないこともあり得ます。
      </p>

      <p>
        フレームワークにも同じようなものｱがないことも多々あるので、<br />
        どうしても変更が必要になったら、その場で変更してしまうのではなく、<br />
        一度Class7に戻り、プロジェクトに軸から逸脱していないか確認しながら、ワイヤーフレームを作り直しましょう。
      </p>

      <p>
        個人開発では多少は妥協ができますが、依頼を受けた際には勝手に変更を加えることは好ましくありません。<br />
        その場で安易に変更を加えることをよしとする癖はつけないほうが良いでしょう。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> ワイヤフレーム通りに仕上げていく </span>
    </h2>
    <v-container fluid>
      <p>
        ついついコーディングを進めていると、ジャストアイデアがたくさん生まれてきますが、<br />
        安直に変更を加えていくことはできるだけ避けましょう。もちろん必要がある場合はやむを得ませんが、<br />
        Class7でプロジェクトの軸と照らし合わせながら、首尾一貫したデザインをワイヤーフレームに落とし込んできたことと思います。
      </p>

      <p>
        ジャストアイデアで変更を加え続けているといつの間にか、全体的に整合性の取れない状態になってしまうことが多いです。<br />
        極力ワイヤフレーム通りに作成していくことをお勧めします。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> フレームワークを積極的に利用しよう </span>
    </h2>
    <v-container fluid>
      <p>
        本来、Class7のワイヤーフレーム作成の段階で頭に入れながら作成することが好ましいですが、一旦Class8に入れました。<br />
        日頃からフレームワークにどんな種類があるか見ておくことで、ボキャブラリーを増やしておくことが重要です。<br />
        これによりコーディングの効率を上げることもできます。積極的に活用していきましょう。
      </p>

      <p>
        一方で、Web制作も何度か取り組んでいると、フレームワークでは不自由、窮屈に感じてしまうことがあります。<br />
        これはある意味成長の証ですので、このような場合は、フレームワークのコードを理解して類似した無駄のない最適化されたコードを書くことが求められます。<br />
        フレームワークを少しいじるだけでも表現の幅は広がります。<br />
        まずはそのまま取り入れて、徐々に応用的にフレームワークを活用していくような向き合い方が好ましいです。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> コメントアウトの重要性 </span>
    </h2>
    <v-container fluid>
      <p>
        プログラムの一部分を、コメントタグをつけて、無効化することを「コメントアウトする」などと言います。<br />
        コメントアウトには「保守性の向上」と「可読性の向上」という二つの利点があります。<br />
        ソースコードはコーディングを進めるに従ってどんどん増え、複雑化していきます。<br />
        記述した本人でさえ、全てのコードをどのように意図してなんのために記述したのかを覚えておくことは至難の業です。<br />
        まして複数人での開発になると、人の書いたコードを読むことは非常に負担の大きい作業になります。
      </p>

      <p>
        この場合コメントアウトを残しておくことで、「このコードをどんな意図でどう書いたのか」を残しておくことが可能になります。
        また、コメントアウトを残していくことで、コードごとの区切りが明確になり、<br />
        この部分がどんな機能を構成しているコードなのか、或いはその一連のコードはどこまで続くのかが、瞬時に判断がつきます。<br />
        可読性が向上し、コーディングのミスが減ることもメリットです。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 困った時のすゝめ </span>
    </h2>
    <v-container fluid>
      <p>困った時はすぐ行動。一に検索、二に検索、三に検索、四に質問。検索の鬼になりましょう。</p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 検索 </span>
    </h2>
    <v-container fluid>
      <p>
        Web制作を志している人間が検索から逃げていてはいけません。<br />
        最初は勘も効かず、本当に大変です。しかし何度も何度も調べているうちに検索にも勘がついてきます。
      </p>

      <p>
        大事なのは傾向と対策です。このような場合は大体こういう調べ方をすれば答えが見つかる。
        検索ワードひとつとってもそうですし、お気に入りの知識共有サイトを見つけることで、<br />
        まずはそのサイト内で検索していこうという目星がつけられるので、<br />
        欲しい情報に到達するまでの時間がどんどん短くなるはずです。
      </p>

      <p>
        気をつけなくてはいけないのが、検索エンジンのアルゴリズムです。<br />
        SEOなどと言われるものですが、Webブラウザの検索エンジンには、検索結果の表示順番にアルゴリズムが適用されて最適化されています。<br />
        逆に言えば、このアルゴリズムを理解しWebサイトを適用させることで、検索結果上位にWebサイトを押し上げることが可能なのです。<br />
        これはどういうことかというと、必ずしも最良の情報が検索結果上位に表示されるわけではないということです。<br />
        検索に引っかかりやすいサイトが上位に表示されていると考えるべきでしょう。<br />
        この点だけ理解して、検索力を磨いていきましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> CLOTO </span>
    </h2>
    <v-container fluid>
      <p>
        CLOTOには言語ごとに自習室が割り当てられています。<br />
        また、他のユーザーがどのコースのどのクラスに取り組んでいるかがわかるので、<br />
        自分と同じコースで自分より進んだクラスに取り組んでいる人や、同じクラスの人と積極的に情報共有をしていきましょう。<br />
        その日学んだことはカルテにできるだけ詳しく整理して記入し、定着させていきましょう。<br />
        気軽にアウトプットし、知識とやる気の共有ができるバーチャル自習室です。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> Qiita </span>
    </h2>
    <v-container fluid>
      <p>
        Qiitaは国内最大のプログラミング情報のナレッジコミュニティです。<br />
        プログラミング関連の情報の集積地として比較的有名なサービスです。<br />
      </p>

      <p>
        良い記事には「LGTM(Looks Good To
        Me)」で評価し、気になる記事を「ストック(備蓄)」することができます。
        また、学習者が学んだことを記事にし、投稿することができます。<br />
        当然投稿された記事を閲覧することも可能で、多くの知識が共有されているため、<br />
        検索をかけることで知りたい情報に辿り着けることも多く便利です。<br />
        また、記事に対してコメントすることもできるので、誤った情報に対して指摘・修正を加えることもできます。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> teratail </span>
    </h2>
    <v-container fluid>
      <p>
        teratailはプログラミングに特化したQ&Aサイトです。<br />
        実現したい作業や作業中に発生したエラーについて質問すると、<br />
        他のエンジニアから回答を得られます。このやりとりを他の学習者も見ることができるので資料価値もあります。
      </p>

      <p>
        基本的には質問とそれに対する回答で成り立っています。<br />
        したがって丁寧に質問することが求められるので、まずは自分でしっかりと調べてみてから質問機能を利用しましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> SAMURAI ENGINIER </span>
    </h2>
    <v-container fluid>
      <p>
        SAMURAI ENGINIERはプログラミングスクールです。<br />
        マンツーマン指導に特化したものと、オンラインでのサブスクリプション型スクールを運営しています。
      </p>

      <p>
        SAMURAI ENGINIERに限ったことではありませんが、<br />
        オンラインで教材を提供しているサービスでは一部、よくある質問に対する回答などを無料でWeb上に公開していることがあります。<br />
        よく見かけるサイトですので、知っておくと良いでしょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> TechAcademy </span>
    </h2>
    <v-container fluid>
      <p>
        言わずと知れた、国内のプログラミングスクールの雄です。現役エンジニアが講師として学習をサポートしてくれます。
      </p>

      <p>
        TechAcademyもWeb上に無料コンテンツをあげていることがあるので、参考にしましょう。<br />
        また、動画視聴サイト上に動画コンテンツも上がっているので参考にしましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 質問 </span>
    </h2>
    <v-container fluid>
      <p>
        CLOTO内はもちろんですが、もし身近にプログラミングについて質問できる相手がいる際は、<br />
        自分でできることをしっかりした上で、臆せずに質問をしてみましょう。<br />
        直接的な解決法は得られなくても、何かしらのヒントを得られることが多いです。<br />
        誠意を持って質問をすれば、丁寧に回答してくれる方がほとんどですし、<br />
        そこから親しくなって、技術以上の学びや、出会いがあるかもしれません。
      </p>

      <p>
        逆に自分が他の学習者に質問された時も、アウトプットの良い機会だと思って、丁寧に対応してあげましょう。<br />
        自分にとっては些細な疑問でも、その人にとってはそれで学習が前進せず、緊急事態に陥っていることがほとんどです。<br />
        プログラミング独学には「独」という漢字がつきますが、助け合い、支え合いが重要です。<br />
        お互いに良い影響を与え合える学習環境を私たちで創っていきましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 本当に困ったら公式ドキュメント </span>
    </h2>
    <v-container fluid>
      <p>
        本当に困ったら公式ドキュメント。何事も基本が最重要です。Class4で触れた通り、公式ドキュメントは聖地です。<br />
        もちろんブラウザで困った箇所の検索をかければ、<br />
        ケースに応じた具体的な解決策が載った記事に出会えることもあります。<br />
        しかし、こういった巷に出ている日本語記事のほとんどは、<br />
        英語で書かれていることの多い公式ドキュメントから情報を得て、<br />
        英語で書かれた記事をさらに日本語に翻訳してケースに当てはめて解説。のように、<br />
        二次情報、三時情報となっていることがほとんどです。
      </p>

      <p>
        一人前のエンジニアになるためには、公式ドキュメントという一番信憑性の高い一次情報から直接学び取る姿勢が欠かせません。<br />
        もちろん英語で記載されていることがほとんどですので、ある程度英語のまま理解できたほうが良いですが、<br />
        ここでプログラミングとWebデザイン、素材の編集技術、に加えて英語まで全力投球で学ぶというのはなかなか難しいでしょう。
      </p>

      <p>
        そんな時は、翻訳機能を使いましょう。<br />
        公式ドキュメントは平易な英語で書かれていることがほとんどですので、比較的誤訳も少ないかと思います。
        時間と労力がかかる地道な作業ですが、一番鉄板でもあります。困ったら基本に立ち返る。<br />
        公式ドキュメントを最大限活用しましょう。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 気を付けること </span>
    </h2>
    <v-container fluid>
      <p>
        Web制作をする際には、多くの素材を利用したり、情報を利用したりするので、<br />
        悪意なく、他人の気分を害してしまったり、権利を侵害してしまったり、<br />
        迷惑をかけてしまったりする可能性と常に隣り合わせです。<br />
        あらかじめよく起こりがちな問題について把握しておきましょう。
      </p>

      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 閲覧者に配慮したWeb制作を </span>
    </h2>
    <v-container fluid>
      <p>
        Web制作は「伝えたいこと」を伝えるための手段であると何度も触れてきました。<br />
        「伝えたいこと」が強いために、刺激的なキャッチフレーズや、素材を利用してみようと思うことがあるかもしれません。<br />
        しかし、Webサイトはインターネットを通じて全世界に向かって公開され、それを取り消すことは不可能に近く、<br />
        不適切な表現なども残ってしまうことを常に肝に銘じましょう。
      </p>

      <p>
        また不特定多数が閲覧するという性質上、製作者自身にとってはなんてことのない表現が、<br />
        意図せず誰かを傷つけてしまったり、不利益をもたらしてしまうことがあるかもしれません。<br />
        それが反社会的なことであったり、差別的なことであれば、現代社会は簡単には許してくれません。<br />
        高度に情報化が進んでいる社会ですから、すぐにSNSなどを通じて全世界に広まり、大炎上をしてしまうことがあります。
      </p>

      <p>
        言葉、表現は時として他者をも自己をも傷つける凶器になるということを肝に銘じることが重要です。<br />
        センセーショナルで刺激的な表現を求めるあまり、意図しない問題が発生しないように注意しましょう。
        もちろん表現ですので、あまり気にしすぎると表現の幅が狭くなってしまうので、<br />
        ある程度自由に表現し、公開前に冷静に確認するようなことで良いのではないでしょうか。
      </p>
      <v-row justify="center" class="mt-10">
        <v-btn dark color="success" @click="$emit('karte-post')">ここまでを記録</v-btn>
      </v-row>
    </v-container>

    <h2 class="text-h4 font-weight-bold">
      <span> 悪意なく侵害しがちな権利を知っておこう </span>
    </h2>
    <v-container fluid>
      <p>
        これら以外にも、他者の権利を侵害してしまうことで問題が起きることもあります。<br />
        Web制作者が特に気をつけるべき権利について少しだけ触れておきます。
      </p>

      <p>
        まず、画像などの素材を利用することの多いWeb制作では、素材がらみで問題が起きることがあります。<br />
        例えば利用許諾範囲を超えた素材の使用です。まず、学校などの教育現場のような感覚で、<br />
        Web上にある画像をダウンロードして利用することは絶対に避けましょう。<br />
        基本的には素材は自分で用意するか、<br />
        用意できない際にはClass7で紹介したようなロイヤリティーフリーと明記された素材を利用しましょう。
      </p>

      <p>
        次に気をつけるべきは、他のサービスなどの情報を載せる際に、商品名やロゴなどの表示です。<br />
        ここで商標や著作権を侵害してしまわないように気をつけましょう。<br />
        企業やサービスのロゴの利用については特に厳しいので、<br />
        しっかりと公式サイトから、ロゴ利用における注意点をあらかじめ調べ、公式のデータを使いましょう。<br />
        色などの編集を禁じている場合も多いので気をつけましょう。<br />
        Class7で紹介したFontAwesomeを利用するのも良いでしょう。
      </p>

      <p>
        次は自分で用意した素材についてです。ここで気をつけるべきは肖像権と、<br />
        何か秘密事項が映り込んでいないかということです。<br />
        人間はみだりに他者に自身の顔や個人が特定できるような画像、動画を利用されない肖像権を持っています。<br />
        許可なしに他人の顔や、個人が特定できる画像、動画素材を利用することはやめましょう。
        秘密事項は、多岐にわたりますが、例えば、企業秘密や他人の家の中が映ってしまっているといった誰かの秘密ももちろんですし、<br />
        自分自身の秘密も不用意に映り込まないように注意しなくてはなりません。<br />
        例えば、偶然映り込んだカレンダーに行動予定や誰かの連絡先が載っていたり、或いは、部屋の外にある電柱に住所が記載されていたり、<br />
        ガラスやディスプレイに反射して何かが写り込んでしまっていないか確認し、必要があれば加工しましょう。<br />
        特に動画素材を用意する際に起きやすいことですので気をつけましょう。
      </p>
    </v-container>

    <v-row justify="center" class="mb-4">
      <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'Class 8', // コンテンツタイトル
      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
