<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- ベタ打ち　いらない文はコメントアウト 細かいのは変えてます-->
        1-0-0　Class1
        <!-- Class0では、プログラミング学習において独学の重要性や、そもそもプログラミングとは何かについて、学習しました。 -->
        Class1前半では、特にプログラミング学習において重要なこと。そしてCLOTO内でどう実現させていくかを紹介しています。
        後半では、これから始まる「プログラミング独学」の初心固め、目標設定。Class2から分かれていくコースの選択を行います。
        1-0-0　Class1 1-1-0　プログラミング学習のすゝめ 1-1-1　プログラミング学習の概要
        1-1-2　プログラミング学習の5段階 1-2-0　CLOTO利用のすゝめ 1-2-1　コースの紹介
        1-2-2　ロードの紹介 1-2-3　クラスの紹介 1-2-4　コミュニティの紹介 1-2-5　カルテの紹介
        1-2-10　イベントの紹介 1-3-0　立志 1-3-1　あなたはなぜプログラミングを学ぶのか
        1-3-2　原体験を探る 1-1-0　プログラミング学習のすゝめ

        <!-- プログラミング学習、特に -->
        プログラミングの独学を進めていく中で一番重要なことは、常に学習に対して主体的であるということです。
        また、精神的な部分も、一つ一つの形式的な学習段階も常に能動的な学習であるべきです。
        これを実現するために、 明確な目標を持つこと
        その目標のために現在自分が何をするべきかを理解していること
        目標までの学習の筋道を理解していること
        同じ学習領域の学習者の中で相対的に自分が、どの段階にいるか把握していること
        常にインプットとアウトプットを繰り返し続けること の５つが重要になります。
        これらをしっかりと理解し、学習の土台を作っていきましょう。
        そうすれば、自分自身で目標を定め学習計画を立て、継続的に実行していく力が身に付きます。

        <!-- それはすなわち、 -->
        それこそがプログラミング学習の根幹である、「独学力」なのです。 1-1-1
        プログラミング学習の概要
        CLOTOではプログラミング学習の目標を「プログラミングを駆使し、新たな価値を創り続けることができるようになること。」としました。
        その目標を達成すれば、プログラミングを活かせる仕事においても、しっかりと活躍していくことができるでしょう。
        まずはプログラミング学習の全体像をざっと抑えましょう。 ０、プログラミングについて知る。 １、
        明確な学習目標を設定し、学習計画を立てる。 ２、
        目標について、また、学ぶ言語について概要を知る。 ３、
        チュートリアル教材を使って、学んでいくプログラミング言語について、手を動かしながらざっと理解を深める。
        ４、 書籍などの教材を用いてより詳しく基礎を学ぶ。 ５、
        実際に目標物に近いプロダクトの模写をし、実際の使われ方を学ぶ。 ６、
        とりあえず動く簡易的なプロダクトを作る。 ７、 成果物創作の計画立案、設計、デザインを行う。
        ８、 実際に１からコーディングをする。 ９、 本番環境に公開する。 １０、
        他者からフィードバックを受けながら、ブラッシュアップしていく。 １１、
        自分の創作物を説明できるようになる。 １２、 更なる創作活動や、別の技能の習得へ進む。
        予想より工程が多かったかと思います。このように一つの目標に対し、
        とりあえず手を動かす。お題に沿って作ってみる。自分で考え創る。
        の3段階でこの力を身につけていきます。
        どれも、勢いを持ってとりあえずやってみることが重要です。
        最初は自分が何をしているのかわからなくても、工程を進めているうちにやったことの意味がつながってくるものです。
        何度も同じことをやり直せば身につくようなものでもないので、
        <!-- 全て理解できないことが気持ち悪くても、 -->
        とりあえず手を動かし、アウトプットをしながらどんどん学習を進めていきましょう。
        その過程で、他者と積極的に交流したり、さまざまなメソッドを用いて自分のモチベーションを管理したりしていくことも重要です。
        スポーツでいう「心技体」と全く同じです。技術だけでなく、自分自身も磨き上げていきましょう。これが「プログラミング独学」です。
        1-1-2　プログラミング学習の5段階
        CLOTOはプログラミング学習の学習者を以下の5段階に分けました。 入門期 素人期 苦労人前期
        苦労人後期 玄人期 それぞれを詳しく見ていきましょう。 ・入門期
        プログラミングとは何か、自分が何をしたいのか、なぜプログラミングを学ぶのか、についてじっくりと考える期間です。
        <!-- 本来的に独学であり、 -->
        ある程度時間をかけてじっくり進めていくプログラミング学習においては、実は一番重要な期間なのかもしれません。
        ・素人期 具体的な学習の開始時期です。
        まずは学ぶ対象について調べたり、概要について理解したりすることから始めましょう。
        ここでは全てを理解できなくても「とりあえずやってみる」で構わないのでどんどん手を動かしてプログラミングに慣れていきましょう。
        ・苦労人前期 より詳しく学習対象について知るために、
        <!-- 手を動かし、教材を駆使したり、模倣したりしながら -->
        模倣やハンズオンなどの実践形式で学習を進めていきましょう。
        調べる力や、バグを見つける力。開発環境の構築や、言語以外のツール。プログラムの構造など、身につける力、知るべきことが非常に多い期間です。
        特に初めての学習の方にとっては非常に辛い期間でもありますが、他者と励まし合ったり、環境やメソッドを利用したりしながら学習を進めていきましょう。
        ・苦労人後期 苦労人前期までに身につけた、基礎、応用力を用いて、
        自分独自の価値をプログラミングによって創出する流れを、実際に成果物を創りながら学習する期間です。
        目標の設定から実際の開発までを自力で行っていくため、本人の能力や日々の努力、こだわり、自発性が如実に現れる期間です。
        他者と成果物を通じて積極的に交流し、知見を広げましょう。
        また一つの成果物を深く掘り下げることで、多くの学びを得ましょう。 ・玄人期
        成果物を作成し、技術力や独学力、そして自身を身につけた学習者はもうその道の玄人です。
        学習を継続し、より専門性を磨いてもいいですし、他の分野の学習に進むのも良いでしょう。
        また、後進の育成などは、知識の洗練やモチベーション維持にも寄与する重要なアウトプットなので、
        それらを行うことも非常に有効といえます。
        「プログラミングを駆使し、新たな価値を創り続けることができる」エンジニアになった玄人期間の学習者は、
        実際に働くことで、経済的価値を生み出したり、新しい製品・サービスを創ったり、これまでになかった斬新な仕組みや、価値そのもの、産業を創っていくことで、後進の目標となっていただきたいです。
        この入門期から玄人期までの学習者が使うことができるバーチャル学習施設とそのシステムこそがCLOTOです。
        1-2-0　CLOTO利用のすゝめ
        CLOTOは教材ではありません。CLOTOはみなさんのプログラミング学習を支える、環境であり、道標です。
        プログラミング学習は本来的に独学ですので、受動的な学習姿勢ではCLOTOの利用価値は全く無くなってしまいます。
        学習者自身がそれぞれの目標に合わせて、能動的にCLOTOを使いこなしていくことが重要です。当然他の学習ツールとうまく併用していくことも重要でしょう。
        これまでCLOTOの提唱する、プログラミング学習について見てきましたが、実際にどのような仕組みを用いているのか簡単に紹介していきます。
        1-2-1　コースの紹介
        CLOTOでは独自の成果物の完成をもってそのゴールとしています。これを実現するのが「コース」です。
        「どんなものを創るか」で学習内容は決まります。
        また、一つの言語を学ぶだけでは、成果物を創ることはできません。
        必要なものを適切な順番で体系立たせ、適切な順にこれを経験していくことが重要です。
        目標成果物ごとにこれらを配置したものが「コース」です。現段階で以下の6つに分類しています。
        プログラミングで「伝える」コース プログラミングで「創る」コース
        プログラミングで「遊ぶ」コース プログラミングを「使う」コース
        プログラミングで「分析する」コース プログラミングを「学ぶ」コース
        これらコースをそれぞれ５の学習段階に分けて学習していくのがCLOTOの骨子です。それぞれをもう少しだけ見ていきましょう。
        ・プログラミングで「伝える」コース
        Web制作、Webデザインなどを通じて、それを見た人に効果的に意図や情報を伝えることを学習します。
        このコースではHTML、CSS、JavaScriptや付随するフレームワーク、ライブラリなどを用いて独創的なデザインができることを目標とします。
        ・プログラミングで「創る」コース
        こちらは、アプリケーションソフトの開発をして、新しい価値やユーザー体験を生み出すことを学習します。
        Webアプリケーションもネイティブアプリケーションも含みます。
        Webアプリとネイティブアプリでは技術的に近くないのではないかと思う方も多いでしょうが、
        一方的なアウトプットでは済まず、ユーザーの求めるものを調査し、PDCAを回しながら開発していく様は全く同じです。
        このようにCLOTOでは必ずしも言語や開発プラットフォームでコースを分けていません。
        同じコースを選択した人と交流することで、幅広い知見が得られることも魅力の一つです。
        ・プログラミングを「体験する」コース
        ゲーム制作やVR・ARといった五感で楽しむプロダクトを創るコースです。プログラミング言語の他にも様々なツールを駆使して学習していきます。
        ・プログラミングを「利用する」コース
        シングルボードコンピュータやマイクロコントローラーなどを用いて、「組み込み・制御」などを学習していくコースです。
        ・プログラミングで「分析する」コース
        Pythonなどを使って機械学習を行ったり、Excelなどの表計算ソフトを駆使してデータ分析をしたりするコースです。
        ・プログラミングを「学ぶ」コース
        プログラミングやコンピュータサイエンス関連の資格の獲得や、検定への挑戦に向けた学習をするコースです。
        β版では、プログラミングで「伝える」コースのみを開設しています（順次開講）。
        1-2-2　ロードの紹介
        コースが目標制作物で分けられた大きい分類であるのに対し、ロードはさらにそれを細分化したものになっています。
        例えばプログラミングで「創る」コースはいわゆるアプリ開発をしていくコースですが、WebアプリとiOSアプリでは開発環境が大きく異なります。
        この具体的な開発環境、開発方法ごとに小さく分類されたものをロードと呼んでいます。随時増やしていくので楽しみにしていてください。
        1-2-3　クラスの紹介 クラスはその名の通り「級」です。
        各コース、入門から、玄人認定までを0~11の12段階に分けてマイルストーンとしています。このマイルストーンを各クラスの到達目標としています。
        したがってクラスも0~11の12段階あります。一つ一つクリアしていくことで、確実に玄人に近づける仕組みになっています。
        1-2-4　コミュニティの紹介
        プログラミング言語ごとにコミュニティを用意しています。これがバーチャル学習施設です。
        いつでもどこからでもPC一つで参加し、メリハリをつけた学習に取り組んだり、学習記録をつけたり、時には他の学習者と交流することができます。
        プログラミング独学者は意外と身近にいることが少なく、どうしても孤学になってしまいがちです。自らの知見を広げるためにも他の学習者との交流は重要です。
        特に同じコースの学習者や同じクラスの学習者と交流することで、自分のとっている方法以外を学ぶこともできる上に、共に頑張る仲間にもなりますので、モチベーションの維持にもつながります。ぜひ積極的にご活用ください。
        或いは自分と同じコースで、自分よりクラスが進んでいる人と交流することや、同じコースの玄人と交流すればより速い成長が見込めるでしょう。
        1-2-5　カルテの紹介
        CLOTOでは日々の学習記録のことを「カルテ」と呼んで積極的に記録することを推奨しています。メリットは以下の三点です。
        細かいアウトプットで学習モチベーションを維持し続けることができる。
        学習記録をつけることで、自分がどこで詰まったのか、その日に何を学んだかを残し、のちに見返すことができるようになる。
        他の学習者と交流するきっかけになったり、質問する際に相手に伝わりやすくなったりする。
        1-2-6　イベントの紹介 CLOTOでは頻繁にイベントを開催しています。
        コースやコミュニティごとに「もくもく会」を実施したり、地域ごとにオフ会を開いたり。今後は現役エンジニアの方をお招きして座談会を開いたり、LT大会を開いたりしていこうと考えています。
        人脈形成や、教材からは得ることのできない成長機会ですので奮ってご参加ください。 1-3-0　立志
        プログラミングやそれを取り巻く現状、プログラミング独学の学習体系において重要なことについて学んできました。
        それでは、実際に学習を始めていきましょう。
        Class1後半では、各コース共通して、これから学習をしていく自分自身について深掘りしていきましょう。
        Class1後半の到達目標は、明確な学習目標を宣言し、これから取り組むコースを選択することです。
        しっかりとした心理的土台を作り目標を据えることで今後ぶれてしまうことなく学習を進めていくことができるでしょう。
        1-3-1　あなたはなぜプログラミングを学ぶのか
        Class0で紹介した通り、プログラミング学習は基本的には現段階において誰からも強いられるものではありません。
        <!-- 自ら選んで取り組まない限り、プログラミング学習をする必要性はないのです。 -->

        では、あなたはなぜプログラミングを学習しようと考えたのでしょうか。あるいは現在、なぜプログラミングを学習しているのでしょうか。きっと何かしらのきっかけがあったことと思います。
        なんとなく将来性を感じるから？エンジニアになりたいから？大好きなゲームを作ってみたいから？転職できそうだから？起業したいから？親に言われたから？

        <!-- いかなる理由であっても素晴らしいと思います。 -->
        しかし上のような表現では、先の長いプログラミング独学に挑み、乗り越えていくには少し、弱いかもしれません。より強固なものにするためにもう少し深掘りしてみましょう。
        それではまず少し時間をとって紙などに書き出してみてください。
        より具体的な言葉で理由を書き出してみましょう。
        <!-- ブレストタイムです！ -->

        1-3-2　原体験を探る
        どうでしょうか。どれくらい書き出せたでしょうか。あるいは強い一つの理由があったでしょうか。それともあまり深く考えたことがなかったでしょうか。
        それでは次のステップに進めましょう。
        今度は、先程あげたプログラミング学習を始めようと思った理由に対して、そのきっかけとなった出来事、タイミングを思い出していきましょう。
        なぜ心動かされたのでしょうか。必ずしも自発的なものでなくても構いません。取り組もうと思えているのであれば、すでにそれは自発的な行動と言えるのではないでしょうか。
        今一度、どのようなタイミングで何に影響を受けたのか。あるいは誰に影響を受けたのか。じっくりと思い出してみましょう。
        1-3-3　どうなりたい、どうなりたかったのか
        では、さらに踏み込んでいきましょう。その原体験を得た時に、どのような感情、どのような夢をもったでしょうか。プログラミングができるようになると何ができると思ったでしょうか。
        あるいは逆に、どんな夢があるからプログラミングという手段を選んだのでしょうか。それともプログラミングそのものが楽しくて仕方ないのでしょうか。
        プログラミング学習を志すきっかけとなった出来事をしっかりと思い浮かべてみましょう。
        1-3-4　目標を宣言する ここまで自分がなぜプログラミング学習を志したのか深掘りをしてきました。
        いかがだったでしょうか。あなたは決してプログラミングができるようになりたかったわけではないはずです。その先により本質的な願望や夢があったのではないでしょうか。
        プログラミング学習を継続していき、玄人になった先にあなたを待っている状態をありありと思い浮かべてみましょう。
        その願望や夢を正直に言語化していきましょう。言語化したら、何かに書き出してみましょう。端的に正確に表せているでしょうか。
        ・私の特技である言語化力を活かしてコピーライターやWebデザイナーになりたい！
        ・子どもの頃から親しんできた大好きなゲームの制作会社に入って、ゲームをつくるエンジニアになりたい！
        ・専門で学んだ医科学の知見を生かした画期的なサービスを運営する起業家になりたい！
        ・IT系メガベンチャー企業で、エンジニアとして働いて、高収入を得たい！
        ・自社のホームページがあまりにも古いので更新したいが、外注する費用もないので、自分で作ってみたい。
        ・プログラミングの仕組みを知って、エンジニアと適切にコミュニケーションを取ったり、正しい戦略を立案できる経営者になりたい。
        など、みなさんそれぞれに全く違う、目標を持っているはずです。
        これらをできるだけ明確に素直に書いてみましょう。
        ここで偽ると、のちのち本音と建前が乖離してきて、何を学んでいいかわからなくなったり、誤った学習に突き進んだりしてしまいます。

        <!-- 「稼ぐ」や「有名になりたい」などの人に言うには少し恥ずかしいような目標で全く構いません。 -->
        自分に正直に目標を書き出しましょう。 この時に2点、絶対に入れて欲しい文言があります。
        まずは「いつ」です。いつそうなるのか。いつ目標を実現するのか。これを明確に文章に入れてください。これは必ず入れましょう。
        次に文末を「〜たい」と言う願望の形で締めるのではなく、「〜する」という断定、言い切りの形にしてください。ここを曖昧にしないことがプログラミング学習に対して覚悟を持つことでもあります。
        この2点を踏まえて、以下にあなたのプログラミング学習の目標を書きましょう！
        ※こちらはマイページに公開されるので、どうしても書きたくないものがあればオブラートに包んで、明確なものは心に常に留めておきましょう。
        1-3-5　コースを選択する（現状は「伝えるコース」のみなので割愛）
        さぁ、目標を実際にコースへ進み、学習をしていきましょう。
        ここまでプログラミング学習の前提の確認や準備をしてきましたが、いよいよ実際にプログラミング学習をしていきましょう。
        これまで確認してきたこと、そしてご自身の目標に照らし合わせて、コースを選択し、どんどん取り組んでいきましょう！
        ※β版ではプログラミングで「伝える」コースのみ解放しております。それ以外のコースに取り組みたい学習者の方々は、今しばらくお待ちください。
        1-3-6　現在地点を知ろう soon

        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center" class="mb-4">
          <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ1', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
