<template>
  <v-container fluid id="content">
    <!-- タイトル -->
    <div class="mb-4 pa-4">
      <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
      <p class="text-body-2 mx-6">このコンテンツの説明</p>
    </div>

    View Static Version
 
Class9
Release・Deploy
[プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]
9-0-0　Class9
Class8で実際にWeb制作をしてきました。しかし、Webサイトはまだローカル環境で完成しているだけであってClass8の状態ではインターネットに公開されていません。Web制作は「伝えたいこと」を伝えることを目的に行なってきた以上、インターネット上に公開しなくてはなりません。Class9ではインターネット上に自作のWebサイトを公開する方法を学んでいきます。

9-0-0　Class9
9-1-0　Webサイト公開のすゝめ
9-1-1　ドメインの用意
9-1-2　レンタルサーバの用意
9-1-3　常時SSLにする
9-1-4　FTPクライアントソフト
9-2-0　おすすめWeb公開ツール
9-2-1　GitHub Pages
9-2-2　Heroku
9-2-3　AWS
9-1-0　Webサイト公開のすゝめ
Class8の最後にも触れましたが、Webサイトを公開するにあたっては気をつけるべきことがあるので、それらの確認を必ずしてから公開に移りましょう。

Webサイト公開ですが、まずはWebの仕組みについて、Class2で触れているので確認しましょう。

Webサイトをインターネット上に公開するためには、ドメイン(URLの一部)と、Webサーバが必要になります。その他にも留意すべき点を記しておきます。

9-1-1　ドメインの用意
Class2でWebの仕組みについて説明したときに、URLについて触れました。URLはUniform Resource Locatorの略で、統一資源位置指定子と言います。インターネット上の情報の所在を表記する方法です。主にWebページの保存場所や電子メールの宛先などを示しています。日本ではURLのことをアドレスと呼ぶことがありますが、MACアドレスやIPアドレスなどと紛らわしいため、技術用語としては好まれません。

IPネットワークでここのコンピュータを識別し、接続先を指定するために使用される名称の一部であり、URLの一部にもなるのがドメインです。

ドメインはインターネットにおいては世界中で絶対に重複しないようにするため、ICANN(アイキャン)という非営利期間によって一言管理されています。また、世界中で重複が許されないというWWWの仕組み上、ドメイン名を使用する権利は、一番初めに申請したものに与えられるようになっています。ドメインは登録から最低１年、更新手続きを行うことで、期間を延長することが可能です。

ドメインにはいくつか種類があり、有料のものと無料のものがあります。

ドメインについてさらにみていきましょう。

例えばCLOTOのURLですが、

https://cloto.jp/

のようになっています。この「cloto.jp」の部分がドメインになっています。メールアドレスで言うと、@以降の箇所がドメインになっています。

この「.jp」の箇所がドメインの種類になるわけですが、他には以下のようなものがあります。

.com　：　一般企業や個人での利用が多い
.net　：　ネットワークサービスを意識させる
.org　：　組織やグループなどの非営利団体を表す
.info　：　情報発信、お問い合わせなどを表す
.biz　：　商用利用、ビジネスを想起させる
.jp　：　所在が日本にあることを表す
これら以外にも様々な種類のドメインがあります。通信会社ごとにメールアドレスのドメインを持っていることもあります。これらどのドメインを選んでも基本的に違いはありません。

「.jp」は日本に住所がないと申請できません。日本に住所があることは世界的に一定の信用を担保できるなどの利点があります。そう言う観点から言うと「.co.jp」のドメインは普通のドメイン取得に必要なものに加えて、企業としての登記情報が必要になるため、信頼性の高さが別格です。

独自ドメインを取得するためには、ドメイン取得サービスで、取得したいドメインが既に利用されていないか調べます。ドメインは企業名や、サービス名、サイト名などと一致している方がよく、短く覚えやすいものがいいでしょう。

どれだけ理想に近いドメイン名が取得できるか、そしてドメイン取得にかかる値段を鑑みて、どの種類のドメインを取得するか決めましょう。

9-1-2　レンタルサーバの用意
Class2で紹介したように、Webサイトをインターネット上に公開するには、サーバが必要です。かつては、自分で高性能のサーバ専用のコンピュータを用意して、環境構築をする必要がありましたが、近年は月額料金でレンタルできるサーバが普及してきています。以前に比べ格段に安く、またオンラインで簡単に申し込むことができるので、非常に便利になってきています。

レンタルサーバーにも様々な種類があるので、レビューなどを見て良いものを選びましょう。セキュリティ対策や常時SSL化ができるかに注意しながら、容量と費用とを考慮して用途にあったものを選びましょう。

有名なものは後ほど簡単に紹介します。

9-1-3　常時SSLにする
Web制作だけに関わらず、プログラミング独学をしていく先のエンジニア、開発者という仕事は、セキュリティと隣り合わせの職業です。インターネットは世界中を繋ぎ、世の中を便利にした一方で、常に情報が世界中に拡散されてしまったり、公開していない情報を狙ってインターネット経由で攻撃を受けることがあります。

これらは完全に伏ぐことができません。一方で情報を扱う以上、あるいはインターネットという公共の場にサービスを提供する以上、少しでもセキュリティ対策を心がけることは開発者の責務です。

Web制作の現場における最も初歩的なセキュリティ対策が常時SSL化です。インターネットなどのコンピュータネットワークにおいてセキュリティを要求される通信を行うためのプロトコル(通信規約)であるTLS(Transport Layer Security)というものがありますが、これの別名がSSL(Secure Sockets Layer)です。

URLの先頭に「http://」というものがついていると思います。これはHTTP(Hypertext Transfer Protocol)というWebページなどのコンテンツの送受信に用いられるプロトコルを示しています。SSLをHTTPと組み合わせることでHTTPSという安全なプロトコルを実現します。CLOTOのURLもよく見ると

https://cloto.jp/

先頭が「https」になっているかと思います。このようにセキュリティ対策をするために、常時全てのページに対して、HTTPとSSlの両方のプロトコルを組み合わせた比較的安全なHTTPSのプロトコルにすることを「常時SSL化」と言います。

Webブラウザによっては、この常時SS化をしておかないと、「このページは保護されていません」などの警告文が出るようになっています。あなたの作ったWebサイトを訪問したときに、警告文が出れば、閲覧者から信頼を得ることができません。

常時SSL化をし「https」にしておくと他にもメリットがあります。

検索エンジンでの検索順位が優先されるため、SEO対策になります。サイト分析の精度も上がります。またページ表示速度も早くなります。

レンタルサーバーを選ぶときには、常時SSL化ができるかを確認し、いざWebサイト公開の際には常時SSL化をしましょう。

9-1-4　FTPクライアントソフト
FTPクライアントソフトとは、作成したWebページをサーバにアップロードするためのソフトウェアです。ホームページ作成ソフトや、クラウド型のCMS(Content Management System：コンテンツ管理システム)にはすでに同等の機能を持ち合わせているものも多いので近年では必ずしも必要としません。

一方で[プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]では、こういったサービスを利用していない前提ですのでいくつか有名なFTPクライアントソフトを紹介します。この他にもたくさんあるので調べて使ってみましょう。

FileZilla
FFFTP
WinSCP
Core FTP
※ホームページ作成ソフトでのWeb制作をサポートするロードも用意していこうと思うので楽しみにしていてください。

9-2-0　おすすめサービス
Web制作をインターネット上に公開する際に使えるサービスをいくつか紹介します。具体的な使い方は割愛するので、検索したり、質問したりして活用していきましょう。

9-2-1　GitHub Pages
GitHub PagesについてはClass8でも紹介しました。静的なWebページを簡単にインターネット上に公開できるWebサービスです。更新も簡単に加えることができます。

9-2-2　Heroku
Herokuとは環境開発用のサーバサービスです。Emailアドレスさえあれば登録可能で、１サービスのみ無料で利用することができます。基本的にはWebアプリ向けのサービスなので、HTMLを中心とする静的なWebサイトの場合には、PHPなどでファイルを作ることで、Webアプリと認識させることで、表示が可能になります。少し応用的な利用法になりますが、今後、Webアプリ開発なども想定しているのであれば、ここで少し調べてみるのもありかもしれません。

9-2-3　AWS Amazon S3
AWS(Amazon Web Service)はAmazon社の提供する世界最大のクラウドサービスです。このサービスの一環に Amazon S3(Amazon Simple Storage Service)というものがあります。Webサイトのコンテンツ配信やバックアップに利用できます。S3は静的なWebページのみに対応しています。

AWSは全世界的に利用されている世界最大のクラウドサービスです。Amazon S3以外にも非常に多くのサービスを提供しており、業界標準にもなりつつあるサービスです。エンジニア、開発者として知っておいて損のないサービスでしょう。

利用するしないに関わらず、どこかで時間をとって調べてみる価値がありそうですよ。

9-2-4　SAKURA internet
SAKURA internetは国内で有力なレンタルサーバ、クラウドコンピューティングを提供するサービスです。「さくらのレンタルサーバ」、「さくらVPS」などいくつかのサービスを提供しています。ドメインの取得、レンタルサーバの利用が可能です。ファイルをサーバへアップするためにFTPソフトを使う方法と、独自のファイルマネージャーを使う方法のふたつが用意されています。

9-2-5　ロリポップ！
ロリポップ！は女性、学生、Web制作初心者をターゲットとした個人向けのレンタルサーバサービスです。月額100円という低価格から料金設定が組まれており、またサポート体制が厚いサービスになっており、初めてのWebサイト公開をする際にはおすすめのサービスです。



    <!-- コンテンツ1 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー1</span>
    </h2>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">
        ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
      </p>
      <p>ダミー</p>
    </v-container>

    <!-- コンテンツ2 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー2</span>
    </h2>
    <v-container fluid>
      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '1.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>

      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '2.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>
    </v-container>

    <!-- コンテンツ3 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー3</span>
    </h2>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">ダミー</p>
      <p>ダミー</p>
    </v-container>

    <v-row justify="center" class="mb-4">
      <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ9', // コンテンツタイトル
      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
