<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- ベタ打ち -->
        プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード 3-0-0
        <!-- Class2では調べ学習をし、Web制作について学習してきました。 -->
        Class3ではプログラミングのチュートリアル学習をしていきましょう。
        実際に手を動かしてプログラミングの雰囲気やWeb制作の雰囲気に慣れていきましょう。
        幸いなことに近年、プログラミングのチュートリアル教材が増えました。
        このClassではいくつかの代表的なサービスと、その効率的な利用法を紹介しています。
        どれもチュートリアル教材として初心者にもわかりやすく、楽しく学習が進められるように作られています。
        もちろんここで紹介しきれないほどたくさんのサービスもあるので、「これはいい！」というサービスがあれば、カルテやタイムラインに投稿して教えてください！
        3-0-0　Class3 3-1-0　チュートリアル学習のすゝめ 3-2-0　おすすめチュートリアルサービス
        3-2-1　Progate 3-2-2　ドットインストール 3-2-3　Paiza 3-2-4　Udemy 3-2-5　YouTube
        3-1-0　チュートリアル学習のすゝめ
        チュートリアル学習の目標は、Web制作するにあたって必要な言語について、短期間でざっくり理解を深めるためにおこないます。
        この期間に全てを理解することなど、できないと言う前提で、概要の把握に努めましょう。
        <!-- ここでは勢いとスピードが大切です。 -->
        しかし、決して雑でいいと言うわけではありません。あくまでスピードを意識して丁寧に取り組んでいきましょう。
        最も基本的な考え方や、基本的な仕組み、文法を学ぶことができるので「こんな感じか〜」で十分です！
        このコースではHTML、CSS、JavaScriptについて学習できれば、次のClassに進ことをお勧めします。
        何よりも早く、HTML、CSS、JavaScriptについて「こんな感じか〜。なんやようわからんな。」という状態にしましょう。
        もちろん気になった箇所はメモして、調べ学習をしましょう。
        どんどん質問しても構いません。深く知ろうとすることは全く悪いことではないので、ある程度、期間やゴールだけ決めて、勢いよく取り組みましょう。
        一番やってはいけないことは、横展開です。チュートリアル教材によっては情報量が多く、PHPやRuby、Python、Goといった別のプログラミング言語についいての教材も公開されています。
        興味を持つことは非常に重要ですが、
        <!-- 例えば、JavaScriptと、Pythonでは、 -->
        同じことをするのにも別の書き方をするといったことがあります。
        まだ基本が定着しない段階で、横に学習範囲を広げることは、集中力を欠き、混乱の原因になるのでここでは我慢し、一点短期集中で通り抜けましょう。
        プログラミング学習者で、学習から離脱してしまう人の傾向の一つに、いつまでもチュートリアル段階にとどまっていることがあります。
        逆に考えると、ある程度取り組んだらすぐに次の学習に進人は長続きする傾向があります。
        意識的にClass3は一点短期集中で切り抜けましょう。 3-2-0　おすすめチュートリアルサービス
        最近では本当にチュートリアル学習教材が増えています。
        年々質も高くなり、学習できる言語の種類も増えてきました。
        ここでは、代表的な5つのサービスを紹介します。 それぞれに特徴があるので簡単にまとめています。
        <!-- また有料のものも無料のものもあります。当然この５つ以外にも素晴らしい学習教材はたくさんあります。 -->

        これらを自分で調べて、どれを利用するか選択することもプログラミング独学の醍醐味です。
        インターネット上にもたくさんのレビューがありますので、しっかりと調べから自分にあった学習教材を選択しましょう。
        3-2-1　Progate プログラミングのチュートリアル教材の筆頭といえばこの「Progate」でしょう。
        日本初のサービスで世界中にユーザーがいます。
        累計登録ユーザー数は210万人を超え、近年急成長しているサービスです。
        おそらくみなさんもプログラミング学習をする上で誰かに勧められたり、Twitterやブラウザ上で見かけたことがあることでしょう。
        Progateはその名の通り、プログラミングの門です。入り口にふさわしい教材でしょう。
        Progateは言語やツールごとに学習するコースが設けられています。各コースで基本的な文法や仕組みを学習することができます。
        スモールステップが特徴で、学習するスライド数枚を読んで、次に用意された環境に、スライドで学習したコードを打ち込んでいくことで、プログラミングの基礎を手を動かしながら体験することができます。
        Progateは最初は無料で会員登録をすることができます。基礎レベルの18レッスンを無料で利用可能です。
        コースを全て学習するには有料プランに切り替えることが必要です。2021年5月現在で、月額税込¥1,078で、応用、実戦レベルの全82レッスンを学び放題です。
        Progateの長所は
        ビジュアライズされ、難しい用語を使わない、基本に忠実で親切なサービス。気軽に楽しく学習できる。
        環境構築の必要がなく、ブラウザ上で学習が完結する。PCのスペックを問わずすぐに学習を始められる。タブレットやスマートフォンでも利用可能。
        取り組んでいるユーザーが多い。 Progateの注意点は
        難しい環境構築はProgateが用意してくれているなど、プログラミングの辛い箇所は実感する場面が少ない。
        答えがいつでも閲覧可能で、誤っている箇所もすぐに確認できるので「調べる力」は身につかない。
        Progateはあくまでチュートリアル教材であることを認識せずに利用すると、コースを終えた段階でどうしていいかわからなくなる。
        しかし、Progateの注意点は「これはチュートリアル学習である」と理解して取り組むことで全て解決します。しっかりと次のステップを思い浮かべながら、有効活用しましょう。
        [プログラミングで「伝える」コース][JavaScriptを軸に学習するロード]のClass3では「HTML&CSS」「JavaScript」コースに取り組めば十分かと思います。
        3-2-2　ドットインストール
        ドットインストールは１レッスン３分の動画を見ながら自身の開発環境で学習するサービスです。
        Progateがスライドと用意された環境での学習だったのに対して、ドットインストールは環境開発するところから教材で扱います。目標ごとに一連のレッスン動画が並べられていて順を追って学習することが可能です。
        無料で学習できる箇所もありますが、体型的に学習する場合は有料プランへ移行することも必要かもしれません。
        有料プランは、全レッスンが利用できることに加えて、文字起こしやソースコード、質問機能などリッチな機能を利用することができます。これらを含め、有料プランは月額¥1,080です。
        ドットインストールの長所は 動画教材でわかりやすい。 環境構築から学習できる。
        有料プランが充実している。 レッスンが豊富、学習できる言語やツールも豊富
        ドットインストールの注意点は
        CLOTOのClass3からClass4に該当する内容なので、一通り学習するのにかかる時間は比較的長い。
        あくまでチュートリアル＋αなのでこのレッスンだけでは、あくまで基本レベルであるということ
        ドットインストールも「これはチュートリアル学習である」と理解して取り組むことが重要です。しっかりと次のステップを思い浮かべながら、有効活用しましょう。
        [プログラミングで「伝える」コース][JavaScriptを軸に学習するロード]のClass3ではHTML、CSSは「ウェブサイトを作れるようになろう」を。
        JavaScriptは「JavaScriptで始るお手軽プログラミング」内の「JavaScriptに触れてみよう」「もっと詳しくJavaScriptを学んでみよう」に取り組めば十分かと思います。
        3-2-3　Paizaラーニング
        PaizaはITエンジニア向けの転職・就活・学習サービスです。ITエンジニア・プログラマ専門の総合求人・学習サービスが、プログラミング学習領域にもコンテンツを出しているという印象です。
        従って、ゴールはIT就職、転職となっていることが多く、それを目的に利用しているユーザーが多いことが特徴です。
        そのPaizaが提供している初心者向け学習サービスが「Paizaラーニング」です。3~4分の短い動画を視聴しながら自分の学習環境で学習をしていきます。
        2021年5月現在で有料プランでは1,304本の学習動画を超可能です。有料プランの料金は月額¥1,078で学び放題です。
        Paizaラーニングの長所は、 多くの言語やツールの動画講座があり、幅広い学習ができる。
        転職や就職を目標としたカリキュラムのため、スキルチェックや、就活準備や現役エンジニアの小話など、他のサービスにはないコンテンツがある。
        Paizaの注意点は、
        プログラミング独学というより、どちらかというと、転職を目的としたスキルの獲得が目的である。
        スキルの獲得を目指す転職サービスであるという本質から、どちらかというとプログラミングスクールに近い印象を受けます。
        Paizaラーニングでも「これはチュートリアル学習である」と理解して取り組むことが重要です。
        自分で0から価値を生み出すようなことを目的として設計されているカリキュラムではないので、
        しっかりと次のステップを思い浮かべながら、チュートリアル学習教材として有効活用しましょう。
        3-2-4　Udemy
        UdemyはITエンジニアリングやデザイン、ビジネススキル、音楽など世界中の技術を持つ人々が自発的に講座を作成し、売り出す、学習講座のプラットフォームです。
        そういった特性上から少しレベルの高い教材も多いのでClass3で学習するには多少時期尚早な気もします。
        講座ごとに単価が設定されているので、自分にあった講座を見極めることも必要ですし、Class4で再度おすすめしようと考えています。
        この段階で興味のある方はぜひ調べてみてください。 3-2-5　YouTube
        言わずと知れたYouTubeですが、最近はプログラミング学習系ユーチューバーも増えていて、非常にわかりやすく面白いコンテンツで溢れています。
        当然無料です。一方でしっかりと一つの講座として再生リストとしてまとめられていたり、講座作成者の主観的なお話も聞けるのも特徴です。
        YouTubeの長所は、 全て無料の割にクオリティの高い講座が多い。
        講座作成者の生の声を聞ける。それが現役フリーランスエンジニアならその実体験を元に学習できる
        コメント欄で他の視聴者と交流したり、YouTuber自身に質問することができる。たまに返信が返ってくる。
        YouTubeの注意点は、
        あくまで個人の作成した無料講座なので、コードを間違えていたり、言葉や解説の間違いを訂正していないことがある。
        解説の仕方にYouTuberの特徴が出るので、親切に解説してくれる人もいればそうでない人ももちろんいるのでチャンネルを選ぶ見極めが重要。
        オンラインサロンへの入口や、スクールへの勧誘になっていることもあるので、最後の最後の肝心なところで動画が切られていることなどもあり、口座の全貌の透明性は有料サービスほど高くない。
        YouTubeは無料で、YouTuberが少しでもわかりやすいように、面白いように工夫しているものが多いので、学習のきっかけとしては良いかもしれません。
        使い慣れた媒体で学習できることを考えるとストレスも少ないです。一方で学習であることを忘れると、大変危険です。
        普段YouTubeを見慣れている皆さんであれば、これは容易に想像つくかと思います。目標を定めて勢いを持って一気に視聴しましょう。

        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center">
          <v-btn color="blue" class="text-white" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ3', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
