<template>
  <v-container fluid id="content">
    <!-- タイトル -->
    <div class="mb-4 pa-4">
      <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
      <p class="text-body-2 mx-6">このコンテンツの説明</p>
    </div>

    View Static Version
 
Class10
Brushup
[プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]
10-0-0　Class10
Class7~Class9で「伝えたいこと」を伝えるためのWeb制作をしてきました。プロジェクトの軸を立て、デザインをワイヤーフレームに落とし込み、実際にコーディングし、インターネット上に公開しました。ここまででWeb制作の過程は完了ですが、CLOTOでは「玄人」になるためにもう１段階、Webサイトをブラッシュアップすること、その姿勢も学習していきましょう。あと少しです！

10-0-0　Class10
10-1-0　ブラッシュアップのすゝめ
10-1-1　自己添削
10-1-2　他者からの批評
10-1-3　検討
10-1-4　他者への批評
10-2-0　その他のワンアップポイント
10-2-1　レスポンシブ対応はしたか
10-2-2　SEOとは
10-2-3　分析ツールの埋め込み
10-1-0　ブラッシュアップのすゝめ
ここまで「伝えたいことを」伝えるためのWebサイト制作をしてきました。ここでもう一度思い出して欲しいのはWeb制作の目標はコーディングではないということです。インターネット上に公開することでもありません。「伝えたいこと」が伝えたい相手にしっかりと伝わることです。

ここまで何度も何度も伝えてきました。ここでもう一度Class0の初心に戻りましょう。プログラミング学習は肩書きが変わっても続くものです。プログラミング独学の素人が苦労人を経て玄人へ。そしてフリーランスエンジニアや企業で働くエンジニア、起業家、SIer。どの道へ進んでも、プログラミングに携わる以上、学習は続きます。

[プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]もいよいよClass10を以って修了となります。常に「より良いもの」を目指し、生涯価値を創造し続けることができる人間になるためにあと少し、自作のWebサイトをブラッシュアップしましょう。

10-1-1　自己添削
まずは自己添削からいきましょう。具体的なポイントは後述します。自己添削で重要なことは「俯瞰する」ことです。

特にこのコースでは「伝える」ことができるという価値の習得を目指しています。つまり価値のあるWebサイトは、「伝わる」ものであるべきです。

しかし、同じ「伝わる」でも、よく目を凝らしたり、内容を理解するのに時間がかかってしまうものは価値が低いものということになってしまいます。実際にこのようなWebサイトはいいサイトではありません。

見る者の興味を瞬時に惹きつけ、共感を与え、何か行動にうつさせる。

これが重要です。そのためには、第一印象が全てです。URLを踏んで、Webサイトを表示した瞬間、読みたくなるか否か。これに限ります。

これが実現されているか否かを自己添削する方法は至ってシンプルです。「俯瞰する」ことです。「俯瞰」とは高い位置から全体を見下ろすことです。ここではあえて客観視ではなく「俯瞰」が最適な言葉でしょう。

どういうことかというと、これは例えでもなんでもなく、物理的に俯瞰して欲しいからです。一度ディスプレイから２mほど離れて表示されている画面全体を見ましょう。

どんな情報が飛び込んできましたか？どんな印象を受けましたか？あなたはWeb制作をした本人なのでそのサイトの内容をよく理解しているし、愛着もあるはずです。しかし俯瞰してみた場合、これまでのイメージとはほぼ確実に違う見え方をするはずです。文字が見にくい。フォントがおかしい。色の調和が取れていない。なんかごちゃごちゃして一番重要なポイントがわからない。なんか暗い。など。

１〜２m離れた程度で「伝えたいこと」と異なる情報や印象が飛び込んでくるWebサイトは「失敗作」です。ここは厳しく自分に向き合いましょう。Class9で既に公開を終えているから完了ではありません。むしろ公開してしまっているからこそ早急に修正しなくてはなりません。

俯瞰して厳しい自己添削しましょう。より良いものを目指しましょう。

10-1-2　他者からの評価
俯瞰による自己添削にも限界はあります。より良いものを目指すために他者の視点を借りましょう。

そもそもWebサイトは作成者以外に向けられたものですので他者に正確に伝わらなければ意味がありません。Class9でURLの発行が済んでいるはずです。プロフィールに成果物として記載したり、カルテ、タイムラインで公開し、レビューを求めましょう。褒めてもらえることも多くモチベーションが上がる一方で辛辣な評価や、的確すぎるアドバイスをもらえることもあるでしょう。そのような時は「これこそ成長機会だ」と、「自分自身では学べなかったことを学ばせていただいた」と心から感謝しましょう。

CLOTOはプログラミング独学者の聖地です。みんな学習過程です。他者からの批評を受けることは恥ではありません。むしろそのためにCLOTOを利用しているようなものなのです。門外漢ではなく、同じプログラミング学習者から自分のプロダクトについて「素材とテーマがミスマッチでは」「ボタンの位置がわかりづらい」「素材データが大きすぎるのか、スムーズに挙動しない」「これはルール違反なのでは」などの率直な指摘をいただけることは日常生活においてほぼありません。この上なく貴重な学習機会ですよ！

お互いに忌憚なく適切に評価しあい、高め合いましょう。

10-1-3　検討
自己添削と、他者からの評価によって自分のプロダクトに修正を加える必要があると感じた時は、一度冷静に検討をしましょう。

特に他者からのアドバイスによって修正を加える際、その評価が主観的な場合や、自分がこだわった独自の表現の場合です。こういった場合は安易に鵜呑みにすることが必ずしも正義ではありません。もちろんはなから突っぱねる行為は愚かです。他者の評価を受け入れながらも、自分の軸は強く持ちましょう。自分の価値観、創造性に明らかに反したプロダクトを創ってもそれはあなた本来の価値を発揮できていない可能性があります。最初は荒削りでも、その異端性が価値になることもあるからです。

しっかりと他者からの評価を受け入れ、検討し、自分の意思で決定を下していくことで成長していきましょう。

10-1-4　いいものはどんどん盗め
自分のプロダクトを通じて学ぶだけに終始してはいけません。他の学習者や世の中から常に貪欲に学び続けましょう。タイムラインに流れてくるカルテや投稿。他の学習者のプロフィールや「いま取り組んでいること」。これらの中で自分が知らないこと。興味があること。気に入ったデザイン。アイデア。これらはすぐに調べて自分のものにしていきましょう。必要があれば、本人にコンタクトを取ることもいいでしょう。

10-2-0　具体的なワンアップポイント
ここまでより良いものを目指す、心構えや姿勢について学習しましたが、最後にWebサイトの価値を上げる三つのワンアップポイントを簡単に記します。もしまだ対応していないものがあれば、ぜひ修了する前に取り組んでみてください。あと一歩。頑張りましょう！

10-2-1　レスポンシブ対応はしたか
Class7で触れたように、様々なディスプレイサイズのデバイスからWebブラウジングされるようになった今日では、それぞれのディスプレイサイズに応じたWebデザインが求められます。これに対応するデザインをレスポンシブWebデザインと言います。

二種類のコードを用意しなくてもCSSやフレームワークを駆使することで簡単に対応させることもできます。まだ取り組んでいない方は、ぜひ取り組んでみてください。

10-2-2　SEOとは
これまでも少し触れてきましたが、SEOとはSearch Engine Optimizationの略で「検索エンジン最適化」と言います。これはWebブラウザの検索エンジンのオーガニックな検索結果において特定のWebサイトが検索結果の上位に用事されるよう、検索エンジンのアルゴリズムを逆利用するべくWebサイトの構成などを調整することです。難しくなりましたが、要は検索結果上位にWebサイトを表示させるための取り組みのことです。

Webサイトは「伝えたいこと」があるから作られるわけで、少しでも露出を増やし、多くの人に見てもらうことを目的に作られることが多いです。特にWebを利用したデジタルマーケティングの現場では、このSEOが非常に重要視されています。

検索エンジンのアルゴリズムは公開されていないものも多いので、公式から出たわではない情報がほとんどです。しかしこれまでに多くのマーケティング担当者やエンジニアが、さまざまな施策を行う中で得られた知識が蓄積されて、ある程度の共通認識が作り上げられている状況もあります。試しにGoogle ChromeというWebブラウザのSEOの方法を検索してみましょう。

もし今回のWeb制作で必要なくても、SEOのノウハウは非常に重宝されるので、調べたり、試験的に実装してみることをお勧めします。

10-2-3　分析ツールの埋め込み
「伝える」ことが目的のWebサイトにおいて、そのWebサイトが本当に価値を発揮しているのか、定量的に確認することも重要です。さまざまな分析ツールがあります。

1日何人が訪問し、そのうちどれほどがしっかりと閲覧しているか。何分間Webサイト上にるのか。直帰率はどれくらいか。それらの推移はどうなっているか。などを分析してくれるツールもあります。Google Chromeにおける、GoogleAnalyticsというサービスはその代表と言えるでしょう。

また一風変わったものにヒートマップという分析ツールもあります。これは閲覧者のカーソルや指の動きなどを元に、ページのどの辺までみられているか。どこに興味を示しているかなどの度合いをサーモグラフィーのように色分けで視覚的に示してくれるものです。こちらもWeb制作者には必須のツールと言えますので、導入しておきましょう。



    <!-- コンテンツ1 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー1</span>
    </h2>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">
        ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
      </p>
      <p>ダミー</p>
    </v-container>

    <!-- コンテンツ2 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー2</span>
    </h2>
    <v-container fluid>
      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '1.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>

      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '2.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>
    </v-container>

    <!-- コンテンツ3 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー3</span>
    </h2>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">ダミー</p>
      <p>ダミー</p>
    </v-container>

    <v-row justify="center" class="mb-4">
      <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ10', // コンテンツタイトル
      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
