<template>
  <v-container fluid id="content">
    <!-- タイトル -->
    <div class="mb-4 pa-4">
      <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
      <p class="text-body-2 mx-6">このコンテンツの説明</p>
    </div>

<<<<<<< HEAD
      <v-col cols="8" id="content">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        View Static Version
[プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード]
7-0-0　Class7
Class7へようこそ。Class7からClass10は苦労人後期になります。完全自作のWebサイトを創る、玄人への最終ステップです。[プログラミングで「伝える」コース]の核心へ迫っていきますよ。

Web制作の肝はClass7。企画・デザイン・設計などコーディングの下準備を行います。Class6で取り組んだことをもっと詳細に細かく戦略的に行う学習をしていきます。Class10終了後に公開することを前提として本気で取り組んで行きましょう。

7-0-0　Class7
7-1-0　下準備のすゝめ
7-1-1　Web制作のマインドセット
7-1-2　プロジェクトの目的は何か
7-1-3　「伝えたいこと」は何か
7-1-4　誰に伝えるか、ペルソナ設定
7-1-5　プロジェクトの軸を言語化する
7-2-0　企画のすゝめ
7-2-1　雰囲気を決める
7-2-2　伝わるコピー
7-2-3　伝えたい情報の用意
7-2-4　素材の用意
7-2-5　ロイヤルフリーの画像素材
7-3-0　顧客体験　UXとUI
7-3-1　UX
7-3-2　UI
7-4-0　サイト設計
7-4-1　サイトマップ
7-4-2　簡単手書きメモ
7-5-0　Webデザイン
7-5-1　Webデザインの歴史と流行
7-5-2　応用手書きメモ
7-5-3　ワイヤーフレーム作成
7-5-4　認知心理学
7-5-5　配色
7-5-6　おすすめWebデザイン集
7-6-0　素材の編集
7-6-1　フォント
7-6-2　Font Awesome
7-6-3　画像素材の編集
7-7-0　レスポンシブデザイン
7-1-0　下準備のすゝめ
Class6でも触れたように、Web制作は「伝えたいこと」を伝えるための手段です。プログラミングありきで見切り発車して開発してしまっては、本来の「伝える」という目的に対して、開発者として最大限の価値を提供することができません。

まずは徹底的にWeb制作をするにあたっての下準備をしましょう。そもそもなぜWebサイトを作るのか。そして「伝えたいこと」は何か。それを誰に、どうやって伝えるか。どのような素材をどう使うか。などコーディング前に全て決めてしまいましょう。順番に取り組んでいきましょう。

7-1-1　Web制作のマインドセット
コースを通じてお伝えしているようにWeb制作は「伝えたいこと」を適切に伝える手段です。なぜこんなに何度も書いているか、逆に考えればわかりやすいですね。「伝えたいこと」がないにも関わらず、Web制作をする必要はあるのでしょうか。PCのディスプレイに何が表示されるのでしょうか。

「伝えたいこと」がない限りWeb制作を始めることはできません。実際にWeb制作企業やフリーランスで案件受注する際には、クライアント企業や依頼主と綿密に打ち合わせを重ね、「伝えたいこと」を明確化させ、目的や仕様について議論をします。

個人でWeb制作する際にも同じです。何の目的でweb制作をし、そこで「伝えたいこと」は何か。これを明らかにしていく必要があります。

例えば、自社で商品販売をしていて、そのホームページへと顧客を流入させるためのWeb記事を作るのであれば、対象顧客の悩みをしっかりと分析し、その人たちに向かってその悩みを解決する手段を持っていることを明確に伝える必要があります。

あるいは、フリーランスの映像クリエイターとして活躍していきたい中で、プロフィールページを作るのであれば、Class6で取り組んだ自己紹介サイト以上に、さらに自分の個性、独創性や活動経歴をわかりやすく、期待値と共に伝える必要があります。若くエネルギッシュな奇才のようなページにするのか。それともクールで洗練されたデザインに仕上げるのか。自身のこれまでの創作物を全面に押し出すのか。個人としての誠意や熱意を押し出すのか。

このように一枚のWebページを制作するだけでも考慮すべき点は多く、「伝えたいこと」が正確に伝わるかどうかに直接的に関わってきます。じっくりと掘り下げていきましょう。

まず何よりもWeb制作では制作する目的、Webサイトで「伝えたいこと」を明確化させることが重要になります。一度紙と鉛筆をとってノートに整理していきましょう。

7-1-2　プロジェクトの目的は何か
制作する目的がしっかりとあり、「伝えたいこと」もある程度言語化できてきたら、それを明確化させていきましょう。

まずは制作する目的の掘り下げからです。

今回Web制作をする目的は何でしょうか。自分という人間を世間に認知してもらうことでしょうか。企業について知ってもらうことでしょうか。オンラインショップへ顧客流入を図るためのランディングページでしょうか。これまでデザインしてきたグラフィックデザインのポートフォリオサイトでしょうか。

「何のために何をするサイト」のような形にするとブレにくいでしょう。

メガネメーカーA社(仮)のマーケティング部なら、「自社の画期的な新商品について知ってもらうために、商品の想定顧客に従来のメガネと新商品との違いを知ってもらい、公式オンラインショップへ流入してもらえるようなWebサイトを創る。」といったようなものになります。(マーケティング関連でWebサイトを作るのであれば、KGI、KPIを細かく設定し、分析ツールを埋め込んだりSEO対策をしたりと+αで取り組むことがあると思いますので、それは別のコースで学習しましょう。)

フリーランス動画クリエイターB(仮)さんの場合、「企業案件獲得につながるような、自分の力量やこれまでの活動、創作物が魅力的に伝わるプロフィール兼ポートフォリオのようなWebサイトを創る。」といったものでも良いかもしれません。

なるべく簡潔に、過不足ない状態で、あなたがWeb制作する目的を言語化しましょう。

7-1-3　「伝えたいこと」は何か
次に「伝えたいこと」ですが、これは、先に言語化した目的の中でも特に伝えたいポイントのことです。

メガネメーカーA社(仮)の場合であれば、「A社は、ユーザーの悩みを明確に把握していて、その悩みを完全に解決する製品を手頃な価格で販売していること」を伝えなくてはいけません。

フリーランス動画クリエイターB(仮)さんの場合では、「Bには卓越した動画編集技術とセンスがあり、なおかつ依頼主の要望に応えてきた実績があること。そして人間として魅力的であること。」を伝える必要があります。

これら「伝えたいこと」をより具体化することで、Web制作における「なぜ」にあたる、目的を持たせるだけでなく、「何を」「どのように」「いつ」「誰に」といった問い全てに一貫した答えを出すことができるようになります。

正確に伝えるためには「伝えたいこと」を詳細まで明確に理解していることが重要なのです。

7-1-4　誰に伝えるか、ペルソナ設定
Web制作を創る目的、Webサイトを通じて「伝えたいこと」が明確になったら、次に、「誰に伝えるか」を明確化させていきましょう。目的や「伝えたいこと」まではしっかり決めることができても、「誰に伝えるか」の議論を曖昧にすることで、「伝えたいこと」が伝わって欲しい人に伝わらなくなってしまうことがあります。Webサイトはこの世に無数にあります。その中で「伝えたいこと」を伝えたい人に正確に伝えることは至難の業です。

そんな中で伝えたい人が曖昧な状態は、どれほどに無謀なことかわかると思います。Webサイトの雰囲気から、文体、文章、フォント、比較対象物や例え話一つをとっても、全く異なるのです。

メガネメーカーA社(仮)の場合であれば、「A社は、かなり視力が低く、コンタクトではなかなかちょうど良い度数のものがない。しかし、分厚いレンズの眼鏡は他人から見て、目の位置が屈折してしまいスタイリッシュでないから仕方なく少し度のあっていないコンタクトをつけているというユーザーの悩みを明確に把握していて、その悩みを完全に解決するスタイリッシュかつ視力の補正にも十分な製品を手頃な価格で販売していること」を伝えなくてはいけません

「目が悪い人」と曖昧な定義のままWeb制作を進めると、例えば、度数にだけフォーカスしてしまい、スタイリッシュであるという部分を過小評価して表現してしまい、本来届いて欲しかった相手に魅力が伝わらないという事態が起こるかもしれません。

これはビジネスの現場では一般的な「ペルソナ設定」と呼ばれる作業です。どのような属性のどのような課題感を抱えたどのような人間が、顧客なのか。Web制作の場合ではどのような閲覧者なのか。ここを明確に設定することで、より、閲覧者の課題に訴求できる価値の高いWebサイトを創ることができます。

7-1-5　プロジェクトの軸を言語化する
Web制作の目的を定めることで「なぜ」、「伝えたいこと」を定めることで「何を」、ペルソナを設定することで「誰に」を明確にすることができました。これから皆さんはWeb制作という一つのプトジェクトに取り組みます。この「なぜ」「何を」「誰に」は、Web制作というプロジェクトの軸になります。

「どうやって」などは、デザインやテキストの内容によって様々なアプローチを取ることができますが、「なぜ」「何を」「誰に」は基本的に揺らぎません。したがってこれらを「プロジェクトの軸」と呼ぶことにしましょう。

これから、実際にデザインをしたり、コーディングしていく過程でも、常にこのプロジェクトの軸を念頭に、逸脱しないように取り組んで行きましょう。

最後にプロジェクトの軸を言語化してカルテにあげて7-1を修了にしましょう。

7-2-0　企画のすゝめ
プロジェクトの軸を定めたことで、今回のWeb制作の「なぜ」「何を」「誰に」が明確されました。7-2では「どうやって」伝えるかの下準備をしていきます。いわゆる企画部分です。まずは今回作ろうとしているWebサイトの概要を決め、それから掘り下げていきましょう。

7-2-1　雰囲気を決める
「伝えたいこと」をどうやって伝えるかの概要を定めていきます。どのような雰囲気のWebサイトにしていきましょうか。第一印象は非常に重要です。

Webサイトを開いた瞬間にしっかりとペルソナを惹きつけましょう。この点においては米Apple社のWebサイトは素晴らしいです。ブランドを感じさせ、なおかつ購買意欲を煽る文句と画像イメージ。スクロールするごとにアニメーションが施されており、ワクワクが止まりません。目標とすべきWebサイトであると言えます。この点は7-4「顧客体験」で解説しています。

さて、まずは第一印象の案を書き出してみましょう。楽しそうなイベントの雰囲気を届けるのか。共通課題の深刻さなのか。製品の魅力なのか。

ここはいくつも案を書き出すことが好ましいでしょう。

プロジェクトの軸とメモを見比べて最も「伝えたいこと」と「ペルソナ」に最適な雰囲気を決めましょう。

7-2-2　伝わるコピー
雰囲気が定まれば、次は具体的にペルソナに刺さるキーワードを書き出しましょう。これは複数あっても構いません。プロジェクトの軸と、雰囲気を言い表したキャッチコピー。そしてそれに説得力を持たせるキーワードを思いつく限り書き出していきましょう。

このキャッチコピーはそのWebサイトの一言概要になるわけです。その力は凄まじく、決しておざなりにしてはいけません。せっかくいい画像素材やWebデザインになっていても、ここが弱ければ「伝えたいこと」は刺さりません。「あ〜綺麗なWebサイトだな〜」と思われても本来の目的を達成できなければ、プロジェクトとしては失敗です。価値の低いWebサイトになってしまいます。

まずはキャッチコピーの案を書き出しましょう。そして最もプロジェクトの軸に合ったものを選びましょう。

「革命的な速さ」「まるで雲の上で寝ているかのような寝心地」「毎朝起きるのが楽しみになる一杯」など様々なパワーワードや比喩を用いて「伝えたいこと」の良さを際立たせましょう。

キャッチコピー関連で検索をかけると、キャッチコピーの上手な作り方やこれまでの大手代理店が作ってきた秀逸なコピーを見ることができます。書籍もたくさんあるのでぜひ一度調べてみてください。Web制作をトータルコーディネートできる力が身に付きますよ。

キャッチフレーズが決まれば、それに説得力を持たせるキーワードを書き出していきましょう。「環境負荷が少ない」や「レトロな仕上がり」など。「伝えたいこと」の持っている性質やプッシュポイントを言語化する方法もあります。また数値化も非常に刺さります。「環境負荷が少ない」よりも「従来品に比べて60%削減」と書いたほうがインパクトがあります。或いは「環境負荷が従来品の40%」にしてしまうのもありでしょう。

キーワードを考えていく際に、ロジックツリーやマインドマップといった便利なツールもあります。基本手書きメモで構わないのですが、無料アプリなどもあるのでぜひ利用してみてください。一つの言葉や要素を３つに分解していくと核心に迫りつつ、たくさんの切り口を見つけることができます。試してみてください。

キャッチフレーズ、キーワードともに50個くらい描き出せると、いいものに出会えますよ。

7-2-3　伝えたい情報の用意
キーワードはたくさん書き出せたでしょうか。一度書き出してしまったら、今度はこの中から選りすぐりのものだけ集めていきましょう。全てのキーワードを載せることはできませんし、これらを全て入れることができても読みにくいですし、特徴が競合してどれが一番伝えたいことなのかが分かりにくくなてしまいます。

プロジェクトの軸、キャッチフレーズ、にあった「特に伝えたいこと」を選びましょう。片手で数え切れるくらいがいいですね。

これらを選び出すことができれば、さらにそれを整形して、伝える順番も決めましょう。

これが決まれば、そのキーワードごとに文章を考えていきましょう。ついつい長くなりがちですが、「伝える」ことが目的な以上、必要以上の情報を載せることはNGです。要約力が重要になります。

キャッチフレーズ、キーワード、文章。これらが用意できれば、一度メモプリなどに書き出して一時保存しておきましょう。

7-2-4　素材の用意
さて、文字情報の材料は整いました。次は画像や動画の素材を集めていきましょう。これも考え方は一緒です。プロジェクトの軸、「伝えたいこと」に合致しているかが重要です。

一方で、画像や動画の素材は資格にダイレクトに飛び込んでくる一次情報になりますので、より効果的な使用が求められます。当然画像や動画の効果的な編集には、それ専門で勝負されている方もいるくらいですから、そう簡単に最高品質のものを用意できるわけではありません。実際のWeb制作の案件などでは、デザイナーやクリエイターの用意した素材を利用することがほとんどですので、多少全体の雰囲気を整えることができれば良いのかもしれません。しかし[プログラミングで「伝える」コース]では、「伝える」ことができるという価値をトータルで発揮できることを目的としています。

7-6で素材の編集についても簡単に触れます。もし学習時間を割ける方は、表現の自由度が格段に上がるので、是非、画像編集や動画編集などの学習も並行して取り組まれることをお勧めします。

ここでは簡単に素材を用意する上で最低限知っておくべきことの概要だけ触れておきます。

まずは画像から。一口に画像と言いますが、画像データにも様々な種類があります。大きく以下の二つがあります。

ビットマップデータ形式
ベクターデータ形式
ビットマップデータ形式とは、ピクセル単位の正方形の色の塗りつぶしで静止画像を表現する方法です。画像の中でも写真などの微妙な色合いやグラデーションが求められる表現ではこちらの形式が好まれます。一方で、拡大すると画像が粗くなる特徴があります。

代表的なファイル形式としては、JPEG、PNG、GIFがあります。それぞれに特徴があるので、調べてみてください。

ベクターデータ形式とは、点や線、座標などの数式データで静止画像を表現する形式です。拡大しても見た目を維持できます。ロゴやイラスト、テキストを表現する際にはこちらの形式が好まれます。複雑なサイズの場合、ファイルサイズが大きくなってしまい、読み込みが遅くなります。

代表的なファイル形式にSVGがあります。

ファイル形式ごとに特徴が異なっていますので利用場面に応じて適切に使い分けましょう。

次は動画です。こちらも種類があります。

動画ファイルは注意が必要です。表示するWebブラウザによって対応ファイルが異なることがあります。

そもそもWebサイト上で動画素材を利用する方法ですが、HTML5で追加されたvideoタグを使って埋めこむ方法や、最近では一度YouTubeに動画をアップしてそれを埋め込むことも多いようです。

最も主要なファイル形式はMP4形式になります。こちらはほとんどのブラウザで利用可能ですが、古いバージョンのIEなどはMP4に対応していないため注意が必要です。

iPhoneで撮影した動画はアップル社の開発したMOV形式で保存されます。Windows OSで再生するには、専用アプリが必要です。一度MP4に変換する必要があるでしょう。

マイクロソフト社製のAVIやWMV、DVDなどで使われるVOBなどの形式もあるので、場面に応じて必要な形式を選択し用意しましょう。必要であればファイル変換を行うべきでしょう。

一番無難な方法はYouTubeにアプロードした動画を埋め込むことでしょう。サーバの容量を圧迫することもありませんし、YouTubeにアップロードする段階で、自動でファイル形式を変換してくれたり、ファイルを圧縮してくれます。

7-2-5　ロイヤルフリーの画像素材
画像素材はWebページのイメージを左右する重要な要素です。可能であれば、プロジェクトの軸にあった画像素材を自前で用意するのがベストです。しかし、全ての場面においてこれが可能なわけではありません。用意できるものに限界がある場合があります。このような場合はロイヤルフリーの画像素材を使いましょう。もちろんインターネットから拾ってきた画像を勝手に利用することはNGですので、しっかりとロイヤルフリー素材を用意してあるサイトを知っておくと便利です。以下にいくつか紹介しておくので参考にしてください。

.foto project
.foto projectは、世界中の1億5,000万点を超えるストックフォトが198円（税抜）から買える世界最大級の素材販売サイトなど、写真素材のダウンロードサービスを提供しています。https://free.foto.ne.jp/

pixabay
pixabayは多くのクリエイター達による、商用利用な2.300万点以上の高品質な画像・動画素材が用意されています。写真だけでなく、ベクター画像や、イラストなども用意されています。https://pixabay.com/ja/

Adobe Stock
Adobe社の提供するロイヤルフリーの画像素材、ベクターアート、イラスト、ストックミュージックなど様々な素材が用意されています。10枚までなら無料で利用可能です。https://stock.adobe.com/jp

Unsplash
海外のサービスで、英語のサイトになっています。海外の画像が豊富に揃っているのが特徴です。カテゴリ別でまとめられており、ネットサーフィンのような感覚で、眺めながら良い素材を探すことができます。https://unsplash.com/

food.foto
food.fotoでは、プロのカメラマンが撮影した野菜・果物などの食材、料理、ビール・ワインなどのドリンク、食器、デザートなどの写真を無料でフリー写真素材として公開しています。商業デザインにも使える高解像度のフリー画像が無料でダウンロードできます。https://food-foto.jp/

7-3-0　顧客体験　UXとUI
プロジェクトの軸、素材が揃ったので、早速Webデザイン開始といきたいところですが、その前に少しインプットをしていきましょう。

みなさんはこれまでの人生で様々なWebサイトを見てきたと思います。なぜ閲覧しましたか？閲覧している最中はどんなことを感じましたか？閲覧が終わった後、どんな行動を取りましたか？

Webサイトには作成する目的があることを何度も触れてきました。そして「伝えたいこと」があることも触れてきました。

そうです、私たちはWebサイトを閲覧したときに、その制作者から何かしらの影響を受けているのです。もし何も受けていないのであれば、そのWebサイトは「クソ」です。

Webサイトは、Webサイトを通じて、閲覧者に何かしらの影響を与えるのです。与えるために作られているのです。この閲覧者の一連の体験をトータルコーディネートをすることも、Web制作者の使命と言えます。

この際に重要になる考え方がUXとUIです。Class0からClass6までで調べ学習などを通じて一度は見たり聞いたりしたことがあるのではないでしょうか。UXとUI、非常によく似た言葉ですが、Web制作をする上で欠かせない概念ですので、簡単にご紹介しようと思います。興味のある方はどんどん調べてみましょう。

7-3-1　UX
UXとはUser Experience の略で、日本語訳は「ユーザー体験」、或いは「ユーザー経験」です。製品や商品、今回であればWebサイトの利用を通じて、ユーザーが得る一連の体験のことです。ここでは「ユーザー体験」で統一しておきましょう。

UXは、製品の良し悪しにおいて、或いは製品から得られる体験全てにおいて、ユーザーの主観的価値を重視する姿勢がとられています。特に2000年ごろから産業界で注目されてきた概念です。

ここで重要なのはユーザーの「主観的」価値に焦点を当てて製品設計していく必要があるということでし。特にビジネス現場における例として、高性能スマートフォンを市場に投入する際に、技術や機能がどれほど優れているかを全面に押し出したところで、消費者のニーズには合いません。あるいは訴求ポイントを間違えており、売れません。そのスマートフォンから得られる体験にフォーカスをあて、製品をデザインし、その体験ごと得る。これが近年の製品、製品販売に求められるUXを考慮したビジネスと言えます。

UXにこだわり抜き、大成功を収めている企業として米国のApple社があげられます。ご存知の通り、家庭用PCの先駆けとしてのMacintosh、すなわちMacシリーズで、家で手軽にPCを使って、様々な体験を得ることができる点を強調し、また、製品も、これまでのPCオタクにしかわからない仕様ではなくGUIやマウスといった誰にでも操作できるものへとしたことで大成功を収めています。その後iPhoneを市場に投入し、業界を激変させ、今日に至っていることは言うまでもありません。AppleのUXはこれにとどまりません。年数回ある新作発表イベントまでは徹底的に新製品情報を隠し、ファンの期待感を煽り立てます。そして最高クラスの広告、イベントを行い、たちまち話題を作り上げます。気になってインターネットでWebサイトを訪問すると、最高品質の画質とWebページ、キャッチーな言葉。利用局面が手にとるようにわかる説明に、ユーザーの声。実際に店舗に製品を見にいくと、洗練された近未来のような店舗に、美しく先進的なデザインの製品が並んでいます。実際に購入すると、箱まで美しい。開封する際には、あえてすぐに開かないように設計されている箱のせいで購入者は開封を焦らされ、いざ製品が出てくる際には、まるで宝の箱を開けたような満足感。製品事態も徹底して、UXを意識したUIとなっており、決して料金は安くありませんが、それ以上の体験を我々ユーザーに提供しています。

と、いったようにAppleを褒めちぎってみましたが、実際にこれらが実現されていると言う点で、全ての開発者が見習うべきものであると言えます。Webページひとつから、ハードウェア、OS、それら全てが噛み合ったとき、消費者はこれ以上ない体験を製品を通じて受け取ることができるのです。

「消費者は、単に製品やサービスを消費するのではなく、その消費から得られる体験そのものに価値を見出す。」と言うことを肝に銘じましょう。

Web制作においても、同じです。どんな気持ちでどんな閲覧者がこのサイトへ辿り着くのか。どのような気持ちで閲覧し、そのサイトから何を得るのか。そのサイトを離れる際、次にどのようなアクションをするのか。そのサイトについてどのような印象を持つのか。など。ここまで意識できればWeb制作者として十分に活躍していけるでしょう。

7-3-2　UI
UXの話をしている際にUIという言葉が出てきました。UIとはUser Interfaceの略です。ユーザインタフェース。機械(特にコンピュータ)とそのユーザーの間での情報をやり取りするためのインタフェースのことです。インタフェースとは様々な意味がありますが、広義では接合面。ユーザーインターフェースの際には、機械と人間の接点がこれに当たります。キーボードやマルチタッチディスプレイ、スマホのホームボタンや仮想ボタンなどもユーザーインタフェースです。

特にWeb制作において、UIとは、「訪問者が視覚的に得るすべての情報」を指しますのでその指し示す範囲は非常に広範囲に及びます。ロゴやボタン、フォント、画像、動画、などあらゆる情報とその配置、表現方法がUIと呼ばれます。UIはUXと一体不可分で、優れたUXを実現するためには優れたUIが必要になります。また、後ほど触れますが、Webサイトは紙媒体などと異なり、閲覧するデバイスによって見え方が変わります。これらにもきちんと対応していくことで、良いUIになります。

Web制作では常にUX・UIを意識しながら制作に取り組んでいきましょう。

7-4-0　サイト設計
プロジェクトの軸、雰囲気、素材、UX・UIへの理解が深まったら、サイト設計をしていきましょう。まずは優れたUXを得られるサイトにするために、どのような構成にするか考えましょう。ホームページがあって、コンテンツのページがあって、製品紹介のページがあって、お問い合わせのページがあって、、、といった感じです。あくまでプロジェクトの軸、雰囲気などから逸脱しないように何度もアイデアを練り直しましょう。

7-4-1　サイトマップ
サイトマップとは同一サイト内のWebページの一覧です。複数あるWebページが集まって一つの意味を持つ場合それをひとつのWebサイトと呼ぶわけですから、それぞれのWebページは関係性を持っているわけです。これはハイパーテキスト方式をとっているWebの最大の特徴です。このWebページ同士の繋がりを図で表現したものがサイトマップになります。

そして、ブラウザやSNSでURLからWebサイトへと、閲覧する人が一番最初に辿り着くページをランディングページ（着地ページ）と呼びます。また、全てのページの軸になっており、Webサイトの顔とも呼べるものを、本来ホームページと呼びますが、近年ではWebサイトとほぼ同義で使われており、ここはあまり気にしなくていいでしょう。

まずは、キャッチコピーやキーワードで考えたこと、また、Web制作の目的に応じて、必要なページを洗い出していきます。

まずホームページ。そして、コンテンツの集約されたページ。お問い合わせのページ。FAQのページ。など、ページごとに必要な意味を持たせていきましょう。

それらを洗い出すことができたら、ホームページを軸に、どのように配置して関連させていくかを図で表しましょう。

これがサイトマップです。

7-4-2　簡単手書きメモ
ここまで様々な下準備をしてきました。世の中には、様々な便利なソフト、ツールが溢れており、どのフェーズでも基本的にすでに便利なサービスが有料無料問わずに用意されています。サイトマップを作るにしても、キーワードを考えるにしても、便利なツールがあります。一方で、ここまでのフェーズでは比較的じっくりと考えることが多かったかと思います。このように深い嗜好が必要な際には、必ずしもツールを使いながら考えることをお勧めしません。やはり紙と鉛筆が十分であり、最適ではないでしょうか。ツールは非常に便利ですが、必要以上にたくさんのツールを用いることは、それぞれの使い方を学ぶ必要もありますし、全てに互換性がない以上必ずしも必要ないとも考えられます。

簡単な手書きメモができてこれで良いと思えたら、ツール上に綺麗にまとめる。これくらいの方が、ツールの山に埋もれて、作業効率が逆に下がるような事態を起こさずに済むのではとも思います。是非ご一考ください。

7-5-0　Webデザイン
いよいよWebページのデザインをしていきます。プロジェクトの軸をもとに、それらの表現を最大化させるデザインを学んでいきましょう。ここでは特にUX・UIへの意識を強く持って取り組みましょう。

"Design is not just what it looks like and feels. Design is how to works."

「デザインとはどのように見えるか、どのように感じるかということだけではない。デザインとはどのように機能するかだ。」

Apple創業者の故スティーブ・ジョブズ氏の名言です。UX・UIとデザインの関係性を言い表した、金言ですね。

Web制作の場合、どのように機能するかとはまさに「伝えたいこと」が正確に伝わるか否かを指しています。プロジェクトの軸、雰囲気、キャッチフレーズ、キーワード、素材、そしてWebデザイン。これら全てが噛み合ったとき、最良のデザインとしてそれは機能するのです。奥が深いですね。

7-5-1　Webデザインの歴史と流行
Webデザインの歴史はWorld Wide Web(いわゆるWeb)の誕生にまで遡ります。1989年に誕生したWebはその後急速に発展し、現在こうして私たちがスマートフォンで手の上で閲覧したり、自宅で容易に制作できるほどにまで身近な存在になりました。

誕生来30年が経過しましたが、その過程でWebページのでざいんにも当然進化と、流行がありました。現在もそのような歴史の過程であり、当然技術の進歩に伴い表現方法やその流行は目まぐるしく変化しています。これまでの大きな流れを知り、現在の流行を把握しておくことはWeb制作者において重要です。

時代遅れのデザインや表現方法では、やはりその時代の平均的なUX・UIをも実現できない可能性があります。閲覧者の目は厳しく、シビアにデザインの良し悪しが判断されます。

それでは大まかに歴史を見ていきましょう。

Webの登場時、そのデザインはほとんどテキストによるもので、かろうじてテキストリンクに色がついていたりする程度のものでした。当然当時としては画期的ですが、今から思えばなんとも素朴なデザインです。また、現代ほどPC側のスペックも高くなく、またインターネット環境も脆弱だったため、非常に動作の重いWebサイトだったようです。

1993年にHTMLが生まれたことで、マークアップが可能になり、一気にWebデザインというものが意識されるようになりました。HTMLは現在でも現役であり、Web制作の基本ですね。しかしこの当時、Webデザインという概念が広まりつつも、先の通り、通信速度の問題やPC側のスペックの問題もあり、グラフィックデザインを適用させても、重くなりすぎて動作しないということが起きました。スティーブに言わせれば、このデザインは「機能していない」状態ですね。

1990年代後半になると、現在のAdobe社の前身企業が「Flash」というソフトを開発したことで、Webデザインにテキスト、画像はもちろん、音声やアニメーションまで組み込むことができるようになったのです。大革命ですね。

一方で検索エンジンとの相性が悪かったFlashはSEOの観点方徐々に敬遠されていきます。2020年にはFlashが完全終了しました。

1996年末にはCSSが登場しました。CSSはスタイルシートといって、HTMLなどのマークアップ言語の体裁を整えることができるものです。CSSの登場により、Webページの構造をHTMLが、デザインをCSSが担当するようになり、より表現の幅が広がったのです。また、役割を分担できるようになったことで、データは軽くなりました。

その後、Web2.0が登場したことで、Webが端末やOSの制約を受けることなく利用することができるようになりました。このおかげで現在は当たり前にOSXを搭載するMacからでもWindowsOSからでも、ガラパゴス化したiモードからでも同じWebページ、デザインを見ることができるようになったのです。

また、この頃から検索エンジンが飛躍的に進化を始めました。Googleなどを中心にSEOなどの概念が広まり、Webデザインが単に視覚的に優れているだけでなく、検索エンジンのアルゴリズムに適応させることで検索した際に上位に表示されるような具体的な機能面にまでその担当範囲を広めました。

2008年にiPhoneが登場するとまたしてもWebデザインに大変革が起きます。PCに比べて画面サイズの小さいスマホでのWebブラウジングの機会が増えたことで、両画面に最適化されたレスポンシブデザインを考慮する必要性が生まれたのです。これまではPCでたくさんの情報を表示することに主眼が置かれていたため、Yahoo!のWebブラウザのトップページのように縦にカラムがいくつにも分かれていたりするデザインが主流であったものが、スマホでも見やすいようにシングルカラムのデザインへシフトしました。

また、このようなデバイスの進化は当然、スペックの進化でもあり、また通信規格もどんどん変化していった中で、より画素数の高い写真や重い素材もWebデザインに組み込めるようになりました。

Webサービスが一般化したことによりWebサイトの持つ役割も情報の表示にとどまらなくなてきたのです。

そしてiPhone、iOSの登場はWebデザイン界に「スキューモーフィズム」というトレンドをもたらしました。これはアイコンやボタンを立体表示させることで、それがボタンであることを明確に示したりするもので、三次元の現実社会の感覚をWebデザインに応用させた画期的なものになりました。

一方で2018年にはiOS7がスキューモーフィズムを廃止し、フラットデザインにシフトしたことで再び、業界がこの動きに追従します。

2014年にはGoogleが「マテリアルデザイン」というデアイン指針を発表します。一見するとフラットデザインと似ているのですが、カーソルをホバーさせたときにアニメーションを持って変化を与えることでそれがボタンであることを明示したり、要素の重なりを表現することで二次元空間に奥行きを作ったりと、より直感的な表現が可能になりました。

2020年頃には「ニューモフィズム」という「スキューモフィズム」と「マテリアルデザイン」の組み合わせのようなデザインがトレンドになりました。

このように時代やWebサイトを閲覧するデバイスの変化によって、Webデザインは進化を続けています。巨大ITベンチャーが先導して新たな流れを生み出し、業界標準を作ることもあります。このデザインの潮流をうまく見定め、その時代、利用場面に最適なデザインをできる素養を身につけておきましょう。

ここまでWebデザインの歴史を見てきました。現代はノートPC、タブレット、スマホ、ウェアラブル端末。最近ではARやVRなど仮想空間でのブラウジングもできるようになってきています。そんな社会でこれからWebデザインをするにおいて、どのようなデザイン指針を取るべきか少しでも参考になればよかったです。

7-5-2　応用手書きメモ
それではWebデザインを始めていきましょう。まずは、サイトマップ作成の際に使った「簡単手書きメモ」を用意してください。ここに、さらに詳細を書き込んでイメージを膨らましていきましょう。

キャッチコピーはどのくらいのサイズでどこに表示するか。ヘッダーにはどのようなボタンを作るか。テキストはどこに、どう表示するか。カラム割りはどうするか。素材をどのように配置するか。まずは手書きでどんどんイメージを膨らませましょう。鉛筆と紙は気軽に何度でも書き直せるので最強のツールです。

またアニメーションを入れる場合や、マテリアルデザインの発想のもと、ボタンやカードに何か動きをつけるのであればそういったアイデアもどんどんメモしていきましょう。

7-5-3　ワイヤーフレーム作成
応用手書きメモがある程度できたら、ワイヤーフレームを作成していきましょう。ワイヤーフレームとは、サイトマップにデザイン性を追加した、いわばWeb制作の設計図です。Webページのレイアウトを実際のディスプレイにプレビューすることで、デザインの良し悪しを検討することができます。また、コーディングする際に気まぐれでの追加、削除を防ぐことができ、一貫性を持ったWebサイトを作るうえでは欠かせない作業です。

応用手書きメモの状態もワイヤーフレームと呼ぶことがあります。ワイヤーフレームの目的はページレイアウトを定めることですのでここをプロジェクトのディレクターが担当し、細かいデザインの詳細まで決定することはWebデザイナーの仕事として分担されることが多いです。

しかし、ここでは個人での制作を想定しているため、ワイヤーフレーム作成ツールを使って実際に素材などを用いたページレイアウトを作成することと、デザイン作成ツールを用いてページのデザインをしてしまうことを連続して行っていきます。

ワイヤーフレーム作成ツールとしてはAdobe XDが有名です。他にもSketch、Cacooを筆頭にたくさんツールがあるので、調べてみてください。

デザインツールとしては一般にAdobe Photoshopなどが利用されます。他にはAdobe Illustratorなど。世の中にはWEBデザイナーがたくさんいるので、一度検索してみて、おすすめのツールなどを選ぶと良いでしょう。

7-5-4　認知心理学
UX・UIをはじめとするデザインなどの資料、書籍でよく紹介されている学問です。知覚、理解、記憶、思考、学習、推論、問題解決など、さまざまな人間の高次認知機能を研究対象としていて、脳科学、神経科学、神経心理学、情報科学、言語学、人工知能、計算機科学などと密接に関わっており、認知科学とも呼ばれます。より本能的に、直感的にデバイスやソフトウェアを操作するためにUI設計などにおいて、重視されます。

配色や図形の形、大きさ、配置などさまざまな要素を用いて非言語的に作成者の意図を伝えることなどを可能にするヒントにもなるので、ぜひ時間のある時に調べてみて欲しいです。CLOTOとしても関連するコンテンツを上げていこうと考えているので楽しみにしていてください！

7-5-5　配色
配色はWebデザインの中でもかなり重要な要素ですのであえて項を設けました。

色について学んでいきましょう。色は三つの属性から成っています。それは

色相
明度
彩度
です。色相は色の種類です。明度は色の明るさ。彩度は色の鮮やかさです。この3属性によって多くの色を作ることが可能です。まずはこの基本を抑えましょう。画像編集ソフトなどでは、この3属性を調整して、画像データの持つ色を編集することが可能です。

PCやモニター、スマホなどのディスプレイでは光の三原色(Red, Green, Blue)を用いたRGB(加法混色)法で様々な色を表現しています。色を重ねるとどんどん白くなっていきます。#f6bf00 のように16進数で色を表現する方法です。

赤青緑などの色相に属する色を「有彩色」と言います。一方で白灰黒などの色味のないものを「無彩色」と言います。

目に見える色は光の波長です。この波長の違いによって、色が変わっているわけです。色はエネルギーを持っており、それを知ってか知らずか人間は文化ごとに多少の差異はあれど、たいてい色に意味合いを求めてきました。つまり色にはすでにある程度のイメージがついており、それらをうまく使うことで、より効果的に非言語コミュニケーションを行うことができるのです。

信号などはまさにそうですね。赤や黄色は危険や禁止、注意を表す色として広く認知されています。信号が先なのか、色のイメージが先なのか、正確にはわかりませんが、現代社会においてすでにそのようなイメージで認知されていることは間違いがないでしょう。

また、寒色と暖色といったように色は温度的イメージ、同時に心理的イメージも持ち合わせます。また彩度が低い色にはどこか寂しさをも覚えます。

Web制作に限って言えば、赤い色は、警告やエラーの表示、あるいはどうしてもみてほしい重要な箇所を指し示す際に利用します。緑色は、成功を表す色として捉えられています。スイッチのオン/オフも赤と緑で表現することが多いです。このようにWebデザインにおける慣習のようなものもあります。

Webサイト全体の色合いに秩序と意味を持たせることも重要です。プロジェクトの軸と雰囲気に合った色を選びましょう。ロゴなどがある場合はその色を基調としてもう2色ほどアクセントカラーを用いてもいいかもしれません。あるいは素材の色をアクセントカラーにしてもいいでしょう。ヘッダーフッターの色、背景色、ボタンの色、フォントカラーなど全てに調和をもたらす必要があります。同時に色の使い過ぎにも気をつけなくてはなりません。

色の組み合わせや色の持つイメージについても深い理解を持つことが重要です。Webデザイン集やWebデザインの教材、配色などで調べることでより理解が深まります。ぜひ取り組んでみましょう。

また、これはかなり玄人向けですが、色覚異常の方へ配慮した配色なども学習するとより一層成長できますよ。

7-5-6　おすすめWebデザイン集
Class5で一度紹介したので以下に再掲するにとどめておきます。見本となるデザインばかりですので日頃から積極的に見て、デザインの引き出しを増やしていきましょう。

I/O 3000
国内外を問わず、Web制作の参考となるサイトをセレクトしてるWebデザインギャラリーサイトです。カテゴリやタグ、色などで絞り込みができます。また作成年度ごとに絞り込みができる点が非常に興味深いです。10年前のWebデザインはトップページに文字が多く、カラム割りが多いように見えたりと、時代の変遷によるWebサイトの流行りを学ぶこともできます。https://io3000.com

bookma!
Webデザインに特化したブックマークサイトです。主に日本のWebサイトがブックマークされています。色、フォント、雰囲気、さまざまなジャンルのWebサイトが表示されており、アイデアの幅を広げるにはもってこいのサイトです。https://bookma.torch.blue

81-web.com
日本の優れたWebデザインを集めたギャラリーとリンク集です。PC用とスマホ用の二つのデザインに対応しています。トップページがたくさん表示されており、Web制作においてトップページの第一印象、素材の重要性がよくわかります。https://81-web.com

Responsive Web Design JP
日本国内の秀逸なレスポンシブWebデザインのサイトを集めたリンク集です。端末やWebブラウザのウィンドウサイズごとに表示を変える「レスポンシブデザイン」で秀逸なものが集められています。モバイル端末が普及し、「Webブラウジングはスマホで」という人も増えている現在において、レスポンシブデザインはWeb制作の工程の中でも重要度を増しています。https://responsive-jp.com

awwwards.
英語ベースのWebデザイン集です。日本語のものとかなりイメージが変わるので、注意が必要ですが、エキセントリックなデザインも多く構成を学ぶ上では刺激的で面白いかもしれません。各国のデザインなーが評価軸ごとに採点しているのも面白いポイントです。高評価されているサイトから学ぶことは多いと思うので是非見てみてください。https://www.awwwards.com

7-6-0　素材の編集
Web制作において素材の果たす役割は非常に大きいです。キャッチコピーと同様に、視覚情報に直接訴えかけるフォントと画像素材は特に重要です。ここではフォントの選択と画像素材の編集について学習しましょう。

7-6-1　フォント
フォントをただの飾り文字と思ってはいけません。色同様に、利用局面によっては大きく印象に関わります。フォントの歴史は、カリグラフィーに遡ります。西洋や中東などで文字を美しく見せるために生まれた手法です。日本の書道などの毛筆文化圏とは少し異なります。活字が生まれると、同じサイズ、同じ書体デザインの活字セットが用意されるようになりました。セリフ体やサンセリフ体、コントラスト書体をはじめとする多くの活字フォントが生まれました。これにより、活字でも手書き同様に文面に抑揚をつけたり、格式を持たせたり、あるいはフレンドリーで読みやすい印象を与えたりすることができるようになりました。

これがコンピュータ画面でのテキスト表示に応用されたものがデジタルフォントです。OSに標準搭載されているものもありますし、Illustratorなどベクター画像編集ソフトを用いて世界中の人が作ったフォントをダウンロードして利用することもできます。

日本語フォントでは毛筆の草書、楷書や、明朝体などのベースに西洋の活字フォントの要素を組み込んで様々なフォントが生まれました。近年では手書きフォンとなどもありその種類は年々増加しています。

スティーブ・ジョブズも大学時代、専攻そっちのけでカリグラフィーの講義に熱中したといいます。それはMacintoshでの豊富な活字フォントの実装に結実します。MacOSに標準搭載のフォントが多いのはそのためです。

ヒラギノフォントなどは、MacOS、iOSなどに標準搭載されていますが、WindowsOSには搭載されていません。そのため、ヒラギノフォントを使用したデータは埋め込んでいない限り、勝手に類似した書体に変換されてしまうことがあります。このようにOSごとに表示が変わってしまうことがあることもあらかじめ知っておくと良いでしょう。

フォントの種類と、サイズ、カラーをうまく調整することで、様々な表現をすることができます。ゴシック体で大きめの文字で、原色を使って短い単語を表記すると力強い印象を与えることができます。教科書体は本文を書くのに適しています。明朝体はゴシック体などに比べて格式高い印象を作ることもできます。

フォントもプロジェクトの軸と雰囲気、キャッチコピーを鑑みて最高のバランスで用いましょう。

7-6-2　Font Awesome
FontAwesomeはWeb上で表示されるアイコンをWebフォントにしたサービスです。HTMLの<head>内にリンクを読み込むことで利用可能になります。

本来SNSのアイコンや、絵文字や記号などを利用した際は、公式の画像データ用意して規定内で編集して利用する必要がありました。FontAwesomeを使うことで、これらをWebフォントとして利用できるようになります。CSSでサイズや色を簡単に変更することも可能です。非常に便利ですのでどんどん活用していきましょう。

7-6-3　画像素材の編集
切り抜き方、彩度、明度、透明度。これらが違えば、同じ動画素材でも全く違う印象を与えることになります。極端な例でいえば、カラー写真とモノクロ写真があります。被写体が全く同じでも、全く違う印象です。モノクロには過去のイメージや失われてしまったものの印象があります。ある意味懐かしさもあります。使い方によってはハイセンスな印象を与えることもできます。

切り抜き方でもイメージは大きく変わります。画角いっぱいに被写体が写っているものと、真ん中に小さく写っているものとでは迫力がまるで違いますし、メッセージ性も変わってきます。

透明度を上げてキャッチコピーの背景に入れることで、コピーの持つイメージをさらに強調したり、可読性を上げることができます。

編集にはAdobe PhotoshopやAdobe Lightroomなどを使うことが一般的なようです。これらは高機能ですが有料のソフトウェアとなっています。無料でも素晴らしいソフト、アプリもあるので調べてみましょう。

7-7-0　レスポンシブデザイン
Webデザインの歴史でも触れた通り、iPhoneの登場により、Webデザインのあり方は大きく変わりました。一つのウェブサイトで画面サイズに応じてデザインを変更させる「レスポンシブデザイン」にも留意しましょう。デスクトップPCサイズ、ノートPCタイプ、タブレットサイズ、スマホサイズなどジャンルも増えましたし、画面サイズの種類も増えました。一般には、ノートPCサイズとスマホサイズの二種類を用意すれば十分でしょう。

Webデザインの段階からノートPCサイズとスマホサイズの二種類をデザインしましょう。PCサイズでは情報を横に２カラム分掲載しているものをスマホサイズでは1カラムに変更したり、ヘッダーのデザインやメニューバーの位置を変更したりする必要があります。

ワイヤーフレームツールを利用すれば、デバイスごとのサイズでプレビューすることもできるものがあり、大変便利です。ぜひ試してみてください。



        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>
=======
    <!-- コンテンツ1 -->
    <h2 class="text-h4 font-weight-bold">
      <span>ダミー1</span>
    </h2>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">
        ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
      </p>
      <p>ダミー</p>
    </v-container>
>>>>>>> ed70e3e109620bb240e1574f36f280729b2bab3f

    <!-- コンテンツ2 -->
    <h3 class="text-h4 font-weight-bold">
      <span>ダミー2</span>
    </h3>
    <v-container fluid>
      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '1.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>

      <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
      <v-row>
        <v-col cols="6">
          <p class="mb-8">ダミー</p>
        </v-col>
        <v-col cols="6">
          <v-img max-width="90%" max-height="60vh" :src="filePath + '2.png'" class="mb-10"></v-img>
        </v-col>
      </v-row>
    </v-container>

    <!-- コンテンツ3 -->
    <h4 class="text-h4 font-weight-bold">
      <span>ダミー3</span>
    </h4>
    <v-container fluid>
      <p class="mb-8">ダミー</p>
      <p class="mb-8">ダミー</p>
      <p>ダミー</p>
    </v-container>

    <v-row justify="center" class="mb-4">
      <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ7', // コンテンツタイトル
      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
