<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        [プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード] 6-0-0　Class6
        Class6ではお題に沿っていよいよ初制作を行なっていきます。まずは真似ることから始めても構いません。他の学習者の作品を見たり、インターネットから探したりして発想を得ましょう。
        6-0-0　Class6 6-1-0　初制作のすゝめ 6-2-0　「自己紹介HP」を創る
        6-2-1　「自己紹介HP」制作における必須項目 6-2-2　テーマを決める 6-2-3　ページ構成を考える
        6-2-4　ページごとに載せる情報を考える 6-2-5　各ページの雰囲気を考える
        6-2-6　配置などを手書きする 6-2-7　素材を用意する 6-2-8　コーディングする
        6-3-0　フレームワーク利用のすゝめ 6-4-0　Webページ公開のすゝめ 6-4-1　GitHub Pages
        6-1-0　初制作のすゝめ
        いよいよ１から全ての制作フローを経て、一つのWebサイトを作る段階に来ました。[プログラミングで「伝える」コース]という名の通り、Web制作は「伝えたいこと」をインターネットを通じて伝えるための手段です。ここを再度押さえておきましょう。
        この事実からどのようなことがわかるかというとWeb制作で一番重要なことはコーディングではないということです。
        元も子もない話のような気がしますがそういうわけではありません。もちろんコーディングも重要です。Class3以降実際にHTMLやCSS、JavaScriptやフレームワークについて学習してきましたが、それらは「伝えたいこと」を効果的に表現するための具体的手法なのです。
        Web制作では実際にコードを書き始める前に、 伝えたいことは何か どのように表現し、伝えるか
        デザインはどうするのか イラストや写真、動画などは何を使うか どのようなWebサイトにするのか
        を決める必要があります。この見通しが全て立ったらやっとコーディングです。どんなに簡単に思える制作目標であっても、間違ってもコーディングありきで、突然始めるようなことは実践的ではないのでやめましょう。
        実務でのWeb制作の現場でも、依頼主が何を伝えようとしているのか、綿密に打ち合わせをすることから始めます。伝えたいこと、キャッチコピー、素材、サイトの雰囲気、操作性、外部との繋がり。あるいはここに分析ツールを埋め込んで閲覧行動の分析を可能にしたり、お問い合わせフォームを入れるなどのニーズにも答えていく必要があります。この仕様をしっかりと確定させることこそがWeb制作で一番重要なことです。ここに価値があるのです。コーディングするだけでは、全ての指示がないと制作できない状態になってしまいます。
        トータルでWeb制作を行える力を身につけていきましょう。
        CLOTOには言語ごとにコミュニティという自習室が設けられています。Class6以降はこれまで以上に積極的に、コミュニティを利用しましょう。検索してもわからないことはコミュニティのチャット欄で質問してみましょう。タイムラインに流してもいいでしょう。これまで以上に調べること、すぐアウトプットしていくことが重要です。逆に質問されたら、いいアウトプット機会と捉えて回答してあげましょう。もし、質問が分からなければこそっと調べることで自分のインプット学習にもなります。
        6-2-0　「自己紹介HP」を創る
        Class6では一律に「自己紹介」のWebページを創ってみましょう。チュートリアル学習、参考書学習、模写学習で学んだことを活かしながら、自分を表現しましょう。今回の伝えたいことは「あなた自身について」です。あなたの特徴、良いところを余すことなく伝えましょう。表現方法は自由です。Class5で見てきたWebデザイン集から着想を得ることも重要でしょう。当然本名である必要もありません。ハンドルネームで構いませんし、情報が全て真実である必要もありません。
        このコースに取り組む学習者がこの「自己紹介」ホームページ制作に取り掛かります。是非素敵なWebページに仕上げてください。
        6-2-1　「自己紹介」HP制作における必須項目 必須項目は以下の通りです。 プロフィール写真
        名前（ハンドルネーム可能） SNSリンク ヘッダー・ボディ・フッターからなるページを2ページ以上
        ボタン 二種類以上のフォント JavaScriptを用いた「お問い合わせフォーム」 6-2-2　テーマを決める
        まずテーマを定めましょう。もちろん今回のテーマは「自己紹介」なのですが、より細かく決めていきましょう。
        自分のどんな点をピックアップして伝えるのか。
        例えば「明るくてアウトドアが大好きな自分」なのか。「クールでインテリジェンスな雰囲気を醸し出す自分」なのか。「趣味に全てを捧げる自分」なのか。
        まずはこのように一連の制作活動全てに関わる根幹となるテーマをしっかりと言語化しましょう。Webページは基本的に、固定されており、また視覚情報に頼られます。日常会話以上に論理的で、主張が一貫されている必要があります。しっかりと最初に言語化しておきましょう。
        「旅行が大好きな大学生の青年」と「起業家として新しい価値を問う30歳の男性」ではWebページでの表現の仕方はまるで違うはずです。自分という人間を、どのような人間と捉え、どう伝えていくか。
        じっくりと考えてみましょう。 6-2-3　ページ構成を考える
        「伝えたいこと」であるテーマを決めることができれば、次は実際にページ構成を考えていきましょう。ページは何枚用意して、それぞれのページにどのようなメッセージを持たせるのか。これの概要を定めていきましょう。
        特別なツールを使う必要は全くありません。裏紙やノートと鉛筆があれば十分。先ほど考えたテーマを念頭に、要素を分解していきましょう。
        ホームページはどうするか。ホームの他にはどのような情報を載せるページを作りましょうか。日々の活動報告、趣味、経歴などなど。
        Class6では２〜３ページ程度作りましょう。 6-2-4　ページごとに載せる情報を考える
        ページ割りが決まれば、次はページごとに載せる情報を考えていきましょう。全てを載せることはナンセンスです。
        1ページでテーマは一つに絞りましょう。読み進めるにしたがって次から次へと違う内容が出てくると、非常に読みにくいサイトになります。「伝えたいこと」もブレてしまい、支離滅裂な文章、構成になってしまうので気をつけましょう。
        こちらも紙と鉛筆を持って、ページごとに書きたいことの概要をメモしましょう。
        6-2-5　各ページの雰囲気を考える
        各ページごとにテーマからブレない程度に雰囲気をつけていきましょう。ページしたときに心奪われるような、ワクワクするような閲覧体験を作りましょう。特に今回のお題は「自己紹介」ですので、ページごとに少し違った雰囲気で、色々な面を表現してもいいかもしれません。
        6-2-6　配置などを手書きする
        ページ構成、ページごとの情報、雰囲気が決まったら、今度は各ページのレイアウト、配置を定めていきましょう。Web制作では効果的な写真、アニメーション、フォント、配色など、さまざまな方法で「伝えたいこと」を表現します。どのような写真や文字、文章をどこに配置するのか。概要を定めましょう。
        これも紙と鉛筆で全く問題ありません。まずはページの構成を決めましょう。手書きでささっとキャッチコピーのエリアやテキストのエリア、画像のエリアなどをメモをします。そこから徐々に細かく、テキストはどのような内容にするか。画像はどのような素材をどう使うかを決めていきましょう。Webページは、デバイスのディスプレイという限られた空間に表現しなくてはなりません。ここに適切な情報を適切な箇所に配置していく必要があります。Class5で紹介したWebデザイン集などを参考にしながら
        最近ではAdobeXDやFigmaなどの、非常に便利なUIデザインツールがあります。大変便利で高性能なものですがこれを使うにもやはり最初は手書きのメモに勝るものはないでしょう。Class7以降では、より詳細部分を具体的に検討する際や、コーディングに踏み切る前、プレビューする場合などに積極的な利用を推奨します。
        6-2-7　素材を用意する
        ここまでいかがだったでしょうか。これから作ろうとしている自己紹介Webサイトのイメージはできたでしょうか。イメージができたら、自己紹介HPで使用しようと考えている画像を用意しましょう。画像が用意できたら必要な加工を施す必要があります。画像サイズ、切り抜き、彩度、透明度など、必要な状態に加工してみましょう。
        Adobe
        PhotoshopやIllustratorといった、有名な有料の画像編集ソフトもありますし、最近では無料でも高品質のものも増えています。Microsoft
        OfficeのPowerPointなども簡単な画像編集はできるので使ってみてもいいでしょう。スマートフォンなどで編集できるアプリケーションもあるのでいろ色検索をかけたり、調べたりする必要があるでしょう。
        6-2-8　コーディングする
        ページ構成や、テキストの内容、レイアウトの決定や素材の準備などのWeb制作の準備ができたらいよいよコーディングです。Class3〜Class5で学習してきたことを活かして実際にコードを書いていきましょう。ぜひ自己紹介HPにおける必須項目を入れてみてください。
        まずはHTMLとCSSを用いてある程度の自己紹介ページ静的な部分の骨格や体裁を整えていきましょう。それが出来上がってきたら、JavaScriptで動きをつけていきましょう。必須項目にある　JavaScriptを用いた「お問い合わせフォーム」　の作成では閲覧者がフォームに記述したデータをサイト運営者が受け取れる仕組みを作りましょう。
        わからないことは検索と質問を使い分けながら、すぐに調べましょう。キリの良い所でカルテを書いて、実際にコーディングや調べ物をしていく過程で学んだことの記録をつけることも忘れずに継続しましょう。
        他の学習者にアドバイスをもらったり、[プログラミングで「伝える」コース]のClass6を終えている学習者のカルテを参考にしても良いでしょう。
        6-3-0　フレームワーク利用のすゝめ
        Class4で学習したフレームワーク。写真などをテキストと一緒に効果的に表示する際など、フレームワークは非常に便利です。Class6ではフレームワークをあなたの表現の幅を広げるものと好意的に捉えてつけるものは使っていきましょう。
        しかしここはあくまで学習過程。用意されたフレームワークをそのまま使うだけでは芸がありません。しっかりと自分の思い描いていたWebページの雰囲気、構成に合うようにアレンジするなどして活かしていきましょう。
        6-4-0　Webページ公開のすゝめ
        初のWeb制作はいかがでしょうか。実際に思い描いていたものや「伝えたいこと」がWebブラウザ上に表示されれば、面白く思えてきたのではないでしょうか。
        実際に「自己紹介HP」の制作ができれば、実際にそれをインターネット上に公開してみましょう。これまでは自分のPCの中でファイルにコーディングしていく、いわゆる「ローカル環境でのWeb制作」をしてきました。これをインターネット上に公開すればURLリンクなどを発行することで、実際に多くの人にWebサイトをみてもらうことができます。
        ローカル環境で制作したWebサイトのファイルはサーバへ保存することでインターネット上からアクセスできるようになります。
        Class6では「自己紹介HP」の制作が課題でした。ここではローカル環境での制作ができれば良いのでWebページを公開することは強制ではありません。もし公開してみてもいいと思える方は、載せてはいけない情報がないか確認した上で、良い学習機会になると思うので是非チャレンジしてみてください。
        完成したWebサイトを公開した場合はURLを、そうでない場合は完成したWebサイトのスクリーンショットの公開することを以てClass6の完了とします。
        6-4-1　GitHub Pages 最も簡単なWebページの公開方法の一つとして、GitHub
        Pagesを紹介します。GitHub
        PagesはGitHubがユーザーに提供している静的Webページのためのウェブホスティングサービスです。ウェブホスティングサービスとはいわばレンタルサーバです。ユーザーのブログやプロジェクトのドキュメントを公開することができます。
        GitHub
        Pagesは静的なWebサイトで利用することができます。HTMLやCSS、JavaScriptで構成されているようなWebサイトの公開には最適のツールの一つですので、是非調べて活用してみてください。

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center" class="mb-4">
          <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ6', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
