<!-- 画像が必要な時 -->
<!-- <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row> -->
<template>
  <v-container class="mt-4" fluid id="content-container">
    <v-row>
      <!-- 目次 -->
      <ContentTable :period="period" :contents="contents" />

      <v-col cols="8">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
        </div>

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="greeting">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">Greeting</span>
          </h4>

          <p class="mb-8">ようこそCLOTOへ。</p>

          <p class="mb-8">
            この文章をご覧になっているみなさんは、おそらく「プログラミングを学習したい」と思われていることと思います。
          </p>
          <p class="mb-8">
            さて、この「プログラミングの学習」ですが、目標には何を置くべきでしょうか。<br />
            就職？転職？フリーランス？それとも趣味？研究？
            ある意味では全て正しいのではないでしょうか。
          </p>
          <p class="mb-8">
            みなさんそれぞれに、何かの目的があってプログラミング学習を始められたこと思います。<br />
            実際に世の中に普及し始めたプログラミング学習支援サービスのほとんどが、<br />
            上記のような目標に向かってカリキュラムを組んでいます。
          </p>
          <p class="mb-8">
            CLOTOもこうした目標を持つ学習者を支援できる環境でありたいと考えています。
          </p>
          <p class="mb-8">一方でこうも考えます。</p>
          <p class="mb-8 font-weight-bolder">
            「それはプログラミング学習の目標として最適なのか。」
          </p>
          <p class="mb-8">
            プログラミング学習の直接的な目標＝ゴールはエンジニア就職を果たすことでしょうか。<br />転職して収入を上げることでしょうか。研究成果を出すことでしょうか。
          </p>
          <p class="mb-8">
            もちろん間接的に、プログラミング学習を進めた先に、そのような体験が待っていることは間違いありません。<br />また強い動機になり得るので重要です。
          </p>
          <p class="mb-8">
            しかしそれはあくまで学習する目的、動機の一つではないでしょうか。<br />
            エンジニア転職を成功させることこそがプログラミング学習のゴールと言えるでしょうか。<br />
            新卒の見込み採用で、エンジニア就職した人にはプログラミング学習は不要でしょうか。
          </p>

          <p class="mb-8">
            新卒の見込み採用で、エンジニア就職した人にはプログラミング学習は不要でしょうか。 <br />
            これはエンジニアに限ったことではありませんが、<br />特にIT業界は技術の変化が速い領域ですのでエンジニア自身にも常に学び続ける姿勢が求められます。
          </p>
          <p class="mb-8">
            つまり、プログラミング学習のゴールは、<br />本来的に就職、転職、案件獲得、と言った人生における区切りとは直接関係のないものなのです。
          </p>
          <p class="mb-8">
            CLOTOはこの「プログラミング学習の目標は何か」という本質的な問いに対する答えとして<br />
          </p>
          <p class="mb-8 font-weight-bolder">
            「プログラミングを駆使し、新たな価値を創り続けることができるようになること」
          </p>
          <p class="mb-8">
            というものを提唱します。<br />
            何かを「創る」体験を、学習を通じて得る必要があると考えています。
          </p>

          <p class="mb-8">みなさんのプログラミング学習が実りあるものになることを願っています。</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="programming-setting">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">プログラミングを取り巻く環境</span>
          </h4>

          <p class="mb-8">
            21世紀に入り、プログラミングは人間社会のほぼ全ての領域に影響を及ぼす存在になりました。
          </p>
          <p class="mb-8">
            現在みなさんがこの記事をご覧になっているPCも、スマートフォンも、<br />そこに映るWebサイトやアプリケーションもプログラミングによって動作しています。
          </p>
          <p class="mb-8">
            一見プログラミングとは無関係に見える製造業やサービス業などでも、膨大なデータを分析し、<br />
            サービスを向上させている要因の一つには、やはりプログラミングがあります。<br />
            このように、プログラミングは現代社会の幅広い分野に影響を及ぼしており、もはや必須の存在になりました。
          </p>
          <p class="mb-8">
            かつては日本企業が牽引していた、精密機械の時代も、昨今の米中の巨大IT企業の台頭によって過去のものとなりました。<br />
            21世紀はソフトウェアで溢れる世の中です。
          </p>

          <p class="mb-8 font-weight-bolder">
            しかし、日本ではそのようなモノの開発に携わるITエンジニア不足が深刻化しています。
          </p>
          <p>
            エンジニア不足は一つの産業の停滞では済まず、先に述べた影響の大きさから、<br />国家の成長にとっても由々しき事態であると言えます。<br />
            このような国際的、国家的な動きの中でプログラミングはここ数年で大きく注目されている学習領域の一つです。
          </p>
          <p class="mb-8">
            そして、ITエンジニアを増やすことが国際競争力に直結するような時代において、その重要度は日に日に増しています。<br />
            欧米諸国に遅れて、義務教育におけるプログラミング学習の必修化もようやく始まりました。<br />
            今後社会に出てくる若者たちは、プログラミングというものを私たちより遥かに身近に感じていくことでしょう。
          </p>

          <p class="mb-8">
            そういった社会の中で活躍し続けることができる人材とはどのような人間、どのようなエンジニアなのでしょうか。それこそが先に述べた、
          </p>
          <p class="mb-8 font-weight-bolder">
            「プログラミングを駆使し、新たな価値を創り続けることができる」エンジニア
          </p>
          <p class="mb-8">
            ではないでしょうか。<br />
            そして、プログラミングそのものを、目的ではなく、創作活動の一手段として捉える観点から考えると、<br />
            スキルや幅広い視野や発想、創造力、社会性など、これまで以上に総合的な力が求められるでしょう。
          </p>
          <p class="mb-8">
            今、プログラミング学習を学び始めることは非常に意義のあることです。<br />
            幸いなことに学び始める年齢や前職、これまでの文系理系といった価値観もあまり関係ありません。
          </p>
          <p class="mb-8 font-weight-bolder">
            今、この時が、プログラミング学習を始める最良のタイミングです！
          </p>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cloto-desc">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">CLOTO</span>
          </h4>

          <p class="mb-8 font-weight-bolder">
            CLOTOは「プログラミング独学者のためバーチャル学習施設」です。
          </p>
          <p class="mb-8">
            CLOTOは「プログラミングを駆使し、新たな価値を創り続けることができるようになること」を全体の目標とし、<br />
            それまでの道のりを以下のように分類しています。
          </p>
          <ol class="mb-8">
            <li>「素人期」…プログラミングを学ぼうと志して、プログラミングについて知る期間</li>
            <li>「苦労人前期」…実際に学習を本格化させ、一定レベルのスキル習得を目指す期間</li>
            <li>「苦労人後期」…身につけたスキルを元に、自分独自の成果物を「創る」期間</li>
            <li>「玄人」…実際に新しい価値を「創る」ことができるようになった人のこと</li>
          </ol>
          <p class="mb-8">
            このように段階を定義し、「玄人」を目指す学習環境がCLOTOです。<br />
            CLOTOではあくまで学習者各自の「独学」を主とし、その過程で必要な情報や環境が用意されています。<br />
            上手に使いこなし、「玄人エンジニア」になりましょう！
          </p>
        </v-container>

        <!-- コンテンツ４ -->
        <v-container fluid class="mb-12" id="alone">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">独学のすゝめ</span>
          </h4>

          <p class="mb-8">
            プログラミング学習の目標を「プログラミングを駆使し、新たな価値を創り続けることができるようになること」と位置付けました。<br />
            ではどうすれば新しい価値を創れるエンジニア、「玄人」になれるのでしょうか。
          </p>
          <p class="mb-8 font-weight-bolder">
            そのための手段としてCLOTOは「独学」を推奨しています。
          </p>
          <p class="mb-8">
            これまでのプログラミング学習では、一定のスキルを短期間で習得することを目指して設計されたものが多く、<br />
            エンジニアにとって最も重要な「自ら創意工夫すること」や「苦悩しながらも学び続けること」は各自の努力に委ねられていました。<br />
            つまり、どのような方法で学習していても、<br />
            最終的に、エンジニアとして必要な力を身につけるためには「独学」が必要になるのです。
          </p>
          <p class="mb-8">
            また、プログラミング学習は基本的には現段階において誰からも強いられるものではありません。<br />
            自ら選んで取り組まない限り、プログラミング学習をする必要性はないのです。<br />
            つまり、元来、「独学」的要素を多分に含んでいるのです。
          </p>

          <p class="mb-8 font-weight-bolder">
            しかし、これこそがプログラミング学習が難しい最大の理由なのです。
          </p>
          <p class="mb-8">
            あなたが学習をやめようと思えば、誰にも遠慮することなく、学習から離れることができる。<br />
            英語や数学のようにできないからと言って親に叱られることもありません。<br />
            こういった中で、自分を律し続け、学び続けなくては、「玄人」になることはできません。
          </p>

          <p class="mb-8">
            まずは、プログラミング学習が本来的に「独学」であるということ。<br />
            そしてそれが非常に難しいということを認識しなくてはなりません。<br />
            この続けることの難しさを踏まえた上でこれらに挑んでいく必要があります。<br />
            また継続的な学習のために、それらの体験は楽しくなくてはなりません。
          </p>

          <p>この「プログラミング独学」を充実させる要素は大きく分けて以下の三つです。</p>
          <ol class="mb-8">
            <li>インプットだけでなく、必ずアウトプットをする。</li>
            <li>自己及び学習管理の徹底</li>
            <li>視野を広げる積極的な交流の推奨</li>
          </ol>

          <p class="mb-8">
            これから体系的に一生使える「プログラミング独学」法を学んでいきましょう！
          </p>
        </v-container>

        <!-- コンテンツ５ -->
        <v-container fluid class="mb-12" id="output-ism">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">アウトプット至上主義</span>
          </h4>

          <p class="mb-8">
            第一に「プログラミング独学」を充実させる要素の一つとして「インプットだけでなく、必ずアウトプットをする。」ことをあげました。
          </p>
          <p class="mb-8 font-weight-bolder">
            プログラミング学習では、アウトプットこそが一番重要と言っても過言ではありません。
          </p>
          <p class="mb-8">
            プログラミングは何かを創るための手段です。<br />
            つまり、プログラミングについての知識をいくら集めたところで、何にもならないのです。<br />
            情報を集めることはもちろん重要です。<br />
            ですがそれ以上に実際に手を動かし、コーディングすること。それらを公開すること。<br />
            これが重要になります。
          </p>

          <p class="mb-8">また、アウトプットにも様々な種類があります。</p>
          <ul class="mb-8">
            <li>インプットしたことをすぐに実践して都度公開すること</li>
            <li>知識を利用して誰かに教えてあげること</li>
            <li>実際に製品やサービスをつくること</li>
          </ul>
          などがあります。
          <p class="mb-8">
            CLOTOではこれらのアウトプットをスムーズに行うことができる環境を整備していきます。
          </p>
        </v-container>

        <!-- コンテンツ６ -->
        <v-container fluid class="mb-12" id="self-management">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">自己及び学習管理の徹底</span>
          </h4>

          <p class="mb-8">
            第二に「プログラミング独学」を充実させる要素の一つとして「自己管理、学習管理の徹底」をあげました。
          </p>

          <p class="mb-8">
            まず自己管理ですが、プログラミング独学は腰を据えてどっしりと学習できる環境が重要です。<br />
            何かに追われたり、焦ったりしているような状況はできるだけ回避し、余裕を持ってどっぷりと学習に向かいたいものです。<br />
            些細なことでモチベーションが下がってしまう独学においてこれらの環境を整えることは、何よりも重要かもしれません。
          </p>

          <p class="mb-8">自己管理には大きく三要素あります。それは、</p>
          <p class="mb-8 font-weight-bolder">「金銭」「時間」「体調」です。</p>
          <p class="mb-8">
            このどれか一つでも欠けてしまうと学習にまっすぐ向かえないような心理状況に陥りやすいです。
          </p>

          <p class="mb-8">
            金銭的余裕は心の余裕を生みます。<br />
            これは当然のことなので、日々の生活が厳しいような状況では、学習の質も下がってしまいがちです。<br />
            どうしても余裕がないのであれば、短期集中して貯金をしてから始めるというのも、<br />
            急がば回れ的思考なのかもしれません。
          </p>

          <p class="mb-8">
            時間はさらに重要です。<br />
            特に独学を進めるには、これまでの日常に定期的に学習時間が割り込んできます。<br />
            しっかりと学習時間を確保するために日々の生活を見直し、律することが必要になります。<br />
            この抵抗をできるだけ少なくするメソッドも紹介していくので取り組んでみてください！
          </p>

          <p class="mb-8">
            体調は最も重要かもしれません。<br />
            体調は心理や学習効率にも影響を及ぼしますし、何しろ体調が悪化すると学習を中断せざるを得なくなったり、<br />
            計画倒れの元にもなったりします。<br />
            まずは、規則正しい生活。特に睡眠を重視して健康管理をしていきましょう。<br />
            こちらもどんどん情報発信していくのでご注目ください！
          </p>
        </v-container>

        <!-- コンテンツ7 -->
        <v-container fluid class="mb-12" id="interchange">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">自己及び学習管理の徹底</span>
          </h4>

          <p class="mb-8">
            第三に「プログラミング独学」を充実させる要素の一つとして「視野を広げる積極的な交流の推奨」をあげました。
          </p>

          <p class="mb-8">
            「プログラミング独学」というと、どうしても、独りでの学習のように思われるかもしれません。
          </p>
          <p class="mb-8 font-weight-bolder">
            しかしこれは全くの間違いです。それはあくまで「孤学」であって「独学」とは違うものではないでしょうか。
          </p>

          <p class="mb-8">
            他者との交流は、独学には欠かせません。<br />
            先のアウトプットの重要性にも繋がりますが、プログラミングは創作活動の一つです。<br />
            価値を生む作業なので、その先には必ず人間の存在があります。
          </p>

          <p class="mb-8">
            自分1人の知見には限界があります。<br />
            多くの人からアドバイスやフィードバックを受けたり、情報交換をしたりすることで、成長に拍車がかかりますし、<br />
            どのような製品がユーザーに受け入れられるのかといった「勘」や「センス」を磨くことにもつながります。
          </p>

          <p class="mb-8">
            CLOTOでは他者との交流をなるべくストレスなく行えるように製品設計をしていきます。
            どんどん活用して、爆速で成長していきましょう！
          </p>
        </v-container>

        <!-- コンテンツ8 -->
        <v-container fluid class="mb-12" id="self-optimize">
          <h4 class="text-h4 font-weight-bold text-left-border mb-10">
            <span class="pl-3 grey lighten-3">自己最適化利用の推奨</span>
          </h4>

          <p class="mb-8">
            CLOTOではサービスや情報発信を通じて、「プログラミング独学」環境をより良いものに整備して参りますが、<br />
            その中でも「独学」であるということを強く意識してください。
          </p>

          <p class="mb-8 font-weight-bolder">
            「独学」の最大のメリットの１つとして、「自分好みの学習スタイルにカスタマイズできる」ことがあると思います。
          </p>

          <p class="mb-8">
            自分にとって最適な学習効果が得られるように創意工夫することも重要な力です。<br />
            是非CLOTOを使いこなしてみてください！
          </p>
        </v-container>

        <v-row justify="center">
          <v-btn color="blue" class="text-white" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      period: 'introduction', // 期間名
      title: 'Class 0', // コンテンツタイトル
      contents: [
        { id: '#greeting', title: '0-0. Greeting', activeStart: 0, activeEnd: 1526 },
        {
          id: '#programming-setting',
          title: '0-1. プログラミングを取り巻く環境',
          activeStart: 1526,
          activeEnd: 2461,
        },
        { id: '#cloto-desc', title: '0-2. CLOTO', activeStart: 2461, activeEnd: 2981 },
        { id: '#alone', title: '1-1. 独学のすゝめ', activeStart: 2981, activeEnd: 4213 },
        {
          id: '#output-ism',
          title: '1-2. アウトプット至上主義',
          activeStart: 4213,
          activeEnd: 4867,
        },
        {
          id: '#self-management',
          title: '1-3. 自己及び学習管理の徹底',
          activeStart: 4867,
          activeEnd: 5820,
        },
        {
          id: '#interchange',
          title: '1-4. 視野を広げる積極的な交流',
          activeStart: 5820,
          activeEnd: 5964,
        },
        {
          id: '#self-optimize',
          title: '1-5. 自己最適化利用の推奨',
          activeStart: 5964,
          activeEnd: 99999,
        },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
