<template>
  <v-container fluid class="mt-4">
    <v-row>
      <!-- 目次 -->
      <ContentTable :contents="contents" />

      <v-col cols="8" id="content">
        <!-- タイトル -->
        <div class="mb-4 pa-4">
          <h1 class="text-h4 text-center mb-12">{{ title }}</h1>
          <p class="text-body-2 mx-6">このコンテンツの説明</p>
        </div>

        [プログラミングで「伝える」コース　JavaScriptを軸に学ぶロード] 4-0-0　Class4
        Class4からは「苦労人前期」に入ります。いよいよここからがプログラミング独学の始まりです。インプットとアウトプットを繰り返して頑張っていきましょう！
        Class4では媒体を問わず、専門的な「教材」を用いて本格的な学習を開始していきます。チュートリアル学習からさらに踏み込んで、具体的な文法や、組み合わせなどを学習していきます。この基本パターンをたくさん知っていることで、自分で創る際の発想の源になります。全てを理解することを目標にする必要はありませんが、できるだけ丁寧に学習していきましょう！
        4-0-0　Class4 4-1-0　参考書学習のすゝめ 4-1-1　HTMLの学習 4-1-2　CSSの学習
        4-1-3　Bootstrapの学習 4-1-4　JavaScriptの学習 4-1-5　jQueryの学習 4-2-0　環境を作ろう
        4-2-1　Web制作の開発環境 4-2-2　調べるべきこと 4-3-0　おすすめ教材 4-3-1　参考書
        4-3-2　公式ドキュメント 4-3-3　ドットインストール 4-1-0　参考書学習のすゝめ
        参考書学習の目標は一つの言語に対して、チュートリアル学習から、さらに踏み込んで細かい学習を進めていくことにあります。多くの参考書では、具体的な数値などを用いて基本文法を学習したり、開発を疑似体験するように作られています。
        一つの言語あたり１〜２つほど学習するのが良いでしょう。こちらはあまり時間をかけずに、短期間で取り組んでしまうことが重要です。学習間隔を開けてしまうと、前回学んだ内容を忘れてしまったり、学習開始にかけるエネルギーが多く必要になります。あまり学習効率が良くないので、短期間に集中して取り組んでしまいましょう。
        Web制作を学んでいくこのロードでは、特にJavaScriptを用いたWeb制作の教材が最適でしょう。
        4-1-1　HTMLの学習 HTMLの正式名はHyperText Markup
        Language。テキストを記述するための言語で、Webページの骨格を作るために利用します。現在のバージョンはHTML5です。拡張子は[.html]
        。世界的に主流の規格なので、マークアップ言語はHTMLが扱えれば問題ないでしょう。
        見出し、段落、表、リストなど文書内の各部分を「要素」と呼びます。この要素の構造をコンピュータに伝えるのがマークアップ言語の役割です。要素を記述するための目印を「タグ」と言います。
        HTMLではこの「要素」と「タグ」が理解できればあとは簡単です。具体的な記述方法を学びながら表現の幅を広げていきましょう。
        4-1-2　CSSの学習 CSSの正式名はCascading Style
        Sheets。HTMLの要素をどのように表示、修飾するかを指示するスタイルシートという仕様の一つです。現在のバージョンはCSS
        Level3。拡張子は[.css] 。
        HTML要素にスタイルを加えていくように記述します。スタイルとは、文字サイズ、色、フォント、背景色、要素の配置位置、余白などです。
        CSSでは「セレクタ」「宣言ブロック」「プロパティ」「値」などの言葉が重要になります。教材ではこの仕組みに着目しながら進めていきましょう。
        4-1-3　Bootstrapの学習
        BootstrapとはWebサイトやWebアプリケーションを作成する、Webアプリケーションフレームワークです。
        Class0でも簡単に触れましたが、「フレームワーク」とはソフトウェアフレームワークのことで、アプリケーションなどの実装に必要となる一般的な機能や定型コードを、ライブラリとしてあらかじめ用意したものです。「ライブラリ」とは、汎用性の高い複数のプログラムを利用しやすいようにまとめたものです。ライブラリは他のプログラムになんらかの効果を与えるプログラムの集まりです。一方で、フレームワークとライブラリの明確な区別はありません。一般に、フレームワークはライブラリを複数集めたものや、より体系立って整理されたものというような認識です。フレームワークはシステムの構築に必須な処理に関して、スムーズに実装できるという働きがあります。夜ご飯で例えると、フレームワークもライブラリも使わない場合はお肉屋さんや八百屋さんでの買い物から開始、フレームワークを使う場合は材料があらかじめが用意されており、そこから自分で味付けして調理するイメージ。フレームワークとライブラリを使う場合は、お惣菜コーナーから好きなおかずを選んでくるようなイメージでしょうか。非常に便利ですのでClass4では難しいことは考えずに、とりあえずフレームワークの利用方法を学習すると良いでしょう。
        しかし一方で、複雑な処理の実装や、より独自性を出す際には、やはりフレームワークだけではなく言語を理解した設計が必要になります。あるいは、フレームワークの学習自体に時間がかかるというデメリットや、不必要に導入してしまうことによりプログラムを肥大化させ、挙動が重くなるなどの可能性もあるので、将来的には特徴をしっかりと理解した上で使うことが重要といえます。
        BootstrapはHTML、CSSベースのデザインテンプレートです。文字のデザインや各種フォーム、ボタン、カード、ナビゲーションなどが用意されています。
        <a
          href="https://getbootstrap.jp/docs/5.0/getting-started/introduction"
          target="_blank"
          rel="noopener noreferrer"
        >
          BootstrapのWebページ
        </a>
        には多くのテンプレートが掲載されており、それを記述するためのソースコードが添付されています。あらかじめ、Bootstrapを利用できるように、HTMLの&gt;head&lt;部分に所定の記述をしておくことで、コピーアンドペーストでテンプレートを利用できるようになるという優れものです。数値や色を変えてアレンジすることで応用的な活用もできます。
        Webページの表現の幅が広がるので、ぜひ積極的に利用してみてください。 4-1-4　JavaScriptの学習
        JavaScriptはプログラミング言語です。分類的にはオブジェクト指向スクリプト言語と言われます。よく似た名前の言語として「Java」がありますが、JavaScript誕生の経緯から見ても全く別物の言語と考えて良いでしょう。拡張子は[.js]
        。
        JavaScriptの最大の特徴に「ブラウザ上で動作するプログラミング言語である」というものがあります。これは、「ユーザーがブラウザで行う操作をきっかけに、さまざまな処理を発動することができる」ということです。
        マウスの移動や、クリック、ダブルクリック、ホバー時にそれぞれ処理を変えたり、Webページのページ遷移時に処理を行なったり、といったユーザーのWebページへの操作に対してアクションをつけることができることが最大の特徴です。
        この特徴により、Web制作の場面でJavaScriptは、HTML、CSSで作られたページにアニメーションやそのほか様々な動きをつけることを可能にし、重宝されるのです。
        また、「非同期通信」が可能という特徴もあります。これはサイトを更新、つまりリロードすることなく表示内容を変更できるというものです。普段当たり前に行えていることなので、いまいちピンとこないかも知れませんが、HTML、CSSだけでは、ページに変更を加える際、その都度更新しなくては表示内容が変更されません。JavaScriptで「非同期通信」を行えばすぐに変更結果が表示されるため、ページの更新をよりスムーズに行うことができるようになるのです。
        JavaScriptはその特徴から、主にクライアントサイドで使われるプログラミング言語ですが、近年はNode.jsといった、サーバサイドでのJavaScript実行環境も生まれたことにより、その活躍の幅を広げています。
        また、PCのネイティブアプリケーションやスマホアプリケーションの開発もできるようになっています。
        このように汎用性が高く主流な言語になっているため、学習に必要な情報も豊富で一番最初に学習するにはもってこいのプログラミング言語と言えるでしょう。
        JavaScriptでは、「関数」「引数」「変数」「クラス」といった言葉が非常に重要になってきます。これらに着目しながら学習をしましょう。
        4-1-5　jQueryの学習
        jQueryはJavaScriptの記述をより簡易化するために設計されたJavaScriptのフレームワークです。jQueryはそのコンセプトにもなっているように「より少ない記述で、より多くのことをする」ことを目的に開発されました。JavaScriptでの表現の幅を広げてくれる武器になります。
        jQueryはHTMLを操作するための「DOM操作」、その名の通りの「CSS操作」、「アニメーションとエフェクト」の追加、通信が可能な「Ajax」などの機能を持っています。いずれもJavaScriptを元に作られているものです。ブラウザごとの対応をしなくていいのも特徴です。また、プラグインが多いことも特徴であり、非常に便利ですのでぜひJavaScriptとセットで学習しましょう。
        4-2-0　開発環境を作ろう
        Class3で選んだチュートリアル教材によっては、開発環境が整っている方もいるかと思います。
        一方でチュートリアル学習の段階で、開発環境の用意が必要なかった方（Progateなどで学習された方）は、ぜひこの場でWeb制作に必要な開発環境を作っていきましょう。
        Web制作、特にHTML、CSS、JavaScriptの開発環境の構築は比較的難易度も低いので、あまり難しく考えず取り組んでみましょう。ほとんどの教材で最初の開発環境の準備について記述されているので、その通りやってみましょう。ここでは簡単に概要だけ記載しておきますが、ここも「調べる力」が重要です。基本の「型」を元に、さらに調べてより便利にカスタマイズしたり、自分より早く学習に取り組んでいる人に質問してみることが重要です。プログラミング学習の方法は常に複数の答えがあるものなので、自分のパターン、自分の最適解を見つけていく姿勢が重要です。
        4-2-1　Web制作の開発環境
        Class2でも触れたWeb制作の仕組みを理解できていれば、決して難しいものではありません。
        Web制作で必要な環境は以下です。 Webブラウザ
        ソースコードエディタ（プログラミングのソースコード編集用に最適化されたソフトウェア）。
        Webブラウザは近年の情勢や汎用性の高さからも、Google
        Chromeを推奨しています。Apple社のSafariや、Mozilla社のFirefoxなどでももちろん可能です。
        ソースコードエディタはプログラムを編集するのに最適化されたテキストエディタソフトウェアです。最初はなるべくメジャーなものを利用されることを推奨します。マイクロソフト社の
        Visual Studio Code
        などは有名なソースコードエディタソフトと言えます。とりあえずという方はこちらをインストールすることをお勧めします。
        これはソースコードエディタに限ったことではありませんが、あるツールがメジャーであることには、何か利便性が高いなどの理由があることが多いです。インターネット上にある情報量も多く、何か困った時に検索しやすく、また質問もしやすいです。
        何事も最初は標準の「型」を学習することが良いと思います。 4-2-2　調べるべきこと
        Class4では、教材に乗っ取ってとりあえず開発してみることが良いと思います。HTML、CSS、JavaScriptの「型」を一通り学習しましょう。
        Class4で特に調べるべきことは、 Webの仕組み（Class2で復習） Web制作をする上でのファイル構造
        ソースコードエディタの使い方 Webブラウザの開発者ツール、デバッグツールの使い方
        命名規則などのルール、慣習 です。
        チュートリアル教材で説明を受けるものの、実際に触るとよくわからないものの一つにファイル構造があります。HTMLの.htmlファイルやCSSの.cssファイル、JavaScriptの.jsファイルがそれぞれどのように関係し合っているのか。あるいはどのようにファイルが作用してWebブラウザに影響を与えているかなどです。ここがわからないと全体像をなかなかイメージできないと思います。チュートリアル教材を読み直す、あるいはClass4で学習しようと思う教材で手を動かしながら確認しましょう。それでもわからないことがあると思います。そんな時は迷わずすぐに検索しましょう！
        ソースコードエディタは多くの機能を持っています。学習を進める過程でご自身に最適なテキストエディタに仕上げてください。
        Webブラウザも奥が深いです。開発者ツール、デバッグツールと呼ばれるものがあって、表示されているWebページの要素、HTMLやCSS、そのほかのファイルのソースコードを見ることができたり、その場限りではありますが、実際にそのソースコードを書き換えて一時的にWebページに変更点を反映させることができます。非常に便利ですのでぜひ調べてみてください。
        命名規則とは、例えばJavaScriptでclass名を決めるときのルールです。実はあれ、ルールがあるんです。
        プログラミング言語は機械に命令を与えるための言語であると同時に、自分以外の開発者にもその内容を伝えるための言語であるとも言えます。[プログラミングで「伝える」コース]では、基本的に個人でのWeb制作を通じた価値の創造を主眼にコースが作成されています。一方で実際にエンジニアとして就職したり、フリーランスのエンジニアとしてプロジェクトを抱えたりする場合には、ほとんどの場合に複数人での開発が必要になります。この際に重要になるのが、命名規則に代表される言語ごとのルールです。言語ですから当然ルールがあります。
        実際にはルールを破っても実行できますが、複数人での開発ではかなり忌避されます。そのほか、コメントでメモを残すことも重要です。コメントを入れないと、見直した時に何がなんの処理かわからなくなってしまう場合や、質問してもレビューしにくいなどという弊害があります。
        かなり現実的に困ることもありますので、もし余裕があれば日頃から気に留めて、誰もが読みやすくルールに則ったコードを書けるように練習をしていきましょう！
        このような話に興味のある方は、命名規則などのルールに関しては、「言語ごとの公式ドキュメント」を、読みやすいコードに関しては「リーダブルコード」や「コード
        綺麗に書く」などのワードで検索すると関連項目が出てくるかと思いますので調べてみることをお勧めします。何か学びがあったら、惜しみなく他の学習者にも共有していきましょう！
        4-3-0　おすすめ教材
        Class4の目的をおさらいすると「各言語に対して、基本文法や記述の仕方、特徴を学ぶ」ことにあります。従って、チュートリアル学習に比べて、ある程度の専門的な教材に取り組んでいくことになります。
        CLOTOでは言語ごとにコミュニティを用意しています。ここに各言語のおすすめ教材やサイトを共有できる掲示板、資料棚のような機能を用意する予定です。また、タイムラインや、プロフィールでも情報共有ができるように随時アップデートして参りますので楽しみにしていてください。
        4-3-1　参考書
        参考書学習では、書籍やPDFといった印刷物で学習していく方法です。特にHTML&CSSや、Webデザイン、ホームページ制作といった教材はかなり充実しており、もはや選ぶのに困るくらいかも知れません。どれも素晴らしいものですので、実際に書店へ行き、自分にとって見やすく、楽しんで取り組めるものを購入しましょう。そしてここでも日にちを空けることなく、なるべく早く一気にやり切ってしまいましょう。
        あえていうのであれば、具体的な書籍名は控えますが、Class4の目的も鑑みると、英語学習で言うところの、「文法演習」「語彙力を増やす」といったような学習をしなくてはならないので、「辞書のように使えるもの」をお勧めします。「逆引きできる」ようなものもいいですね。網羅的に多くのサンプルコードと利用局面が書いてあるようなものも良いかも知れません。
        文法や場面ごとに一つずつコードサンプルが載っていて、細かく練習ができるようなものがいいかも知れません。ボキャブラリーを増やすことが重要です。「HTMLであんなことできたな。」「ここでJavaScript使ってあのアニメーションをつけよう」などと思うことができればしめたものです。
        この辞書のような使い方ができるというのは参考書学習の利点かも知れません。
        参考書学習で気をつけなくてはならないのは、「いつ書かれたものか。」「どのバージョンについて書いたものか。」を誤らないことです。例えば2021年5月現在、HTMLはHTML5ですし、CSSはCSS3というバージョンが最新版で主流です。古いものを買ってしまうと無駄になってしまいますので気をつけましょう。
        4-3-2　公式ドキュメント
        公式ドキュメントとは言語の開発者、団体などがまとめているドキュメントのことで、実はチュートリアルから各要素、文法、構文などが事細かに記述されています。命名規則などのルールも載っていることが多いです。
        開発者や団体などが提供していない場合、第三者が作成した要素リファレンス集などもあります。
        なかなか公式ドキュメントをしっかり読んで学習する人は少ないですが、現役エンジニアの多くは「困ったら公式ドキュメント」と言います。ぜひ学習に役立ててみてください。
        一方で、公式ドキュメントは英語で記述されていることが多いです。専門的な用語も多いので読み進めていくとなると、ハードルもが上がるかと思います。無理して一周目の教材学習で用いる必要はないのかなと思います。しかし、「こういうものがある」ということは絶対に知っておくべきでしょう。
        ちなみにプログラミングを学習する方は、余力があれば英語も学習したほうが絶対に良いです。クラス名や関数名などの理解が早まったり、公式ドキュメントなどを正確に理解することができます。
        4-3-3　ドットインストール
        Class3でも紹介したこの「ドットインストール」ですが、こちらの教材は言語ごとにチュートリアルレベルから、Class4レベルの学習もできるので、ここで再度紹介します。言語で言えば「HTML」「CSS」「JavaScript」「jQuery」。そのほかでいえば「Webサイト制作」などのレッスンに取り組むことをお勧めします。

        <!-- コンテンツ1 -->
        <v-container fluid class="mb-12" id="buy">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー1</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">
            ダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミーダミー
          </p>
          <p>ダミー</p>
        </v-container>

        <!-- コンテンツ2 -->
        <v-container fluid class="mb-12" id="suggest">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー2</span>
          </h2>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '1.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>

          <h5 class="text-h5 font-weight-bold mb-8">ダミー</h5>
          <v-row>
            <v-col cols="6">
              <p class="mb-8">ダミー</p>
            </v-col>
            <v-col cols="6">
              <v-img
                max-width="90%"
                max-height="60vh"
                :src="filePath + '2.png'"
                class="mb-10"
              ></v-img>
            </v-col>
          </v-row>
        </v-container>

        <!-- コンテンツ3 -->
        <v-container fluid class="mb-12" id="cut">
          <h2 class="text-h4 font-weight-bold mb-10">
            <span class="pl-3 grey lighten-3">ダミー3</span>
          </h2>

          <p class="mb-8">ダミー</p>
          <p class="mb-8">ダミー</p>
          <p>ダミー</p>
        </v-container>

        <v-row justify="center" class="mb-4">
          <v-btn dark color="primary" @click="$emit('next')">完了（次へ進む）</v-btn>
        </v-row>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head: {
    title() {
      return {
        inner: this.title,
      };
    },
  },
  data() {
    return {
      title: 'こんてんつ4', // コンテンツタイトル
      contents: [
        { id: '#buy', title: '0-1. ダミー1', activeStart: 0, activeEnd: 596 },
        { id: '#suggest', title: '0-2. ダミー2', activeStart: 596, activeEnd: 1130 },
        { id: '#cut', title: '0-3. ダミー3', activeStart: 1130, activeEnd: 99999 },
      ], // 目次データ

      filePath: this.$docs(this.$route.params.roadName, 'class' + Number(this.$route.params.class)), // コンテンツデータのパス
    };
  },
};
</script>
